<?php 
return array (
  '自然科学研究的方针政策' => 
  array (
  ),
  '科学的哲学原理' => 
  array (
  ),
  '科学的方法论' => 
  array (
  ),
  '自然科学现状及发展' => 
  array (
  ),
  '自然科学研究及自然科学史' => 
  array (
  ),
  '数学范畴' => 
  array (
  ),
  '数学理论' => 
  array (
  ),
  '计算工具' => 
  array (
  ),
  '古典数学总述' => 
  array (
  ),
  '中国古典数学' => 
  array (
  ),
  '各国古典数学' => 
  array (
  ),
  '高等数学' => 
  array (
  ),
  '算术' => 
  array (
  ),
  '初等代数' => 
  array (
  ),
  '初等几何' => 
  array (
  ),
  '三角' => 
  array (
  ),
  '总论' => 
  array (
    0 => '化学原理和方法',
    1 => '化学现状',
    2 => '化学实验(实验化学)',
    3 => '石油、天然气工业经济',
    4 => '石油、天然气地质',
    5 => '石油、天然气能源与节能',
    6 => '一般情况',
    7 => '矿山经济',
    8 => '矿床地质学',
    9 => '耳鼻咽喉科学总论',
    10 => '耳鼻咽喉外科学',
    11 => '耳鼻咽喉结核',
    12 => '耳鼻咽喉梅毒',
    13 => '耳鼻咽喉肿瘤',
    14 => '耳鼻咽喉真菌病',
    15 => '新闻学',
    16 => '新闻采访和报道、编辑工作及新闻摄影',
    17 => '组织、管理与新闻工作者',
    18 => '报纸及其出版发行',
  ),
  '数理逻辑(符号逻辑)' => 
  array (
  ),
  '应用数理逻辑' => 
  array (
  ),
  '数学基础' => 
  array (
  ),
  '集合论' => 
  array (
  ),
  '代数方程论、线性代数' => 
  array (
  ),
  '群论' => 
  array (
  ),
  '抽象代数(近世代数)' => 
  array (
  ),
  '范畴论、同调代数' => 
  array (
  ),
  '微分代数、差分代数' => 
  array (
  ),
  '数论' => 
  array (
  ),
  '组合数学' => 
  array (
  ),
  '离散数学' => 
  array (
  ),
  '模糊数学' => 
  array (
  ),
  '数学分析与应用' => 
  array (
  ),
  '分析基础' => 
  array (
  ),
  '微积分' => 
  array (
  ),
  '无穷级数论(级数论)' => 
  array (
  ),
  '函数论' => 
  array (
  ),
  '微分方程、积分方程' => 
  array (
  ),
  '变分法' => 
  array (
  ),
  '泛函分析' => 
  array (
  ),
  '不等式及其他' => 
  array (
  ),
  '概述' => 
  array (
  ),
  '几何基础(几何学原理)' => 
  array (
  ),
  '解析几何' => 
  array (
  ),
  '向量(矢量)和张量分析' => 
  array (
  ),
  '非欧几何、多维空间几何' => 
  array (
  ),
  '射影(投影)几何、画法几何' => 
  array (
  ),
  '微分几何、积分几何' => 
  array (
  ),
  '代数几何' => 
  array (
  ),
  '拓扑(形势几何学)' => 
  array (
  ),
  '动力系统理论' => 
  array (
  ),
  '运筹学与应用' => 
  array (
  ),
  '规划论' => 
  array (
  ),
  '统筹方法' => 
  array (
  ),
  '最优化的数学理论' => 
  array (
  ),
  '对策论(博弈论)' => 
  array (
  ),
  '排队论(随机服务系统)' => 
  array (
  ),
  '库存论' => 
  array (
  ),
  '更新理论' => 
  array (
  ),
  '搜索理论' => 
  array (
  ),
  '控制论、信息论及其应用' => 
  array (
  ),
  '控制论' => 
  array (
  ),
  '最优控制' => 
  array (
  ),
  '逻辑网络理论' => 
  array (
  ),
  '学习机理论' => 
  array (
  ),
  '模式识别理论' => 
  array (
  ),
  '计算数学概述' => 
  array (
  ),
  '数值计算的理论与方法' => 
  array (
  ),
  '数学模拟、近似计算' => 
  array (
  ),
  '数值软件' => 
  array (
  ),
  '工程数学' => 
  array (
  ),
  '统计学' => 
  array (
  ),
  '经济数学方法' => 
  array (
  ),
  '非线性科学' => 
  array (
  ),
  '系统哲学' => 
  array (
  ),
  '系统学、现代系统理论' => 
  array (
  ),
  '系统工程' => 
  array (
  ),
  '系统科学在各方面的应用' => 
  array (
  ),
  '牛顿定律、达朗伯原理' => 
  array (
  ),
  '力学中的数学方法' => 
  array (
  ),
  '量纲分析与相似理论' => 
  array (
  ),
  '运动学' => 
  array (
  ),
  '静力学' => 
  array (
  ),
  '动力学' => 
  array (
  ),
  '引力理论' => 
  array (
  ),
  '弹道学' => 
  array (
  ),
  '分析力学(解析力学)' => 
  array (
  ),
  '稳定性理论' => 
  array (
  ),
  '陀螺力学(回转仪理论)' => 
  array (
  ),
  '振动理论' => 
  array (
  ),
  '连续介质力学(变形体力学)' => 
  array (
  ),
  '材料力学' => 
  array (
  ),
  '结构力学' => 
  array (
  ),
  '弹性力学' => 
  array (
  ),
  '塑性力学' => 
  array (
  ),
  '粘弹塑性介质力学' => 
  array (
  ),
  '强度理论' => 
  array (
  ),
  '变形固体动力学' => 
  array (
  ),
  '实验应力分析' => 
  array (
  ),
  '普通流体力学' => 
  array (
  ),
  '水动力学' => 
  array (
  ),
  '流体振动与波浪' => 
  array (
  ),
  '气体动力学' => 
  array (
  ),
  '空气动力学' => 
  array (
  ),
  '粘性流体力学' => 
  array (
  ),
  '射流' => 
  array (
  ),
  '多相流' => 
  array (
  ),
  '电磁流体力学' => 
  array (
  ),
  '化学、物理-化学流体力学' => 
  array (
  ),
  '应用流体力学' => 
  array (
  ),
  '物理力学' => 
  array (
  ),
  '流变学' => 
  array (
  ),
  '爆震理论' => 
  array (
  ),
  '爆震波的传播' => 
  array (
  ),
  '爆炸波与物体的相互作用' => 
  array (
  ),
  '爆炸波的观测技术' => 
  array (
  ),
  '穿甲理论' => 
  array (
  ),
  '应用爆炸力学' => 
  array (
  ),
  '应用力学' => 
  array (
  ),
  '物理学总论' => 
  array (
  ),
  '物理学现状、概况' => 
  array (
  ),
  '物理学实验方法与设备' => 
  array (
  ),
  '物理测量' => 
  array (
  ),
  '一般性问题' => 
  array (
    0 => '半导体理论',
    1 => '能源',
    2 => '动力工业三废处理与综合利用',
    3 => '蓄能技术',
    4 => '动力机械',
    5 => '动力厂',
    6 => '检修、维护',
    7 => '半导体材料',
    8 => '半导体器件制造工艺及设备',
    9 => '测量、检验、可靠性及例行试验',
    10 => '微电子理论',
    11 => '微电子设计、分析、计算',
    12 => '制造工艺及设备',
    13 => '设计与性能分析',
    14 => '制造、装配、改装',
    15 => '调整、测试、校验',
    16 => '机房',
  ),
  '物理学的数学方法' => 
  array (
  ),
  '相对论、场论' => 
  array (
  ),
  '量子论' => 
  array (
  ),
  '热力学与统计物理学' => 
  array (
  ),
  '非线性物理学' => 
  array (
  ),
  '声学' => 
  array (
  ),
  '光本性理论' => 
  array (
  ),
  '光辐射、光度学、色度学' => 
  array (
  ),
  '光谱学' => 
  array (
  ),
  'X射线、紫外线、红外线' => 
  array (
  ),
  '几何光学' => 
  array (
  ),
  '物理光学' => 
  array (
  ),
  '波导光学及集成光学' => 
  array (
  ),
  '非线性光学(强光与物质的作用)' => 
  array (
  ),
  '信息光学' => 
  array (
  ),
  '应用光学' => 
  array (
  ),
  '激光原理及激光器研究' => 
  array (
  ),
  '量子光学' => 
  array (
  ),
  '电磁学' => 
  array (
  ),
  '电动力学' => 
  array (
  ),
  '无线电物理学' => 
  array (
  ),
  '气体放电(气体导电)' => 
  array (
  ),
  '阴极电子学' => 
  array (
  ),
  '带电粒子光学' => 
  array (
  ),
  '半导体理论' => 
  array (
  ),
  '半导体性质' => 
  array (
  ),
  '非平衡载流子' => 
  array (
  ),
  '杂质和缺陷' => 
  array (
  ),
  'P-N结' => 
  array (
  ),
  '固体理论' => 
  array (
  ),
  '固体性质' => 
  array (
  ),
  '固体缺陷' => 
  array (
  ),
  '薄膜物理学' => 
  array (
  ),
  '晶体学' => 
  array (
    0 => '几何晶体学',
    1 => 'X射线晶体学',
    2 => '晶体物理',
    3 => '非晶态和类晶态',
    4 => '晶体化学',
    5 => '晶体结构',
    6 => '晶体缺陷',
    7 => '晶体生长',
    8 => '晶体物理化学过程',
    9 => '应用晶体学',
  ),
  '超导电性' => 
  array (
  ),
  '超流性、低温物性' => 
  array (
  ),
  '低温物理实验技术' => 
  array (
  ),
  '超低温(小于1K)的获得' => 
  array (
  ),
  '高压与高温物理学' => 
  array (
  ),
  '综述' => 
  array (
  ),
  '约束与加热' => 
  array (
  ),
  '湍流' => 
  array (
  ),
  '波与不稳定性' => 
  array (
  ),
  '激震波(骇波)' => 
  array (
  ),
  '辐射与测量(诊断技术)' => 
  array (
  ),
  '等离子体物理的应用' => 
  array (
  ),
  '热学' => 
  array (
  ),
  '物质分子运动论' => 
  array (
  ),
  '分子物理学' => 
  array (
  ),
  '原子物理学' => 
  array (
  ),
  '介分子与μ分子' => 
  array (
  ),
  '介原子与μ原子' => 
  array (
  ),
  '电子偶素与μ子素' => 
  array (
  ),
  '原子核物理学' => 
  array (
  ),
  '高能物理学' => 
  array (
  ),
  '波谱学、能谱学' => 
  array (
  ),
  '应用物理学' => 
  array (
  ),
  '生物科学总论' => 
  array (
  ),
  '普通生物学' => 
  array (
  ),
  '细胞学' => 
  array (
  ),
  '遗传学' => 
  array (
  ),
  '普通生理学' => 
  array (
  ),
  '人体生理学' => 
  array (
  ),
  '家畜生理学' => 
  array (
  ),
  '蛋白质、核酸' => 
  array (
  ),
  '酶' => 
  array (
  ),
  '糖、脂类' => 
  array (
  ),
  '维生素、激素、生物体其他化学成份' => 
  array (
  ),
  '物质代谢和能量代谢' => 
  array (
  ),
  '其他生物化学' => 
  array (
  ),
  '生物物理学' => 
  array (
  ),
  '分子生物学及遗传工程' => 
  array (
  ),
  '仿生学' => 
  array (
  ),
  '生物医学工程' => 
  array (
    0 => '生物学',
    1 => '基础理论(医用一般科学）',
    2 => '医用仿生学',
    3 => '生物材料及人工器官',
    4 => '光、激光生物医学',
    5 => '电及影像技术在生物医学中的应用',
    6 => '航空、航天医学工程',
    7 => '其他科学技术在医学上的应用',
    8 => '仪器设备',
  ),
  '生物工程学其它方面的研究与应用' => 
  array (
  ),
  '环境生物学' => 
  array (
  ),
  '古生物学' => 
  array (
    0 => '古人类学',
    1 => '古动物学',
    2 => '古植物学',
    3 => '微体古生物学',
  ),
  '普通微生物学' => 
  array (
  ),
  '病毒学' => 
  array (
  ),
  '医学免疫学' => 
  array (
  ),
  '家畜免疫学' => 
  array (
  ),
  '医学微生物学' => 
  array (
    0 => '医学微生物学总论',
    1 => '病原微生物分类与鉴定',
    2 => '人体病毒学',
    3 => '衣原体属',
    4 => '支原体属',
    5 => '立克次体属',
    6 => '螺旋体属',
    7 => '病原菌',
    8 => '病原真菌与放线菌',
    9 => '其他微生物',
  ),
  '家畜微生物学' => 
  array (
  ),
  '农业、土壤微生物学、工业微生物学、腐蚀微生物学及其它应用微生物学' => 
  array (
  ),
  '植物学研究、实验与植物演化、发展' => 
  array (
  ),
  '植物细胞学与植物遗传学、植物形态学' => 
  array (
  ),
  '植物生理学' => 
  array (
  ),
  '植物生物化学、植物生物物理学' => 
  array (
  ),
  '植物生态学和植物地理学' => 
  array (
  ),
  '植物分类学' => 
  array (
  ),
  '应用植物学' => 
  array (
  ),
  '动物学的研究与实验、动物演化与发展' => 
  array (
  ),
  '动物细胞学、遗传学及形态学' => 
  array (
  ),
  '动物生态学和动物地理学' => 
  array (
  ),
  '动物分类学' => 
  array (
  ),
  '应用动物学' => 
  array (
  ),
  '昆虫生物学' => 
  array (
  ),
  '昆虫分类学' => 
  array (
  ),
  '应用昆虫学' => 
  array (
  ),
  '古人类学' => 
  array (
  ),
  '分子人类学及人类遗传学' => 
  array (
  ),
  '体质人类学与人体测量学' => 
  array (
  ),
  '人体形态学' => 
  array (
    0 => '人体胚胎学',
    1 => '人体解剖学、局部解剖学、解剖生理学',
    2 => '人体组织学与细胞学',
  ),
  '社会人类学、环境优生学和人类生态学' => 
  array (
  ),
  '天文观测设备与观测资料' => 
  array (
  ),
  '天体测量学' => 
  array (
  ),
  '天体力学(理论天文学)' => 
  array (
  ),
  '天体物理学' => 
  array (
  ),
  '恒星天文学、星系天文学、宇宙学' => 
  array (
  ),
  '射电天文学(无线电天文学)' => 
  array (
  ),
  '空间天文学' => 
  array (
  ),
  '太阳系' => 
  array (
  ),
  '时间、历法' => 
  array (
  ),
  '一般理论与方法' => 
  array (
  ),
  '地貌学' => 
  array (
  ),
  '区域自然地理学' => 
  array (
  ),
  '生物地理学' => 
  array (
  ),
  '环境地理学' => 
  array (
  ),
  '其他应用地理学' => 
  array (
  ),
  '土壤学' => 
  array (
    0 => '土壤形成及演化',
    1 => '土壤物理学、土壤化学',
    2 => '土壤生物学',
    3 => '土壤类型、土壤分类学',
    4 => '土壤改良',
    5 => '水土保持',
    6 => '土壤肥力',
    7 => '土壤地理、土壤调查',
    8 => '土壤物理学',
    9 => '土壤化学、土壤物理化学',
  ),
  '普通测量学、地形测量学' => 
  array (
  ),
  '大地测量学' => 
  array (
  ),
  '摄影测量学与测绘遥感' => 
  array (
  ),
  '地籍学' => 
  array (
  ),
  '地图学及制图学' => 
  array (
  ),
  '测绘仪器及使用' => 
  array (
  ),
  '工程测量学、专业测绘' => 
  array (
  ),
  '气象工作及气象经济' => 
  array (
  ),
  '气象基础科学' => 
  array (
  ),
  '大气探测(气象观测)' => 
  array (
  ),
  '气象要素及大气现象' => 
  array (
  ),
  '动力气象学' => 
  array (
  ),
  '天气学' => 
  array (
  ),
  '天气预报' => 
  array (
  ),
  '气候学' => 
  array (
  ),
  '气象灾害学' => 
  array (
  ),
  '应用气象学' => 
  array (
  ),
  '气象设备仪器制造、使用' => 
  array (
  ),
  '人工影响天气' => 
  array (
  ),
  '海洋学' => 
  array (
    0 => '海洋调查技术方法与设备',
    1 => '区域海洋学',
    2 => '海洋气象学',
    3 => '海洋水文学',
    4 => '海洋物理学',
    5 => '海洋化学',
    6 => '海洋生物学',
    7 => '海洋地质学、海洋地貌学',
    8 => '海洋资源与开发',
    9 => '海洋工程',
    10 => '海洋环境及海洋保护学',
    11 => '海洋灾害',
  ),
  '海洋调查技术方法与设备' => 
  array (
  ),
  '区域海洋学' => 
  array (
  ),
  '海洋气象学' => 
  array (
  ),
  '海洋水文学' => 
  array (
  ),
  '海洋物理学' => 
  array (
  ),
  '海洋化学' => 
  array (
  ),
  '海洋生物学' => 
  array (
  ),
  '海洋地球物理学' => 
  array (
  ),
  '海洋地质学、海洋地貌学' => 
  array (
  ),
  '海洋资源与开发' => 
  array (
  ),
  '海洋工程' => 
  array (
  ),
  '海洋环境及海洋保护学' => 
  array (
  ),
  '海洋灾害' => 
  array (
  ),
  '总论及地质管理学' => 
  array (
  ),
  '地质经济学' => 
  array (
  ),
  '岩溶地质学' => 
  array (
  ),
  '地震灾害及地震地质学' => 
  array (
  ),
  '动力地质灾害及灾害地质学' => 
  array (
  ),
  '火山学' => 
  array (
  ),
  '冻土学' => 
  array (
  ),
  '海洋地质灾害' => 
  array (
  ),
  '矿物分类' => 
  array (
  ),
  '宝石学' => 
  array (
  ),
  '岩浆岩(火成岩)' => 
  array (
  ),
  '沉积岩' => 
  array (
  ),
  '变质岩' => 
  array (
  ),
  '古动物学' => 
  array (
  ),
  '古植物学' => 
  array (
  ),
  '微体古生物学' => 
  array (
  ),
  '古地理学及古气候学' => 
  array (
  ),
  '各时代地史及地层学' => 
  array (
  ),
  '动力地质学' => 
  array (
  ),
  '构造地质学' => 
  array (
  ),
  '地质力学' => 
  array (
  ),
  '区域地质学' => 
  array (
  ),
  '金属矿床' => 
  array (
  ),
  '非金属矿床' => 
  array (
  ),
  '煤田地质学' => 
  array (
  ),
  '油气地质学' => 
  array (
  ),
  '地球化学' => 
  array (
  ),
  '遥感勘探' => 
  array (
  ),
  '地质普查与地质测量' => 
  array (
  ),
  '地球物理勘探' => 
  array (
  ),
  '地球化学勘探' => 
  array (
  ),
  '地质勘探' => 
  array (
  ),
  '数学勘探' => 
  array (
  ),
  '同位素勘探' => 
  array (
  ),
  '坑探工程(山地工作)' => 
  array (
  ),
  '钻探工程' => 
  array (
  ),
  '宇宙地质学' => 
  array (
  ),
  '海洋地质学' => 
  array (
  ),
  '水文地质学(地下水水文学)' => 
  array (
  ),
  '工程地质学' => 
  array (
  ),
  '环境地质学' => 
  array (
  ),
  '地质勘探仪器' => 
  array (
  ),
  '钻探设备' => 
  array (
  ),
  '一般理论' => 
  array (
  ),
  '地球起源及演化' => 
  array (
  ),
  '地球形状学及地球结构' => 
  array (
  ),
  '地球重力学' => 
  array (
  ),
  '大地构造物理学、岩组学(构造岩石学)' => 
  array (
  ),
  '地热学、火山学' => 
  array (
  ),
  '地磁学' => 
  array (
  ),
  '地电学' => 
  array (
  ),
  '水文调查、观测、实验分析' => 
  array (
  ),
  '水文物理与化学' => 
  array (
  ),
  '水文预报' => 
  array (
  ),
  '陆地水文学、水文地理学' => 
  array (
  ),
  '冰雪水文学' => 
  array (
  ),
  '河流水文学及湖泊学' => 
  array (
  ),
  '水力学及河流动力学' => 
  array (
  ),
  '应用水文学' => 
  array (
  ),
  '水文观测仪器设备' => 
  array (
  ),
  '空间物理' => 
  array (
  ),
  '地震地球物理学' => 
  array (
  ),
  '勘查地球物理学' => 
  array (
  ),
  '工程及水文地球物理勘探' => 
  array (
  ),
  '地球物理勘测仪器' => 
  array (
  ),
  '资源经济学' => 
  array (
  ),
  '资源地理学' => 
  array (
  ),
  '资源法' => 
  array (
  ),
  '资源合理利用、管理与保护技术' => 
  array (
  ),
  '土地资源' => 
  array (
  ),
  '水资源' => 
  array (
  ),
  '农业资源' => 
  array (
  ),
  '生物资源' => 
  array (
  ),
  '矿产资源' => 
  array (
  ),
  '能源资源' => 
  array (
  ),
  '海洋资源' => 
  array (
  ),
  '旅游资源' => 
  array (
    0 => '中国旅游地理',
    1 => '世界旅游地理',
  ),
  '森林资源' => 
  array (
  ),
  '化学原理和方法' => 
  array (
  ),
  '化学现状' => 
  array (
  ),
  '化学实验(实验化学)' => 
  array (
  ),
  '化学元素与无机化合物' => 
  array (
  ),
  '周期系统各族元素' => 
  array (
  ),
  '非金属元素及其化合物' => 
  array (
  ),
  '金属元素及其化合物' => 
  array (
  ),
  '放射性元素、放射化学' => 
  array (
  ),
  '稀有元素与分散元素' => 
  array (
  ),
  '有机化学一般性问题' => 
  array (
  ),
  '各类有机化合物' => 
  array (
  ),
  '脂肪族化合物(无环化合物)' => 
  array (
  ),
  '碳环化合物、脂环族化合物' => 
  array (
  ),
  '芳香族化合物' => 
  array (
  ),
  '杂环化合物' => 
  array (
  ),
  '元素有机化合物' => 
  array (
  ),
  '含同位素化合物' => 
  array (
  ),
  '天然化合物' => 
  array (
  ),
  '高分子物理和高分子物理化学' => 
  array (
  ),
  '碳链聚合物' => 
  array (
  ),
  '杂链聚合物' => 
  array (
  ),
  '元素有机聚合物' => 
  array (
  ),
  '无机高分子化合物(高聚物)' => 
  array (
  ),
  '天然高分子化合物(高聚物)' => 
  array (
  ),
  '结构化学' => 
  array (
  ),
  '化学热力学、热化学、热力学平衡' => 
  array (
  ),
  '化学动力学、催化作用' => 
  array (
  ),
  '光化学、辐射化学、超声波作用的化学过程' => 
  array (
  ),
  '溶液' => 
  array (
  ),
  '电化学、电解、磁化学' => 
  array (
  ),
  '表面现象的物理化学' => 
  array (
  ),
  '胶体化学(分散体系的物理化学)' => 
  array (
  ),
  '半导体化学' => 
  array (
  ),
  '分析化学基础理论' => 
  array (
  ),
  '分析作业方法与技术' => 
  array (
  ),
  '无机分析' => 
  array (
  ),
  '有机分析' => 
  array (
  ),
  '仪器分析法总论及电化学仪器分析法' => 
  array (
  ),
  '磁化学分析法' => 
  array (
  ),
  '光化学分析法(光谱分析法)' => 
  array (
  ),
  '放射化学分析法、活化分析' => 
  array (
  ),
  '超声波分析法' => 
  array (
  ),
  '质谱分析' => 
  array (
  ),
  '色谱分析' => 
  array (
  ),
  '其他物理及物理化学分析法' => 
  array (
  ),
  '元素及化合物的分离方法' => 
  array (
  ),
  '气体分析、液体分析、水分析' => 
  array (
  ),
  '应用化学' => 
  array (
  ),
  '几何晶体学' => 
  array (
  ),
  'X射线晶体学' => 
  array (
  ),
  '晶体物理' => 
  array (
  ),
  '非晶态和类晶态' => 
  array (
  ),
  '晶体化学' => 
  array (
  ),
  '晶体结构' => 
  array (
  ),
  '晶体缺陷' => 
  array (
  ),
  '晶体生长' => 
  array (
  ),
  '晶体物理化学过程' => 
  array (
  ),
  '应用晶体学' => 
  array (
  ),
  '无机化学' => 
  array (
    0 => '化学元素与无机化合物',
    1 => '周期系统各族元素',
    2 => '非金属元素及其化合物',
    3 => '金属元素及其化合物',
    4 => '放射性元素、放射化学',
    5 => '稀有元素与分散元素',
  ),
  '基础理论' => 
  array (
  ),
  '化学反应过程' => 
  array (
  ),
  '化工原料、辅助物料' => 
  array (
  ),
  '化工机械与仪器、设备' => 
  array (
  ),
  '化工生产过程、化工产品与副产品' => 
  array (
  ),
  '化工厂' => 
  array (
  ),
  '无机化学工业废物处理与综合利用' => 
  array (
  ),
  '化学工业经济' => 
  array (
  ),
  '基本无机化学工业' => 
  array (
  ),
  '非金属元素及其无机化合物化学工业' => 
  array (
  ),
  '金属元素的无机化合物化学工业' => 
  array (
  ),
  '电化学工业' => 
  array (
  ),
  '电热工业、高温制品工业' => 
  array (
  ),
  '玻璃工业' => 
  array (
  ),
  '水泥工业' => 
  array (
  ),
  '搪瓷、石棉工业' => 
  array (
  ),
  '陶瓷工业' => 
  array (
  ),
  '耐火材料工业' => 
  array (
  ),
  '人造石及其他胶凝材料' => 
  array (
  ),
  '有机化学' => 
  array (
    0 => '有机化学一般性问题',
    1 => '各类有机化合物',
    2 => '脂肪族化合物(无环化合物)',
    3 => '碳环化合物、脂环族化合物',
    4 => '芳香族化合物',
    5 => '杂环化合物',
    6 => '元素有机化合物',
    7 => '含同位素化合物',
    8 => '天然化合物',
  ),
  '高分子化学(高聚物)' => 
  array (
    0 => '高分子物理和高分子物理化学',
    1 => '碳链聚合物',
    2 => '杂链聚合物',
    3 => '元素有机聚合物',
    4 => '无机高分子化合物(高聚物)',
    5 => '天然高分子化合物(高聚物)',
  ),
  '化工过程(物理过程及物理化学过程)' => 
  array (
  ),
  '化工原料辅助物料' => 
  array (
  ),
  '有机化学工业废物的处理与综合利用' => 
  array (
  ),
  '脂肪族化合物(无环化合物)的生产' => 
  array (
  ),
  '碳环化合物、脂环族化合物的生产' => 
  array (
  ),
  '芳香族化合物的生产' => 
  array (
  ),
  '杂环化合物的生产' => 
  array (
  ),
  '其它有机化合物的生产' => 
  array (
  ),
  '原料与辅助物料' => 
  array (
  ),
  '机械与设备' => 
  array (
  ),
  '生产过程' => 
  array (
  ),
  '高分子化合物产品' => 
  array (
  ),
  '高分子化合物工厂' => 
  array (
  ),
  '一般问题' => 
  array (
  ),
  '天然高分子树脂与塑料' => 
  array (
  ),
  '合成树脂及塑料' => 
  array (
  ),
  '缩聚类树脂及塑料' => 
  array (
  ),
  '特种塑料' => 
  array (
  ),
  '聚合类树脂与塑料' => 
  array (
  ),
  '增强塑料、填充塑料' => 
  array (
  ),
  '泡沫塑料' => 
  array (
  ),
  '胶乳' => 
  array (
  ),
  '天然橡胶' => 
  array (
  ),
  '合成橡胶' => 
  array (
  ),
  '热塑弹性体' => 
  array (
  ),
  '再生橡胶' => 
  array (
  ),
  '橡胶制品' => 
  array (
  ),
  '胶乳制品及其他制品' => 
  array (
  ),
  '再生纤维' => 
  array (
  ),
  '合成纤维' => 
  array (
  ),
  '无机纤维' => 
  array (
  ),
  '木材化学加工工业' => 
  array (
  ),
  '纤维素化学加工工业' => 
  array (
  ),
  '植物纤维水解工业' => 
  array (
  ),
  '造纸工业' => 
  array (
  ),
  '溶剂与增塑剂的生产' => 
  array (
  ),
  '一般性问题与试剂及光化学物质' => 
  array (
  ),
  '表面活性剂' => 
  array (
  ),
  '吸附剂' => 
  array (
  ),
  '离子交换剂' => 
  array (
  ),
  '催化剂(触媒)' => 
  array (
  ),
  '胶体与半胶体物质' => 
  array (
  ),
  '胶粘剂工业' => 
  array (
  ),
  '化学肥料工业' => 
  array (
  ),
  '农药工业' => 
  array (
  ),
  '中草药制剂的生产' => 
  array (
  ),
  '无机化合物药物及生物制品药物的生产' => 
  array (
  ),
  '燃料化学工业' => 
  array (
  ),
  '炼焦化学工业' => 
  array (
  ),
  '煤化学基础理论' => 
  array (
  ),
  '煤的性质与测定' => 
  array (
  ),
  '煤的燃烧' => 
  array (
  ),
  '煤的加工利用' => 
  array (
  ),
  '煤炭气化工业' => 
  array (
  ),
  '燃料照明工业' => 
  array (
  ),
  '爆炸物工业' => 
  array (
  ),
  '航天用燃料' => 
  array (
  ),
  '石油的组成、性质与分析' => 
  array (
  ),
  '炼油工艺过程' => 
  array (
  ),
  '石油产品' => 
  array (
  ),
  '天然气加工' => 
  array (
  ),
  '石油化学工业' => 
  array (
  ),
  '人造石油' => 
  array (
  ),
  '染料及中间体工业' => 
  array (
  ),
  '颜料工业' => 
  array (
  ),
  '各种涂料' => 
  array (
  ),
  '涂料的施工' => 
  array (
  ),
  '油脂和蜡工业' => 
  array (
  ),
  '肥皂工业' => 
  array (
  ),
  '合成洗涤剂工业' => 
  array (
  ),
  '食用油脂加工工业' => 
  array (
  ),
  '香料及化妆品工业' => 
  array (
  ),
  '感光理论' => 
  array (
  ),
  '原料及辅助物料、机械与设备' => 
  array (
  ),
  '生产工艺' => 
  array (
  ),
  '感光材料' => 
  array (
  ),
  '磁性记录材料工业' => 
  array (
  ),
  '石油、天然气工业经济' => 
  array (
  ),
  '石油、天然气地质' => 
  array (
  ),
  '石油、天然气能源与节能' => 
  array (
  ),
  '油气勘探' => 
  array (
  ),
  '油气钻井工程' => 
  array (
  ),
  '油气开采工程' => 
  array (
  ),
  '油页岩、地下煤气开采工程' => 
  array (
  ),
  '油气勘探开采机械、仪器与设备' => 
  array (
  ),
  '石油炼制' => 
  array (
    0 => '石油的组成、性质与分析',
    1 => '炼油工艺过程',
    2 => '石油产品',
  ),
  '油气加工厂' => 
  array (
  ),
  '油气加工厂机械设备' => 
  array (
  ),
  '矿场油气集输与处理' => 
  array (
  ),
  '油气输送与运输' => 
  array (
  ),
  '油气储存工程' => 
  array (
  ),
  '油气储运安全技术' => 
  array (
  ),
  '油气储运机械设备制造及应用' => 
  array (
  ),
  '油气工程环境保护与综合利用' => 
  array (
  ),
  '油气机械设备的腐蚀与防护' => 
  array (
  ),
  '材料一般性问题' => 
  array (
  ),
  '材料试验' => 
  array (
  ),
  '金属材料' => 
  array (
  ),
  '无机非金属材料' => 
  array (
  ),
  '有机非金属材料' => 
  array (
  ),
  '高分子材料' => 
  array (
  ),
  '复合材料' => 
  array (
  ),
  '功能材料' => 
  array (
  ),
  '耐高温材料、耐低温材料' => 
  array (
  ),
  '耐腐蚀材料' => 
  array (
  ),
  '智能材料' => 
  array (
  ),
  '纳米材料' => 
  array (
  ),
  '薄膜材料' => 
  array (
  ),
  '粉体材料' => 
  array (
  ),
  '其他特种结构材料' => 
  array (
  ),
  '仿生材料' => 
  array (
  ),
  '超导材料' => 
  array (
  ),
  '其他材料' => 
  array (
  ),
  '一般情况' => 
  array (
  ),
  '矿山经济' => 
  array (
  ),
  '矿床地质学' => 
  array (
  ),
  '勘探技术方法' => 
  array (
  ),
  '勘探工程学' => 
  array (
    0 => '坑探工程(山地工作)',
    1 => '钻探工程',
  ),
  '矿山测量与制图' => 
  array (
  ),
  '矿山测量勘探设备与仪器' => 
  array (
  ),
  '矿山设计与地面建设' => 
  array (
  ),
  '凿岩爆破工程' => 
  array (
  ),
  '井巷工程' => 
  array (
  ),
  '支护工程与设备' => 
  array (
  ),
  '煤矿及油页岩开采' => 
  array (
  ),
  '煤及油页岩地下气化' => 
  array (
  ),
  '金属矿产开采' => 
  array (
  ),
  '非金属矿产开采' => 
  array (
  ),
  '采掘机械' => 
  array (
  ),
  '矿山运输与设备' => 
  array (
  ),
  '矿山安全与卫生保护' => 
  array (
  ),
  '通风工程' => 
  array (
  ),
  '矿井大气' => 
  array (
  ),
  '防火、排水工程' => 
  array (
  ),
  '矿山供电及自动化工程' => 
  array (
  ),
  '矿山通讯及照明工程' => 
  array (
  ),
  '选矿理论' => 
  array (
  ),
  '选矿流程及方法' => 
  array (
  ),
  '选煤' => 
  array (
  ),
  '金属矿选矿' => 
  array (
  ),
  '非金属矿选矿' => 
  array (
  ),
  '选矿厂' => 
  array (
  ),
  '选矿机械设备及器材' => 
  array (
  ),
  '矿产资源综合利用' => 
  array (
  ),
  '矿业工程三废处理' => 
  array (
  ),
  '金属学（物理冶金）一般问题' => 
  array (
  ),
  '金属物理学' => 
  array (
  ),
  '金属的组织与性能' => 
  array (
  ),
  '金属的分析试验' => 
  array (
  ),
  '合金学与各种性质合金' => 
  array (
  ),
  '热处理' => 
  array (
  ),
  '金属腐蚀与保护、金属表面处理' => 
  array (
  ),
  '铸造理论' => 
  array (
  ),
  '铸造原材料及配制' => 
  array (
  ),
  '铸造机械设备' => 
  array (
  ),
  '铸造工艺' => 
  array (
  ),
  '特种铸造' => 
  array (
  ),
  '铸铁件铸造' => 
  array (
  ),
  '钢件铸造' => 
  array (
  ),
  '合金铸造' => 
  array (
  ),
  '铸造车间(厂)' => 
  array (
  ),
  '有色金属铸造' => 
  array (
  ),
  '锻造、锻压与锻工' => 
  array (
  ),
  '轧制' => 
  array (
  ),
  '拉制、拉拔' => 
  array (
  ),
  '挤压' => 
  array (
  ),
  '冷冲床(钣金加工)' => 
  array (
  ),
  '高能成型' => 
  array (
  ),
  '焊接一般性问题' => 
  array (
  ),
  '焊接材料' => 
  array (
  ),
  '焊接设备' => 
  array (
  ),
  '焊接工艺' => 
  array (
  ),
  '焊接的应用' => 
  array (
  ),
  '金属切割及设备' => 
  array (
  ),
  '粘接、胶接' => 
  array (
  ),
  '车削加工及车床(旋床)' => 
  array (
  ),
  '钻削加工及钻床' => 
  array (
  ),
  '镗削加工及镗床' => 
  array (
  ),
  '铣削加工及铣床' => 
  array (
  ),
  '刨削加工、刨床与插床(立刨)' => 
  array (
  ),
  '锯削加工与锯床、锉床' => 
  array (
  ),
  '拉削加工与拉床' => 
  array (
  ),
  '磨削加工与磨床' => 
  array (
  ),
  '齿轮加工及齿轮机床' => 
  array (
  ),
  '螺纹加工及螺纹加工机床' => 
  array (
  ),
  '刻线加工及刻线机' => 
  array (
  ),
  '仪表加工及仪表机床' => 
  array (
  ),
  '组合机床及其加工' => 
  array (
  ),
  '程序控制机床、数控机床及其加工' => 
  array (
  ),
  '特种加工机床及其加工' => 
  array (
  ),
  '机床加工生产自动化' => 
  array (
  ),
  '刀具' => 
  array (
  ),
  '磨料' => 
  array (
  ),
  '磨具、研具' => 
  array (
  ),
  '夹具' => 
  array (
  ),
  '模具' => 
  array (
  ),
  '手工具' => 
  array (
  ),
  '长度测量及其量仪' => 
  array (
  ),
  '角度测量及其量仪' => 
  array (
  ),
  '形位偏差测量及其量仪' => 
  array (
  ),
  '表面光洁度(表面粗糙度)的测量及其量仪' => 
  array (
  ),
  '螺纹测量与其量仪' => 
  array (
  ),
  '齿轮测量及其量仪' => 
  array (
  ),
  '自动量仪' => 
  array (
  ),
  '钳工工艺与装配工艺' => 
  array (
  ),
  '冶金工艺总论' => 
  array (
  ),
  '冶金工业经济' => 
  array (
  ),
  '冶金原理' => 
  array (
  ),
  '冶炼计算' => 
  array (
  ),
  '冶炼试验与分析' => 
  array (
  ),
  '冶炼原料及矿石预处理' => 
  array (
  ),
  '冶金燃料与燃烧' => 
  array (
  ),
  '冶金炉' => 
  array (
  ),
  '冶金工厂' => 
  array (
  ),
  '冶金工业废物处理与综合利用' => 
  array (
  ),
  '提炼冶金' => 
  array (
  ),
  '粉末冶金' => 
  array (
  ),
  '真空冶金' => 
  array (
  ),
  '电渣重熔' => 
  array (
  ),
  '原子能冶金' => 
  array (
  ),
  '纤维冶金' => 
  array (
  ),
  '卤素冶金' => 
  array (
  ),
  '微生物冶金' => 
  array (
  ),
  '其他冶金技术' => 
  array (
  ),
  '钢铁冶炼机械与生产自动化' => 
  array (
  ),
  '炼铁机械与生产自动化' => 
  array (
  ),
  '铁合金冶炼机械与自动化' => 
  array (
  ),
  '炼钢机械与生产自动化' => 
  array (
  ),
  '有色冶金机械与生产自动化' => 
  array (
  ),
  '粉末冶金机械与生产自动化' => 
  array (
  ),
  '钢铁冶炼(黑色金属冶炼)(总论)' => 
  array (
  ),
  '理论与计算' => 
  array (
  ),
  '原材料' => 
  array (
  ),
  '高炉熔冶过程' => 
  array (
  ),
  '高炉操作' => 
  array (
  ),
  '铁矿石直接还原' => 
  array (
  ),
  '其他炼铁法' => 
  array (
  ),
  '炼铁炉(高炉)' => 
  array (
  ),
  '炼铁厂' => 
  array (
  ),
  '炼铁产品' => 
  array (
  ),
  '铁合金冶炼' => 
  array (
  ),
  '转炉炼钢' => 
  array (
  ),
  '氧气转炉炼钢' => 
  array (
  ),
  '平炉炼钢' => 
  array (
  ),
  '电炉炼钢' => 
  array (
  ),
  '混合炼钢' => 
  array (
  ),
  '其他炼钢法' => 
  array (
  ),
  '早期炼钢法' => 
  array (
  ),
  '炼钢炉' => 
  array (
  ),
  '炼钢厂' => 
  array (
  ),
  '各种钢的冶炼' => 
  array (
  ),
  '钢液二次精炼和炉外处理' => 
  array (
  ),
  '铸锭' => 
  array (
  ),
  '其他黑色金属冶炼' => 
  array (
  ),
  '重金属冶炼' => 
  array (
  ),
  '轻金属冶炼' => 
  array (
  ),
  '贵金属及铂族金属冶炼' => 
  array (
  ),
  '稀有金属冶炼' => 
  array (
  ),
  '棉纺织' => 
  array (
  ),
  '麻纺织' => 
  array (
  ),
  '毛纺织' => 
  array (
  ),
  '丝纺织' => 
  array (
  ),
  '化学纤维纺织' => 
  array (
  ),
  '非织造布' => 
  array (
  ),
  '针织' => 
  array (
  ),
  '染整工业' => 
  array (
  ),
  '粮食加工工业' => 
  array (
  ),
  '淀粉工业' => 
  array (
  ),
  '制糖工业' => 
  array (
  ),
  '屠宰及肉类加工工业' => 
  array (
  ),
  '乳品加工工业' => 
  array (
  ),
  '蛋品加工工业' => 
  array (
  ),
  '水产加工工业' => 
  array (
  ),
  '水果、蔬菜、坚果加工工业' => 
  array (
  ),
  '酿造工业' => 
  array (
  ),
  '饮料冷食制造工业' => 
  array (
  ),
  '罐头工业' => 
  array (
  ),
  '保健食品' => 
  array (
  ),
  '制盐工业' => 
  array (
  ),
  '烟草工业' => 
  array (
  ),
  '皮革工业' => 
  array (
  ),
  '木材加工工业、家具制造工业' => 
  array (
  ),
  '印刷工业' => 
  array (
  ),
  '五金制品工业' => 
  array (
  ),
  '工艺美术制品工业' => 
  array (
  ),
  '服装工业、制鞋工业' => 
  array (
  ),
  '其他轻工业、手工业' => 
  array (
  ),
  '轻工业废物处理与综合利用' => 
  array (
  ),
  '美食学' => 
  array (
  ),
  '烹饪法、食谱、菜谱' => 
  array (
  ),
  '饮食设备及管理' => 
  array (
  ),
  '洗染、缝补' => 
  array (
  ),
  '美容、沐浴、清洁' => 
  array (
  ),
  '居住管理' => 
  array (
  ),
  '家庭管理、家庭生活、家庭服务' => 
  array (
  ),
  '劳动保护基础理论' => 
  array (
  ),
  '劳动保护管理' => 
  array (
  ),
  '总论工业安全' => 
  array (
  ),
  '爆炸安全与防火防爆' => 
  array (
  ),
  '锅炉、压力容器安全' => 
  array (
  ),
  '电气安全' => 
  array (
  ),
  '地质勘探安全' => 
  array (
  ),
  '矿山安全' => 
  array (
  ),
  '石油、化学工业安全' => 
  array (
  ),
  '冶金工业安全' => 
  array (
  ),
  '机械、金属工艺安全' => 
  array (
  ),
  '焊接工艺安全' => 
  array (
  ),
  '起重及搬运安全' => 
  array (
  ),
  '武器工业安全' => 
  array (
  ),
  '动力工业安全' => 
  array (
  ),
  '核工业安全' => 
  array (
  ),
  '建筑施工安全' => 
  array (
  ),
  '轻工业、手工业安全' => 
  array (
  ),
  '航空、航天安全' => 
  array (
  ),
  '交通运输安全' => 
  array (
  ),
  '农、林、渔业安全' => 
  array (
  ),
  '生活安全及其它' => 
  array (
  ),
  '作业环境卫生' => 
  array (
  ),
  '工业通风' => 
  array (
  ),
  '工业照明' => 
  array (
  ),
  '工业防尘' => 
  array (
  ),
  '工业防毒' => 
  array (
  ),
  '噪声与振动控制' => 
  array (
  ),
  '异常气压防护' => 
  array (
  ),
  '高低温防护' => 
  array (
  ),
  '自然灾害及其防治' => 
  array (
  ),
  '人为灾害及其防治' => 
  array (
  ),
  '环境保护政策法令、标准、教育' => 
  array (
  ),
  '环境数学' => 
  array (
  ),
  '环境物理学' => 
  array (
  ),
  '环境化学' => 
  array (
  ),
  '环境地学' => 
  array (
  ),
  '环境气象学、环境空气动力学' => 
  array (
  ),
  '环境医学、环境心理学、环境系统学、环境经济学' => 
  array (
  ),
  '环境与环境系统' => 
  array (
  ),
  '人类、资源、能源与环境的关系' => 
  array (
  ),
  '环境容量与环境自净' => 
  array (
  ),
  '环境与发展' => 
  array (
  ),
  '环境规划与环境管理' => 
  array (
  ),
  '环境卫生与卫生工程' => 
  array (
  ),
  '放射卫生与辐射防护' => 
  array (
  ),
  '环境与清洁生产' => 
  array (
  ),
  '大气污染及其防治' => 
  array (
  ),
  '水体污染及其防治' => 
  array (
  ),
  '土壤污染及其防治' => 
  array (
  ),
  '其他环境污染及其防治' => 
  array (
  ),
  '废物处理与综合利用' => 
  array (
  ),
  '环境质量分析与评价' => 
  array (
  ),
  '环境监测' => 
  array (
  ),
  '环境监测网、站，监测系统，监测仪器设备及环境遥感' => 
  array (
  ),
  '工程基础科学概论' => 
  array (
  ),
  '工程力学' => 
  array (
  ),
  '工程化学' => 
  array (
  ),
  '工程天文学、工程仿生学、人体工程学' => 
  array (
  ),
  '工程物理学' => 
  array (
  ),
  '工程设计' => 
  array (
  ),
  '工程测量、制图、模拟' => 
  array (
  ),
  '爆破技术' => 
  array (
  ),
  '薄膜技术' => 
  array (
  ),
  '粉末技术' => 
  array (
  ),
  '工业设计' => 
  array (
  ),
  '干燥技术' => 
  array (
  ),
  '遥感技术' => 
  array (
  ),
  '液压传动' => 
  array (
  ),
  '包装工程' => 
  array (
  ),
  '防伪技术' => 
  array (
  ),
  '密封技术' => 
  array (
  ),
  '工厂、车间' => 
  array (
  ),
  '清洗技术' => 
  array (
  ),
  '总论、声学仪器及声学测量' => 
  array (
  ),
  '振动、噪声及其控制' => 
  array (
  ),
  '电声、光声、水声、超声工程' => 
  array (
  ),
  '制冷理论' => 
  array (
  ),
  '制冷材料、制冷机械和设备及应用' => 
  array (
  ),
  '真空技术' => 
  array (
  ),
  '摄影技术' => 
  array (
    0 => '设备、辅料',
    1 => '光学镜头与滤光器',
  ),
  '设备、辅料' => 
  array (
  ),
  '光学镜头与滤光器' => 
  array (
  ),
  '计量学' => 
  array (
  ),
  '工业技术概论' => 
  array (
  ),
  '机械工业总论' => 
  array (
  ),
  '机械工业经济' => 
  array (
  ),
  '机械原理' => 
  array (
  ),
  '机构学' => 
  array (
  ),
  '机械动力学' => 
  array (
  ),
  '机械强度' => 
  array (
  ),
  '机械精确度' => 
  array (
  ),
  '机械摩擦、磨损与润滑' => 
  array (
  ),
  '机械设计概论' => 
  array (
  ),
  '标准、规格' => 
  array (
  ),
  '机械设计' => 
  array (
  ),
  '机械计算' => 
  array (
  ),
  '机械制图' => 
  array (
  ),
  '机械模型' => 
  array (
  ),
  '联接及联接零件' => 
  array (
  ),
  '机械传动机构' => 
  array (
  ),
  '转动机件' => 
  array (
  ),
  '控制机件' => 
  array (
  ),
  '弹簧' => 
  array (
  ),
  '其他机械元件' => 
  array (
  ),
  '气压传动' => 
  array (
  ),
  '其他传动' => 
  array (
  ),
  '非金属材料' => 
  array (
    0 => '无机非金属材料',
    1 => '有机非金属材料',
    2 => '高分子材料',
  ),
  '机械制造工艺概论' => 
  array (
  ),
  '机械加工精度理论' => 
  array (
  ),
  '工艺设计' => 
  array (
  ),
  '成组工艺' => 
  array (
  ),
  '计算机辅助机械制造' => 
  array (
  ),
  '柔性制造系统及柔性制造单元' => 
  array (
  ),
  '计算机集成制造' => 
  array (
  ),
  '机械运行与维修' => 
  array (
  ),
  '机械工厂(车间)' => 
  array (
  ),
  '起重机械' => 
  array (
  ),
  '运输机械' => 
  array (
  ),
  '装卸机械' => 
  array (
  ),
  '泵' => 
  array (
  ),
  '压缩空气工程' => 
  array (
  ),
  '通风机' => 
  array (
  ),
  '鼓风机' => 
  array (
  ),
  '压缩机、压气机' => 
  array (
  ),
  '其他气动工具' => 
  array (
  ),
  '各种用途气体压缩输送机械' => 
  array (
  ),
  '压力容器' => 
  array (
  ),
  '专用机械与设备' => 
  array (
  ),
  '仪器、仪表概论' => 
  array (
  ),
  '计量仪器' => 
  array (
  ),
  '坐标器、计算机具、计数器' => 
  array (
  ),
  '物理学与力学一般仪器' => 
  array (
  ),
  '光学仪器' => 
  array (
  ),
  '天文仪器' => 
  array (
  ),
  '地球科学仪器' => 
  array (
  ),
  '医药卫生器械' => 
  array (
  ),
  '生物科学与农林科学仪器' => 
  array (
  ),
  '热工量的测量仪表' => 
  array (
  ),
  '力学量测量仪表' => 
  array (
  ),
  '成分分析仪器' => 
  array (
  ),
  '质谱仪' => 
  array (
  ),
  '显示仪表' => 
  array (
  ),
  '工业自动化仪表' => 
  array (
  ),
  '材料试验机与试验仪器' => 
  array (
  ),
  '其他仪器仪表' => 
  array (
  ),
  '航空、航天的发展与空间探索' => 
  array (
  ),
  '航空、航天的应用' => 
  array (
  ),
  '航空运输经济' => 
  array (
  ),
  '流体力学' => 
  array (
    0 => '普通流体力学',
    1 => '水动力学',
    2 => '流体振动与波浪',
    3 => '气体动力学',
    4 => '粘性流体力学',
    5 => '射流',
    6 => '多相流',
    7 => '电磁流体力学',
    8 => '化学、物理-化学流体力学',
    9 => '应用流体力学',
    10 => '物理力学',
  ),
  '飞行力学' => 
  array (
  ),
  '航空器结构力学' => 
  array (
  ),
  '航空器试验' => 
  array (
  ),
  '航空器隐身技术' => 
  array (
  ),
  '相关学科的应用' => 
  array (
  ),
  '飞机构造与设计' => 
  array (
  ),
  '热力工程理论' => 
  array (
  ),
  '航空发动机(推进系统)' => 
  array (
  ),
  '燃烧' => 
  array (
  ),
  '航空仪表、设备' => 
  array (
  ),
  '飞行控制系统与导航' => 
  array (
  ),
  '航空(天)用材料' => 
  array (
  ),
  '航空制造工艺' => 
  array (
  ),
  '各类型航空器' => 
  array (
  ),
  '航空用燃料及润滑剂' => 
  array (
  ),
  '航空飞行术' => 
  array (
  ),
  '航空港(站)、机场及技术管理' => 
  array (
  ),
  '航空系统工程' => 
  array (
  ),
  '基础理论及试验' => 
  array (
    0 => '结构力学',
    1 => '流体力学',
    2 => '空气动力学',
    3 => '飞行力学',
    4 => '航空器结构力学',
    5 => '航空器试验',
    6 => '航空器隐身技术',
    7 => '相关学科的应用',
  ),
  '火箭、航天器构造' => 
  array (
  ),
  '航天推进系统' => 
  array (
  ),
  '航天仪表、设备、制导与控制' => 
  array (
  ),
  '航天制造工艺' => 
  array (
  ),
  '航天器及其运载工具' => 
  array (
  ),
  '航天用燃料(推进剂)及润滑剂' => 
  array (
  ),
  '航天术' => 
  array (
  ),
  '地面设备、试验场、发射场、航天基地' => 
  array (
  ),
  '航天系统工程' => 
  array (
  ),
  '航空、航天医学' => 
  array (
  ),
  '基础科学' => 
  array (
    0 => '自然科学理论与方法',
    1 => '非线性科学与系统科学',
    2 => '力学',
    3 => '物理学',
    4 => '天文学',
    5 => '自然地理学和测绘学',
    6 => '气象学',
    7 => '海洋学',
    8 => '地质学',
    9 => '地球物理学',
    10 => '资源科学',
  ),
  '总论武器军用器材' => 
  array (
  ),
  '枪、炮' => 
  array (
  ),
  '弹药、引信、火工品' => 
  array (
  ),
  '爆破器材、烟火器材、火炸药' => 
  array (
  ),
  '水中兵器' => 
  array (
  ),
  '火箭、导弹' => 
  array (
  ),
  '军用飞机与航天器' => 
  array (
  ),
  '军舰' => 
  array (
  ),
  '战车' => 
  array (
  ),
  '特种武器及其他军用器材' => 
  array (
  ),
  '军事通讯' => 
  array (
  ),
  '军事工程' => 
  array (
  ),
  '军事地形学、军事地理学' => 
  array (
  ),
  '铁路运输经济' => 
  array (
  ),
  '铁路线路工程' => 
  array (
  ),
  '电气化铁路' => 
  array (
  ),
  '特种铁路' => 
  array (
  ),
  '机车工程' => 
  array (
  ),
  '车辆工程' => 
  array (
  ),
  '铁路通信、信号' => 
  array (
  ),
  '铁路运输管理工程' => 
  array (
  ),
  '综合运输体制与结构' => 
  array (
  ),
  '城乡交通运输' => 
  array (
  ),
  '工商业运输' => 
  array (
  ),
  '管道运输、索道运输' => 
  array (
  ),
  '公路运输经济' => 
  array (
  ),
  '道路工程' => 
  array (
  ),
  '桥涵工程' => 
  array (
  ),
  '隧道工程' => 
  array (
  ),
  '交通工程与公路运输技术管理' => 
  array (
  ),
  '水路运输经济' => 
  array (
  ),
  '航道工程' => 
  array (
  ),
  '通航建筑物与助航设备' => 
  array (
  ),
  '港口工程' => 
  array (
  ),
  '水路运输技术管理' => 
  array (
  ),
  '汽车工业经济' => 
  array (
  ),
  '汽车理论' => 
  array (
  ),
  '整车设计与计算' => 
  array (
  ),
  '汽车底盘' => 
  array (
  ),
  '传动系统' => 
  array (
  ),
  '行走系统' => 
  array (
  ),
  '转向系统' => 
  array (
  ),
  '制动系统' => 
  array (
  ),
  '电气设备及附件' => 
  array (
  ),
  '仪表' => 
  array (
  ),
  '驾驶室及车身' => 
  array (
  ),
  '汽车附属装置' => 
  array (
  ),
  '汽车发动机' => 
  array (
  ),
  '汽车材料' => 
  array (
  ),
  '汽车制造工艺' => 
  array (
  ),
  '汽车试验' => 
  array (
  ),
  '汽车制造厂' => 
  array (
  ),
  '各种汽车' => 
  array (
  ),
  '汽车驾驶与使用' => 
  array (
  ),
  '汽车保养与修理' => 
  array (
  ),
  '汽车用燃料、润滑料' => 
  array (
  ),
  '其它道路运输工具' => 
  array (
  ),
  '船舶工业经济' => 
  array (
  ),
  '船舶原理' => 
  array (
  ),
  '船舶设计' => 
  array (
  ),
  '船舶结构' => 
  array (
  ),
  '船舶动力装置' => 
  array (
  ),
  '船舶轴系、传动装置、并车装置' => 
  array (
  ),
  '船舶推进装置' => 
  array (
  ),
  '甲板机械' => 
  array (
  ),
  '船舶辅机及设备' => 
  array (
  ),
  '其他特种机械' => 
  array (
  ),
  '船舶防摇装置' => 
  array (
  ),
  '船舶系统' => 
  array (
  ),
  '船舶防污设备' => 
  array (
  ),
  '船舶电气设备、观通设备' => 
  array (
  ),
  '导航设备、水声设备' => 
  array (
  ),
  '船舶舾装设备' => 
  array (
  ),
  '造船材料' => 
  array (
  ),
  '船舶建造工艺' => 
  array (
  ),
  '船舶保养、修理和拆船工艺' => 
  array (
  ),
  '造船厂、修船厂' => 
  array (
  ),
  '各种船舶' => 
  array (
  ),
  '船舶驾驶、航海学' => 
  array (
  ),
  '航海技术管理与救助打捞' => 
  array (
  ),
  '船舶用燃料及润滑剂' => 
  array (
  ),
  '水利经济' => 
  array (
  ),
  '工程水文学' => 
  array (
  ),
  '水力学' => 
  array (
  ),
  '泥沙动力学、河流动力学' => 
  array (
  ),
  '土力学' => 
  array (
  ),
  '水资源调查与水利规划' => 
  array (
  ),
  '水工勘测、水工设计' => 
  array (
  ),
  '结构理论和计算' => 
  array (
  ),
  '水工结构' => 
  array (
    0 => '水工结构',
    1 => '结构理论和计算',
  ),
  '水工材料' => 
  array (
  ),
  '水利工程施工' => 
  array (
  ),
  '水利枢纽工程、水库工程' => 
  array (
  ),
  '挡水坝' => 
  array (
  ),
  '泄水建筑物、水闸' => 
  array (
  ),
  '取水、引水、调水工程' => 
  array (
  ),
  '水能勘测与设计' => 
  array (
  ),
  '水电站建筑与设备' => 
  array (
  ),
  '各种水电站' => 
  array (
  ),
  '世界各国水力发电工程及中小河道水能利用' => 
  array (
  ),
  '治河工程与防洪工程' => 
  array (
  ),
  '运渠(运河、渠道)工程、港湾工程、农田水利工程' => 
  array (
  ),
  '建筑一般理论' => 
  array (
  ),
  '建筑经济学' => 
  array (
  ),
  '建筑艺术学' => 
  array (
  ),
  '建筑物理学' => 
  array (
  ),
  '建筑数学' => 
  array (
  ),
  '其他科学技术在建筑中的应用' => 
  array (
  ),
  '建筑史' => 
  array (
  ),
  '建筑勘测工程' => 
  array (
  ),
  '建筑设计一般性问题' => 
  array (
  ),
  '房屋细部构造设计' => 
  array (
  ),
  '民用建筑' => 
  array (
  ),
  '农业建筑' => 
  array (
  ),
  '工业建筑' => 
  array (
  ),
  '地下建筑' => 
  array (
  ),
  '水下建筑' => 
  array (
  ),
  '高层建筑' => 
  array (
  ),
  '其他建筑' => 
  array (
  ),
  '结构理论、计算' => 
  array (
  ),
  '杆件系统结构' => 
  array (
  ),
  '薄壳结构' => 
  array (
  ),
  '实体结构' => 
  array (
  ),
  '特殊形式结构' => 
  array (
  ),
  '土、砖、石、竹、木结构' => 
  array (
  ),
  '混凝土结构、钢筋混凝土结构' => 
  array (
  ),
  '非金属结构' => 
  array (
  ),
  '金属结构' => 
  array (
  ),
  '建筑材料一般性问题' => 
  array (
  ),
  '有机材料、建筑化工材料' => 
  array (
  ),
  '耐高温材料(耐火材料)、防火材料' => 
  array (
  ),
  '隔热、隔(吸)声材料' => 
  array (
  ),
  '建筑涂料、装饰材料' => 
  array (
  ),
  '防水、防潮材料，嵌缝、密封材料' => 
  array (
  ),
  '粘结料' => 
  array (
  ),
  '其他特种材料' => 
  array (
  ),
  '房屋建筑设备一般性问题' => 
  array (
  ),
  '管道设备' => 
  array (
  ),
  '房屋卫生技术设备' => 
  array (
  ),
  '空气调节、采暖、通风及其设备' => 
  array (
  ),
  '机电设备' => 
  array (
  ),
  '降温与保温(隔热)设备' => 
  array (
  ),
  '消声、隔声设备' => 
  array (
  ),
  '安全设备' => 
  array (
  ),
  '地下建筑设备' => 
  array (
  ),
  '高层建筑设备' => 
  array (
  ),
  '控照器材、人工光源' => 
  array (
  ),
  '建筑施工' => 
  array (
  ),
  '建筑施工机械和设备' => 
  array (
  ),
  '管线工程' => 
  array (
  ),
  '给水工程(上水道工程)' => 
  array (
  ),
  '排水工程(沟渠工程、下水道工程)' => 
  array (
  ),
  '公共卫生工程' => 
  array (
  ),
  '城市供电和通信' => 
  array (
  ),
  '城市集中供热' => 
  array (
  ),
  '城市燃气供应' => 
  array (
  ),
  '其他市政工程及公用设备' => 
  array (
  ),
  '土力学、地基基础工程' => 
  array (
  ),
  '区域规划、城乡规划' => 
  array (
  ),
  '动力工业经济' => 
  array (
  ),
  '能源' => 
  array (
  ),
  '动力工业三废处理与综合利用' => 
  array (
  ),
  '蓄能技术' => 
  array (
  ),
  '动力机械' => 
  array (
  ),
  '动力厂' => 
  array (
  ),
  '热能' => 
  array (
  ),
  '气体透平(涡轮机)' => 
  array (
  ),
  '燃料与燃烧' => 
  array (
  ),
  '工业用热工设备' => 
  array (
  ),
  '蒸汽理论' => 
  array (
  ),
  '理论' => 
  array (
  ),
  '设计、计算' => 
  array (
  ),
  '锅炉构造' => 
  array (
  ),
  '炉内过程与锅内过程' => 
  array (
  ),
  '材料及元件强度' => 
  array (
  ),
  '制造工艺、安装' => 
  array (
  ),
  '运行' => 
  array (
  ),
  '检修、维护' => 
  array (
  ),
  '各种类型锅炉' => 
  array (
  ),
  '蒸汽机' => 
  array (
  ),
  '蒸汽轮机(蒸汽透平、汽轮机)' => 
  array (
  ),
  '蒸汽动力工厂(车间)' => 
  array (
  ),
  '量测技术及仪表' => 
  array (
  ),
  '热工自动控制、检修维护及应用' => 
  array (
  ),
  '汽油机' => 
  array (
  ),
  '柴油机' => 
  array (
  ),
  '其他燃料的内燃机' => 
  array (
  ),
  '复合式发动机' => 
  array (
  ),
  '燃气轮机' => 
  array (
  ),
  '喷气推进器、火箭发动机' => 
  array (
  ),
  '水能、水力机械' => 
  array (
  ),
  '原子能技术经济' => 
  array (
  ),
  '原子能技术及基础理论' => 
  array (
  ),
  '核燃料及其生产' => 
  array (
  ),
  '核反应堆工程、核电厂' => 
  array (
  ),
  '加速器' => 
  array (
  ),
  '核爆炸、放射性物质' => 
  array (
  ),
  '受控热核反应' => 
  array (
  ),
  '辐射防护' => 
  array (
  ),
  '粒子探测技术、辐射探测技术与核仪器仪表' => 
  array (
  ),
  '太阳能' => 
  array (
  ),
  '风能' => 
  array (
  ),
  '生物质能' => 
  array (
  ),
  '地热能' => 
  array (
  ),
  '海洋能' => 
  array (
  ),
  '化学能' => 
  array (
  ),
  '天然气水合物' => 
  array (
  ),
  '原子能' => 
  array (
  ),
  '概况' => 
  array (
  ),
  '电工技术经济' => 
  array (
  ),
  '电工单位、电工计算' => 
  array (
  ),
  '电学、磁学' => 
  array (
  ),
  '电路理论' => 
  array (
  ),
  '磁路' => 
  array (
  ),
  '电磁场理论的应用' => 
  array (
  ),
  '强电介质和压电介质' => 
  array (
  ),
  '导电材料及其制品' => 
  array (
  ),
  '微波吸收材料' => 
  array (
  ),
  '超导体、超导材料' => 
  array (
  ),
  '磁性材料、铁氧体' => 
  array (
  ),
  '电工陶瓷材料' => 
  array (
  ),
  '电动机(总论)' => 
  array (
  ),
  '各种电机' => 
  array (
  ),
  '变压器、变流器及其它电力变换器' => 
  array (
  ),
  '电器' => 
  array (
  ),
  '电能学、发电' => 
  array (
  ),
  '移动式发电站' => 
  array (
  ),
  '火力发电厂、热电站' => 
  array (
  ),
  '发电厂建筑' => 
  array (
  ),
  '水力发电厂、水电站' => 
  array (
  ),
  '核电厂' => 
  array (
  ),
  '动力工业废物处理与综合利用' => 
  array (
  ),
  '变电所' => 
  array (
  ),
  '配电设备和电气接线' => 
  array (
  ),
  '电力系统概况' => 
  array (
  ),
  '理论与分析' => 
  array (
  ),
  '输配电技术' => 
  array (
  ),
  '电力系统的调度、管理、通信' => 
  array (
  ),
  '电力系统的模拟与计算' => 
  array (
  ),
  '线路及杆塔' => 
  array (
  ),
  '电力系统的自动化' => 
  array (
  ),
  '电力系统的继电保护' => 
  array (
  ),
  '高电压技术' => 
  array (
  ),
  '独立电源技术(直接发电)' => 
  array (
  ),
  '非独立电源技术' => 
  array (
  ),
  '电数量的测量及仪表' => 
  array (
  ),
  '集中参数、分布参数的测量及仪表' => 
  array (
  ),
  '频率、波形参数的测量及仪表' => 
  array (
  ),
  '磁数量测量及仪器' => 
  array (
  ),
  '电磁场强度(信号强度)测量及仪表' => 
  array (
  ),
  '复用、较量、记录和模拟测试装置' => 
  array (
  ),
  '微波测量及仪表' => 
  array (
  ),
  '农业基本问题' => 
  array (
  ),
  '农业发展与建设方针' => 
  array (
  ),
  '农业现代化道路、模式' => 
  array (
  ),
  '农业可持续发展' => 
  array (
  ),
  '农村经济改革' => 
  array (
  ),
  '农业数学' => 
  array (
  ),
  '农业物理学' => 
  array (
  ),
  '肥料基础科学' => 
  array (
  ),
  '化学肥料' => 
  array (
  ),
  '农家肥、绿肥、细菌肥料及其他' => 
  array (
  ),
  '化学肥料制造' => 
  array (
  ),
  '施肥' => 
  array (
  ),
  '施肥机械与设备' => 
  array (
  ),
  '土壤形成及演化' => 
  array (
  ),
  '土壤物理学、土壤化学' => 
  array (
  ),
  '土壤生物学' => 
  array (
  ),
  '土壤类型、土壤分类学' => 
  array (
  ),
  '土壤改良' => 
  array (
  ),
  '水土保持' => 
  array (
  ),
  '土壤肥力' => 
  array (
  ),
  '土壤地理、土壤调查' => 
  array (
  ),
  '森林土壤学' => 
  array (
  ),
  '农业气象学' => 
  array (
  ),
  '农业生态学' => 
  array (
  ),
  '农业微生物学、农业植物学' => 
  array (
  ),
  '农业动物学' => 
  array (
  ),
  '农业昆虫学、蜱螨学' => 
  array (
  ),
  '农业生物工程' => 
  array (
  ),
  '农业资源及环境保护' => 
  array (
  ),
  '农业工程总论' => 
  array (
  ),
  '农业能源及其利用' => 
  array (
  ),
  '拖拉机' => 
  array (
  ),
  '手工农具、改良农具' => 
  array (
  ),
  '耕耘机具' => 
  array (
  ),
  '种植机械' => 
  array (
  ),
  '田间管理机械' => 
  array (
  ),
  '收获机具' => 
  array (
  ),
  '农产品初步加工机具' => 
  array (
  ),
  '农业运输、装卸机具、贮藏设备' => 
  array (
  ),
  '农业机械化区划与系统' => 
  array (
  ),
  '农业机械与拖拉机运用学' => 
  array (
  ),
  '农业生产作业机械化工艺组织' => 
  array (
  ),
  '农用仪器、仪表及设备' => 
  array (
  ),
  '林业机械化' => 
  array (
  ),
  '农业电气化与自动化、农业航空' => 
  array (
  ),
  '农田水文学' => 
  array (
  ),
  '水源' => 
  array (
  ),
  '灌溉制度与管理' => 
  array (
  ),
  '灌溉技术' => 
  array (
  ),
  '排水' => 
  array (
  ),
  '排灌工程' => 
  array (
  ),
  '水利改良土壤措施' => 
  array (
  ),
  '各国农田水利' => 
  array (
  ),
  '农田基本建设、农垦' => 
  array (
  ),
  '农业工程勘测、土地测量、土地管理、规划及利用' => 
  array (
  ),
  '作物生物学原理和栽培技术与方法' => 
  array (
  ),
  '作物品种与种质资源' => 
  array (
  ),
  '作物遗传育种与良种繁育' => 
  array (
  ),
  '耕作学与有机农业' => 
  array (
    0 => '耕作学',
    1 => '有机农业',
  ),
  '播种、栽植与田间管理' => 
  array (
  ),
  '农业化学' => 
  array (
  ),
  '农家肥料' => 
  array (
  ),
  '绿肥' => 
  array (
  ),
  '细菌肥料' => 
  array (
  ),
  '肥料剂型' => 
  array (
  ),
  '肥料的选择与管理' => 
  array (
  ),
  '积肥、调制与施肥' => 
  array (
  ),
  '土壤物理学' => 
  array (
  ),
  '土壤化学、土壤物理化学' => 
  array (
  ),
  '农产品收获、加工、贮藏及综合利用' => 
  array (
  ),
  '植物保护总论' => 
  array (
  ),
  '动植物检疫' => 
  array (
  ),
  '植物检疫' => 
  array (
  ),
  '气象灾害及其预防' => 
  array (
  ),
  '森林火灾及其预防' => 
  array (
  ),
  '植物病虫害及其预测、预报' => 
  array (
  ),
  '禾谷类作物病虫害及其防治' => 
  array (
  ),
  '豆类、薯类作物病虫害及其防治' => 
  array (
  ),
  '饲料作物、牧草及绿肥作物病虫害及其防治' => 
  array (
  ),
  '经济作物病虫害及其防治' => 
  array (
  ),
  '蔬菜、瓜果病虫害及其防治' => 
  array (
  ),
  '果树病虫害及其防治' => 
  array (
  ),
  '观赏园艺病虫害及其防治' => 
  array (
  ),
  '森林病虫害及其防治' => 
  array (
  ),
  '鸟兽害及其它灾害防治' => 
  array (
  ),
  '有害植物及其清除' => 
  array (
  ),
  '各种防治方法' => 
  array (
  ),
  '植物化学保护理论' => 
  array (
  ),
  '杀菌剂' => 
  array (
  ),
  '杀虫剂' => 
  array (
  ),
  '除草剂' => 
  array (
  ),
  '其他化学农药' => 
  array (
  ),
  '植物保护机械' => 
  array (
  ),
  '作物生物学原理、栽培技术与方法' => 
  array (
  ),
  '耕作学' => 
  array (
  ),
  '有机农业' => 
  array (
  ),
  '播种、栽植及田间管理' => 
  array (
  ),
  '水稻' => 
  array (
  ),
  '籼稻、粳稻、糯稻' => 
  array (
  ),
  '早稻、中稻、晚稻' => 
  array (
  ),
  '单季稻、双季稻、三季稻' => 
  array (
  ),
  '深水稻' => 
  array (
  ),
  '陆稻' => 
  array (
  ),
  '野生稻' => 
  array (
  ),
  '小麦' => 
  array (
  ),
  '大麦及其它' => 
  array (
  ),
  '玉米' => 
  array (
  ),
  '高梁' => 
  array (
  ),
  '其它禾谷类' => 
  array (
  ),
  '豆类作物' => 
  array (
  ),
  '甘薯' => 
  array (
  ),
  '马铃薯' => 
  array (
  ),
  '木薯及其它' => 
  array (
  ),
  '饲料作物、牧草' => 
  array (
  ),
  '绿肥作物' => 
  array (
  ),
  '棉' => 
  array (
  ),
  '麻类作物' => 
  array (
  ),
  '编织用纤维作物' => 
  array (
  ),
  '大豆' => 
  array (
  ),
  '花生' => 
  array (
  ),
  '油菜子' => 
  array (
  ),
  '其他油料作物' => 
  array (
  ),
  '甘蔗' => 
  array (
  ),
  '甜菜' => 
  array (
  ),
  '其他糖料作物' => 
  array (
  ),
  '木本' => 
  array (
  ),
  '草本' => 
  array (
  ),
  '菌类' => 
  array (
  ),
  '其它药用作物' => 
  array (
  ),
  '茶' => 
  array (
  ),
  '咖啡及其它饮料作物' => 
  array (
  ),
  '烟草' => 
  array (
  ),
  '香料作物' => 
  array (
  ),
  '野生植物、热带、亚热带作物及其它' => 
  array (
  ),
  '温室构造及其管理、作业、栽培' => 
  array (
  ),
  '无土栽培' => 
  array (
  ),
  '蔬菜设施园艺' => 
  array (
  ),
  '瓜果设施园艺' => 
  array (
  ),
  '果树设施园艺' => 
  array (
  ),
  '花卉设施园艺' => 
  array (
  ),
  '直根类' => 
  array (
  ),
  '块茎类' => 
  array (
  ),
  '葱蒜类' => 
  array (
  ),
  '白菜类、芥菜类' => 
  array (
  ),
  '甘蓝类' => 
  array (
  ),
  '绿叶菜类' => 
  array (
  ),
  '茄果类' => 
  array (
  ),
  '瓜类' => 
  array (
  ),
  '豆荚类' => 
  array (
  ),
  '多年生菜类' => 
  array (
  ),
  '水生菜类' => 
  array (
  ),
  '菌类(食用菌)' => 
  array (
  ),
  '野生菜及其它' => 
  array (
  ),
  '西瓜' => 
  array (
  ),
  '甜瓜' => 
  array (
  ),
  '仁果类' => 
  array (
  ),
  '核果类' => 
  array (
  ),
  '浆果类' => 
  array (
  ),
  '坚果类' => 
  array (
  ),
  '杂果类' => 
  array (
  ),
  '柑桔类' => 
  array (
  ),
  '热带及亚热带果类' => 
  array (
  ),
  '多年生草本果类' => 
  array (
  ),
  '一、二年生花卉类' => 
  array (
  ),
  '多年生花卉类' => 
  array (
  ),
  '观花树木类' => 
  array (
  ),
  '观叶、观果树木类' => 
  array (
  ),
  '园林植物栽培及应用技术' => 
  array (
  ),
  '蔬菜病虫害及其防治' => 
  array (
  ),
  '瓜果病虫害及其防治' => 
  array (
  ),
  '观赏园艺类病虫害及其防治' => 
  array (
  ),
  '林业经济及概述' => 
  array (
  ),
  '森林数学' => 
  array (
  ),
  '森林物理学' => 
  array (
  ),
  '森林化学' => 
  array (
  ),
  '森林水文学' => 
  array (
  ),
  '森林气象学' => 
  array (
  ),
  '森林地理学、森林分布' => 
  array (
  ),
  '森林生物学' => 
  array (
  ),
  '森林与环境保护' => 
  array (
  ),
  '造林计划与实施' => 
  array (
  ),
  '树木育种及良种繁育' => 
  array (
  ),
  '苗圃学' => 
  array (
  ),
  '宜林地' => 
  array (
  ),
  '造林技术' => 
  array (
  ),
  '各林种造林' => 
  array (
  ),
  '特殊地区造林' => 
  array (
  ),
  '大地园林' => 
  array (
  ),
  '中国绿化建设' => 
  array (
  ),
  '各国绿化建设' => 
  array (
  ),
  '绿化建设规划' => 
  array (
  ),
  '森林作业法' => 
  array (
  ),
  '森林主伐' => 
  array (
  ),
  '森林间伐及抚育' => 
  array (
  ),
  '森林更新' => 
  array (
  ),
  '封山育林' => 
  array (
  ),
  '林分改造' => 
  array (
  ),
  '森林经理学' => 
  array (
  ),
  '森林计测学' => 
  array (
  ),
  '各林种及林副产品经营' => 
  array (
  ),
  '气象灾害及其防治' => 
  array (
  ),
  '林火' => 
  array (
  ),
  '动物为害及其防治' => 
  array (
  ),
  '有害草木及其清除' => 
  array (
  ),
  '人为损害及其防治' => 
  array (
  ),
  '防治药品及其使用' => 
  array (
  ),
  '其他防治方法' => 
  array (
  ),
  '森林测量、林业测绘' => 
  array (
  ),
  '森林建筑工程' => 
  array (
  ),
  '森林运输工程' => 
  array (
  ),
  '森林水土保持工程' => 
  array (
  ),
  '防沙工程' => 
  array (
  ),
  '林业机械' => 
  array (
  ),
  '林业航空、林业电器通讯设备' => 
  array (
  ),
  '木材学' => 
  array (
  ),
  '木材采运学' => 
  array (
  ),
  '森林副产品采集' => 
  array (
  ),
  '森林环境资源的利用' => 
  array (
  ),
  '森林副产品的综合利用' => 
  array (
  ),
  '针叶树类' => 
  array (
  ),
  '阔叶乔木' => 
  array (
  ),
  '阔叶灌木' => 
  array (
  ),
  '特用阔叶树类' => 
  array (
  ),
  '竹' => 
  array (
  ),
  '热带树种' => 
  array (
  ),
  '畜牧经济学' => 
  array (
  ),
  '畜牧基础科学' => 
  array (
  ),
  '草原学' => 
  array (
  ),
  '遗传、选种、育种' => 
  array (
  ),
  '繁殖' => 
  array (
  ),
  '饲养管理' => 
  array (
  ),
  '饲料' => 
  array (
  ),
  '畜牧机械' => 
  array (
  ),
  '畜牧电气化和自动化' => 
  array (
  ),
  '马' => 
  array (
  ),
  '驴、骡' => 
  array (
  ),
  '牛' => 
  array (
  ),
  '骆驼' => 
  array (
  ),
  '鹿' => 
  array (
  ),
  '羊' => 
  array (
  ),
  '山羊' => 
  array (
  ),
  '猪' => 
  array (
  ),
  '兔' => 
  array (
  ),
  '其它家畜' => 
  array (
  ),
  '鸡' => 
  array (
  ),
  '鸭' => 
  array (
  ),
  '鹅' => 
  array (
  ),
  '鸽' => 
  array (
  ),
  '其它' => 
  array (
  ),
  '兽医预防科学' => 
  array (
  ),
  '兽医基础科学' => 
  array (
  ),
  '兽医临床医学' => 
  array (
  ),
  '兽医传染病学' => 
  array (
  ),
  '兽医各科' => 
  array (
  ),
  '中国兽医学' => 
  array (
  ),
  '兽医药物学' => 
  array (
  ),
  '猪病' => 
  array (
  ),
  '鸡病' => 
  array (
  ),
  '马病' => 
  array (
  ),
  '驴、骡病' => 
  array (
  ),
  '牛病' => 
  array (
  ),
  '骆驼病' => 
  array (
  ),
  '鹿病' => 
  array (
  ),
  '羊病' => 
  array (
  ),
  '其它家畜病' => 
  array (
  ),
  '鸭病' => 
  array (
  ),
  '其它家禽病及野生动物疾病' => 
  array (
  ),
  '狩猎、野生动物驯养' => 
  array (
  ),
  '畜禽产品的综合利用' => 
  array (
  ),
  '蚕基础科学' => 
  array (
  ),
  '蚕的育种与良种繁育' => 
  array (
  ),
  '蚕的饲育法' => 
  array (
  ),
  '蚕的病虫害及其防治' => 
  array (
  ),
  '其他蚕类' => 
  array (
  ),
  '蚕茧' => 
  array (
  ),
  '养蚕建筑、养蚕机具' => 
  array (
  ),
  '桑' => 
  array (
  ),
  '蚕的其他饲料' => 
  array (
  ),
  '蜂群生物学' => 
  array (
  ),
  '繁育' => 
  array (
  ),
  '品种' => 
  array (
  ),
  '病虫害防治' => 
  array (
  ),
  '蜂产品加工及利用' => 
  array (
  ),
  '蜜源植物' => 
  array (
  ),
  '蜂场的经营及管理' => 
  array (
  ),
  '益虫饲养' => 
  array (
  ),
  '水产经济' => 
  array (
  ),
  '水产基础科学' => 
  array (
  ),
  '水产资源学、地区分布' => 
  array (
  ),
  '水产资源调查' => 
  array (
  ),
  '鱼病学' => 
  array (
  ),
  '鱼病防治方法' => 
  array (
  ),
  '各种鱼病防治' => 
  array (
  ),
  '贝类病害、敌害及其防治' => 
  array (
  ),
  '甲壳类病虫害及其防治' => 
  array (
  ),
  '其它水产病虫害及其防治' => 
  array (
  ),
  '水产药物学、药理学' => 
  array (
  ),
  '水产的水质污染及其防治' => 
  array (
  ),
  '水产工程' => 
  array (
  ),
  '鱼类繁殖和越冬技术' => 
  array (
  ),
  '鱼苗、鱼种' => 
  array (
  ),
  '水产动物饵料及其营养' => 
  array (
  ),
  '淡水、海水养殖方式' => 
  array (
  ),
  '各种鱼类养殖' => 
  array (
  ),
  '其他淡水养殖' => 
  array (
  ),
  '各种海产动植物养殖' => 
  array (
  ),
  '水产养殖设备' => 
  array (
  ),
  '渔捞' => 
  array (
  ),
  '水产物运输、保鲜贮藏、加工、包装' => 
  array (
  ),
  '卫生事业总论' => 
  array (
  ),
  '医药、卫生政策法规' => 
  array (
  ),
  '医疗保险' => 
  array (
  ),
  '医务人员及卫生宣传教育' => 
  array (
  ),
  '卫生标准与检查、医药管理' => 
  array (
  ),
  '卫生调查统计' => 
  array (
  ),
  '医疗服务、制度及改革' => 
  array (
  ),
  '医疗与法' => 
  array (
  ),
  '医疗卫生机构及管理' => 
  array (
  ),
  '医疗器械' => 
  array (
  ),
  '一般理论、现状与发展' => 
  array (
  ),
  '循证医学' => 
  array (
  ),
  '医学教育' => 
  array (
  ),
  '医学与其他学科的关系' => 
  array (
  ),
  '医学史' => 
  array (
  ),
  '医学图书情报及相关机构、团体、会议' => 
  array (
  ),
  '卫生基础科学' => 
  array (
  ),
  '环境卫生' => 
  array (
  ),
  '劳动生理卫生及生产环境卫生' => 
  array (
  ),
  '职业性疾病预防' => 
  array (
  ),
  '劳动保护措施' => 
  array (
  ),
  '农业劳动卫生' => 
  array (
  ),
  '放射卫生' => 
  array (
  ),
  '营养学' => 
  array (
  ),
  '饮食卫生与食品检验' => 
  array (
  ),
  '一般保健知识、身体清洁卫生、性卫生' => 
  array (
  ),
  '生活制度与卫生' => 
  array (
  ),
  '个人卫生防护用品使用' => 
  array (
  ),
  '计划生育与卫生' => 
  array (
  ),
  '妇幼卫生与保健' => 
  array (
  ),
  '总论及疫情调查、分析与报告' => 
  array (
  ),
  '流行病学理论及应用' => 
  array (
  ),
  '传染病预防和管理' => 
  array (
  ),
  '防疫接种、注射与服药' => 
  array (
  ),
  '消毒' => 
  array (
  ),
  '医学地理学' => 
  array (
  ),
  '中医现代化研究' => 
  array (
  ),
  '中医学史' => 
  array (
  ),
  '中医全书和论文集' => 
  array (
  ),
  '中医预防与卫生、气功' => 
  array (
  ),
  '养生' => 
  array (
  ),
  '中医基础理论总论' => 
  array (
  ),
  '内经' => 
  array (
  ),
  '伤寒金匮（伤寒杂病论）' => 
  array (
  ),
  '中医生理' => 
  array (
  ),
  '经络、孔穴' => 
  array (
  ),
  '中医阴阳五行运气学说' => 
  array (
  ),
  '中医病理' => 
  array (
  ),
  '其他' => 
  array (
  ),
  '中医临床学总论' => 
  array (
  ),
  '中医诊断学' => 
  array (
  ),
  '中医治疗学总论' => 
  array (
  ),
  '八法论治' => 
  array (
  ),
  '外治法' => 
  array (
  ),
  '食养食疗' => 
  array (
  ),
  '气功' => 
  array (
  ),
  '其他文献' => 
  array (
  ),
  '针灸疗法的临床应用' => 
  array (
  ),
  '中医护理学' => 
  array (
  ),
  '医案、医话（临床经验）' => 
  array (
  ),
  '中医内科总论' => 
  array (
  ),
  '外感病证' => 
  array (
  ),
  '一般病证' => 
  array (
  ),
  '脏腑病证' => 
  array (
  ),
  '现代医学内科疾病' => 
  array (
  ),
  '中医外科' => 
  array (
  ),
  '中医骨伤科' => 
  array (
  ),
  '中医妇产科' => 
  array (
  ),
  '中医儿科' => 
  array (
  ),
  '中医肿瘤科' => 
  array (
  ),
  '中医皮科' => 
  array (
  ),
  '中医五官科' => 
  array (
  ),
  '中医泌尿学' => 
  array (
  ),
  '中医神经病学与精神病学' => 
  array (
  ),
  '中医急症学' => 
  array (
  ),
  '中国少数民族医学' => 
  array (
  ),
  '外国民族医学' => 
  array (
  ),
  '本草' => 
  array (
  ),
  '中药材' => 
  array (
  ),
  '中药炮制、制剂' => 
  array (
  ),
  '中药化学' => 
  array (
  ),
  '中药药理学' => 
  array (
  ),
  '中药品' => 
  array (
  ),
  '各科用药' => 
  array (
  ),
  '中药药事组织' => 
  array (
  ),
  '方剂学' => 
  array (
  ),
  '其他各国生药学' => 
  array (
  ),
  '证候与诊法' => 
  array (
  ),
  '治则与方药' => 
  array (
  ),
  '针灸与针麻' => 
  array (
  ),
  '内科' => 
  array (
  ),
  '外科' => 
  array (
  ),
  '骨伤科' => 
  array (
  ),
  '妇产科' => 
  array (
  ),
  '儿科' => 
  array (
  ),
  '泌尿学' => 
  array (
  ),
  '神经病学与精神病学' => 
  array (
  ),
  '眼科' => 
  array (
  ),
  '耳鼻喉科' => 
  array (
  ),
  '口腔科' => 
  array (
  ),
  '皮肤性病科' => 
  array (
  ),
  '老年病' => 
  array (
  ),
  '肿瘤科' => 
  array (
  ),
  '实验方法与设备' => 
  array (
  ),
  '医用实验动物学' => 
  array (
  ),
  '医用一般科学（医用数学、物理学、化学等）' => 
  array (
  ),
  '人体胚胎学' => 
  array (
  ),
  '人体解剖学、局部解剖学、解剖生理学' => 
  array (
  ),
  '人体组织学与细胞学' => 
  array (
  ),
  '医学生物化学与分子生物学' => 
  array (
  ),
  '医学生物物理学' => 
  array (
  ),
  '病理学总论' => 
  array (
  ),
  '病理解剖学与组织学' => 
  array (
  ),
  '病理生理学、病理过程' => 
  array (
  ),
  '医学微生物学总论' => 
  array (
  ),
  '病原微生物分类与鉴定' => 
  array (
  ),
  '人体病毒学' => 
  array (
  ),
  '衣原体属' => 
  array (
  ),
  '支原体属' => 
  array (
  ),
  '立克次体属' => 
  array (
  ),
  '螺旋体属' => 
  array (
  ),
  '病原菌' => 
  array (
  ),
  '病原真菌与放线菌' => 
  array (
  ),
  '其他微生物' => 
  array (
  ),
  '医学寄生虫学' => 
  array (
  ),
  '医学遗传学' => 
  array (
  ),
  '医学、病理心理学' => 
  array (
  ),
  '变态心理学' => 
  array (
  ),
  '心理治疗学' => 
  array (
  ),
  '临床医学总论' => 
  array (
  ),
  '诊断学总论' => 
  array (
  ),
  '症状诊断学' => 
  array (
  ),
  '物理诊断学(体检诊断)' => 
  array (
  ),
  '电诊断' => 
  array (
  ),
  '影像医学总论' => 
  array (
  ),
  '超声波' => 
  array (
  ),
  '核磁共振成像' => 
  array (
  ),
  'X线诊断学' => 
  array (
  ),
  '各种及各科疾病的X线诊断与治疗' => 
  array (
    0 => '口腔科',
    1 => '头颅及神经系',
    2 => '心脏血管系',
    3 => '胸部及呼吸系',
    4 => '腹部及胃肠',
    5 => '外科、骨科',
    6 => '妇产、儿科',
    7 => '耳鼻咽喉、眼科',
    8 => '泌尿及男性生殖系',
    9 => '肿瘤X线诊疗',
  ),
  '放射性同位素检查与治疗' => 
  array (
  ),
  '热成像' => 
  array (
  ),
  '实验室诊断总论' => 
  array (
  ),
  '生物化学检验、临床检验' => 
  array (
  ),
  '微生物学检验' => 
  array (
  ),
  '免疫学检验' => 
  array (
  ),
  '组织学检验' => 
  array (
  ),
  '鉴别诊断学' => 
  array (
  ),
  '机能诊断学' => 
  array (
  ),
  '预后及劳动鉴定' => 
  array (
  ),
  '治疗学总论' => 
  array (
  ),
  '药物疗法、化学疗法' => 
  array (
  ),
  '物理疗法、自然疗法' => 
  array (
  ),
  '体育疗法' => 
  array (
  ),
  '生物疗法' => 
  array (
  ),
  '血液疗法' => 
  array (
  ),
  '氧疗、透析及其它疗法等' => 
  array (
  ),
  '基因诊断与治疗' => 
  array (
  ),
  '介入诊疗' => 
  array (
  ),
  '护理总论' => 
  array (
  ),
  '护理一般技术' => 
  array (
  ),
  '内科护理学' => 
  array (
  ),
  '外科护理学' => 
  array (
  ),
  '妇产、儿科护理学' => 
  array (
  ),
  '神经病、精神病护理学' => 
  array (
  ),
  '皮肤病、性病护理学' => 
  array (
  ),
  '耳鼻咽喉、眼、口腔科护理学' => 
  array (
  ),
  '肿瘤科护理学' => 
  array (
  ),
  '吸毒与戒毒' => 
  array (
  ),
  '疼痛医学' => 
  array (
  ),
  '睡眠医学' => 
  array (
  ),
  '康复医学' => 
  array (
  ),
  '临终关怀学' => 
  array (
  ),
  '其他诊疗技术' => 
  array (
  ),
  '感染性疾病的预防' => 
  array (
  ),
  '感染性疾病总论' => 
  array (
  ),
  '脑炎、脑脊髓膜炎及脊髓灰质炎' => 
  array (
  ),
  '肝炎' => 
  array (
  ),
  '病毒性出血热' => 
  array (
  ),
  '获得性免疫缺陷综合征' => 
  array (
  ),
  '其他病毒病' => 
  array (
  ),
  '严重呼吸综合症' => 
  array (
  ),
  '立克次体传染病' => 
  array (
  ),
  '螺旋体传染病' => 
  array (
  ),
  '细菌感染性疾病' => 
  array (
  ),
  '衣原体、支原体属疾病' => 
  array (
  ),
  '真菌、放线菌传染病' => 
  array (
  ),
  '肺结核' => 
  array (
  ),
  '淋巴系结核' => 
  array (
  ),
  '气管及食管结核' => 
  array (
  ),
  '胃肠结核' => 
  array (
  ),
  '肝、脾、胰结核' => 
  array (
  ),
  '腹膜结核' => 
  array (
  ),
  '泌尿生殖系结核' => 
  array (
  ),
  '运动系结核' => 
  array (
  ),
  '神经系统结核' => 
  array (
  ),
  '耳鼻咽喉、眼、口腔结核' => 
  array (
  ),
  '原虫病' => 
  array (
  ),
  '蠕虫病' => 
  array (
  ),
  '皮肤寄生虫病' => 
  array (
  ),
  '其他寄生虫病' => 
  array (
  ),
  '其他感染性疾病' => 
  array (
  ),
  '诊断学' => 
  array (
  ),
  '基础与临床' => 
  array (
  ),
  '先天性心脏病' => 
  array (
  ),
  '风湿性心脏病' => 
  array (
  ),
  '高血压性心脏病' => 
  array (
  ),
  '冠心病、心绞痛' => 
  array (
  ),
  '肺源性心脏病' => 
  array (
  ),
  '血循环衰竭' => 
  array (
  ),
  '心律失常' => 
  array (
  ),
  '其他病因性心脏病' => 
  array (
  ),
  '心包疾病' => 
  array (
  ),
  '心肌疾病' => 
  array (
  ),
  '克山病' => 
  array (
  ),
  '心内膜疾病' => 
  array (
  ),
  '心瓣膜疾病' => 
  array (
  ),
  '血管疾病' => 
  array (
  ),
  '血压异常' => 
  array (
  ),
  '血液及淋巴系疾病' => 
  array (
  ),
  '胸膜及胸腔疾病' => 
  array (
  ),
  '气管与支气管疾病' => 
  array (
  ),
  '肺炎' => 
  array (
  ),
  '肺脓肿' => 
  array (
  ),
  '肺气肿' => 
  array (
  ),
  '肺不张' => 
  array (
  ),
  '肺栓塞' => 
  array (
  ),
  '肺出血' => 
  array (
  ),
  '肺含铁血黄素沉着病' => 
  array (
  ),
  '呼吸衰竭' => 
  array (
  ),
  '纵隔疾病' => 
  array (
  ),
  '膈疾病' => 
  array (
  ),
  '食管疾病' => 
  array (
  ),
  '腹部疾病' => 
  array (
  ),
  '溃疡病' => 
  array (
  ),
  '上消化道出血' => 
  array (
  ),
  '胃炎' => 
  array (
  ),
  '肠疾病' => 
  array (
  ),
  '肝硬变' => 
  array (
  ),
  '肝功能衰竭' => 
  array (
  ),
  '肝脓肿' => 
  array (
  ),
  '肝代谢障碍' => 
  array (
  ),
  '肝囊肿' => 
  array (
  ),
  '胆囊及胆管疾病' => 
  array (
  ),
  '肝胆结核' => 
  array (
  ),
  '胰腺疾病' => 
  array (
  ),
  '甲状腺疾病' => 
  array (
  ),
  '甲状旁腺疾病' => 
  array (
  ),
  '胸腺疾病' => 
  array (
  ),
  '垂体及间脑－垂体系统疾病' => 
  array (
  ),
  '松果体疾病及性早熟' => 
  array (
  ),
  '肾上腺疾病' => 
  array (
  ),
  '胰岛疾病' => 
  array (
  ),
  '性腺疾病' => 
  array (
  ),
  '骨质疏松' => 
  array (
  ),
  '代谢病' => 
  array (
  ),
  '营养缺乏症' => 
  array (
  ),
  '老年病学总论' => 
  array (
  ),
  '免疫性疾病' => 
  array (
  ),
  '物理性损害' => 
  array (
  ),
  '中毒及化学性损害' => 
  array (
  ),
  '遗传性疾病' => 
  array (
  ),
  '原因未明的疾病' => 
  array (
  ),
  '职业性疾病' => 
  array (
  ),
  '地方病学' => 
  array (
  ),
  '外科学总论' => 
  array (
  ),
  '外科病理学、解剖学' => 
  array (
  ),
  '外科诊断学' => 
  array (
  ),
  '外科治疗学' => 
  array (
  ),
  '手术室及其设备' => 
  array (
  ),
  '抗菌术、无菌技术(消毒法)' => 
  array (
  ),
  '麻醉学' => 
  array (
  ),
  '手术基本操作技术' => 
  array (
  ),
  '特种外科手术学' => 
  array (
  ),
  '器官移植术' => 
  array (
  ),
  '手术前后的处理及外科并发症' => 
  array (
  ),
  '全身性化脓性感染' => 
  array (
  ),
  '皮及皮下感染' => 
  array (
  ),
  '特异性感染' => 
  array (
  ),
  '创伤外科学' => 
  array (
  ),
  '头部及神经外科学' => 
  array (
  ),
  '颈部外科学' => 
  array (
  ),
  '心脏血管及淋巴系外科学' => 
  array (
  ),
  '胸部外科学' => 
  array (
  ),
  '乳腺外科学' => 
  array (
  ),
  '胃肠' => 
  array (
  ),
  '直肠和肛门' => 
  array (
  ),
  '肝及肝管' => 
  array (
  ),
  '胆囊胆管' => 
  array (
  ),
  '胰腺' => 
  array (
  ),
  '脾脏' => 
  array (
  ),
  '急腹症' => 
  array (
  ),
  '腹部疝' => 
  array (
  ),
  '四肢外科学' => 
  array (
  ),
  '小儿外科学' => 
  array (
    0 => '小儿外科手术学',
    1 => '小儿整形外科学',
    2 => '小儿各生理系统外科学',
    3 => '小儿骨科学',
  ),
  '骨及骨膜的感染' => 
  array (
  ),
  '脊柱疾病' => 
  array (
  ),
  '四肢骨疾病' => 
  array (
  ),
  '其他骨骼疾病' => 
  array (
  ),
  '骨畸形' => 
  array (
  ),
  '骨折、骨的损伤' => 
  array (
  ),
  '关节疾病及损伤' => 
  array (
  ),
  '肌肉疾病及损伤' => 
  array (
  ),
  '筋腱、韧带、滑囊疾病及损伤' => 
  array (
  ),
  '周围神经损伤及功能障碍' => 
  array (
  ),
  '骨科手术及矫形' => 
  array (
  ),
  '儿童骨科学' => 
  array (
  ),
  '运动系统结核' => 
  array (
  ),
  '运动系统肿瘤' => 
  array (
  ),
  '整形外科学' => 
  array (
  ),
  '一般疾病' => 
  array (
  ),
  '肾畸形' => 
  array (
  ),
  '肾炎与肾病综合征' => 
  array (
  ),
  '肾结石' => 
  array (
  ),
  '肾功能不全' => 
  array (
  ),
  '肾小管、肾小球疾病' => 
  array (
  ),
  '肾、肾盂肿瘤' => 
  array (
  ),
  '输尿管疾病' => 
  array (
  ),
  '膀胱疾病' => 
  array (
  ),
  '尿的成分异常' => 
  array (
  ),
  '尿道疾病' => 
  array (
  ),
  '男性生殖器疾病' => 
  array (
  ),
  '男子性功能障碍' => 
  array (
  ),
  '泌尿及男性生殖系外科学' => 
  array (
  ),
  '女性生殖器官发育异常' => 
  array (
  ),
  '女性生殖器官位置异常' => 
  array (
  ),
  '女性生殖系统炎症' => 
  array (
  ),
  '女性生殖系统损伤' => 
  array (
  ),
  '女性生殖器功能性疾病' => 
  array (
  ),
  '不孕症' => 
  array (
  ),
  '女性生殖器肿瘤' => 
  array (
  ),
  '女性生殖器其他疾病' => 
  array (
  ),
  '妇科手术' => 
  array (
  ),
  '生理妊娠' => 
  array (
  ),
  '病理妊娠' => 
  array (
  ),
  '生理分娩' => 
  array (
  ),
  '病理分娩' => 
  array (
  ),
  '胎儿' => 
  array (
  ),
  '助产学' => 
  array (
  ),
  '分娩监护' => 
  array (
  ),
  '产褥期' => 
  array (
  ),
  '围产医学' => 
  array (
  ),
  '产科手术' => 
  array (
  ),
  '计划生育' => 
  array (
  ),
  '临床优生学' => 
  array (
  ),
  '辅助生殖技术' => 
  array (
  ),
  '新生儿疾病' => 
  array (
  ),
  '早产儿疾病' => 
  array (
  ),
  '儿童的营养障碍及保健与卫生' => 
  array (
  ),
  '小儿内科学总论' => 
  array (
  ),
  '儿科急症及处理' => 
  array (
  ),
  '小儿传染病和寄生虫病' => 
  array (
  ),
  '小儿心脏、血管疾病' => 
  array (
  ),
  '小儿血液及淋巴系疾病' => 
  array (
  ),
  '小儿呼吸系疾病' => 
  array (
  ),
  '小儿消化系疾病' => 
  array (
  ),
  '小儿内分泌腺疾病及代谢病' => 
  array (
  ),
  '小儿全身性疾病' => 
  array (
  ),
  '小儿外科手术学' => 
  array (
  ),
  '小儿整形外科学' => 
  array (
  ),
  '小儿各生理系统外科学' => 
  array (
  ),
  '小儿骨科学' => 
  array (
  ),
  '小儿泌尿科学' => 
  array (
  ),
  '儿童神经、精神病' => 
  array (
  ),
  '小儿其他疾病' => 
  array (
  ),
  '癫痫' => 
  array (
  ),
  '大脑性瘫痪' => 
  array (
  ),
  '肝豆状核变性' => 
  array (
  ),
  '震颤麻痹综合征' => 
  array (
  ),
  '脑积水、脑脓肿' => 
  array (
  ),
  '脑部感染性疾病' => 
  array (
  ),
  '脑血管疾病' => 
  array (
  ),
  '脊髓疾病' => 
  array (
  ),
  '周围神经及神经节疾病' => 
  array (
  ),
  '神经肌肉疾病' => 
  array (
  ),
  '植物性神经系疾病、血管舒缩及营养神经系疾病' => 
  array (
  ),
  '并发神经病' => 
  array (
  ),
  '神经系肿瘤' => 
  array (
  ),
  '儿童神经病' => 
  array (
  ),
  '器质性疾病伴发的精神障碍' => 
  array (
  ),
  '精神分裂症' => 
  array (
  ),
  '情感性精神障碍' => 
  array (
  ),
  '反应性及中毒所致精神障碍' => 
  array (
  ),
  '神经官能症' => 
  array (
  ),
  '肿瘤学实验研究' => 
  array (
  ),
  '肿瘤学调查与统计' => 
  array (
  ),
  '肿瘤的预防与控制' => 
  array (
  ),
  '肿瘤病理学、病因学' => 
  array (
  ),
  '肿瘤免疫学与血清学' => 
  array (
  ),
  '肿瘤诊断学' => 
  array (
  ),
  '肿瘤治疗学' => 
  array (
  ),
  '心脏肿瘤' => 
  array (
  ),
  '血管肿瘤' => 
  array (
  ),
  '网状内皮系统肿瘤' => 
  array (
  ),
  '脾脏肿瘤' => 
  array (
  ),
  '骨髓肿瘤' => 
  array (
  ),
  '淋巴结肿瘤' => 
  array (
  ),
  '白血病' => 
  array (
  ),
  '呼吸系肿瘤' => 
  array (
  ),
  '食管肿瘤' => 
  array (
  ),
  '胃肿瘤' => 
  array (
  ),
  '肠肿瘤' => 
  array (
  ),
  '肠系膜及腹膜后肿瘤' => 
  array (
  ),
  '腹膜及膜壁肿瘤' => 
  array (
  ),
  '肝肿瘤' => 
  array (
  ),
  '胆囊、胆道肿瘤' => 
  array (
  ),
  '胰腺肿瘤' => 
  array (
  ),
  '壶腹癌' => 
  array (
  ),
  '内分泌腺肿瘤' => 
  array (
  ),
  '输尿管肿瘤' => 
  array (
  ),
  '膀胱肿瘤' => 
  array (
  ),
  '尿道肿瘤' => 
  array (
  ),
  '男性生殖器肿瘤' => 
  array (
  ),
  '乳腺肿瘤' => 
  array (
  ),
  '运动系肿瘤' => 
  array (
  ),
  '皮肤肿瘤' => 
  array (
  ),
  '耳鼻、咽喉肿瘤' => 
  array (
  ),
  '眼肿瘤' => 
  array (
  ),
  '口腔颌面部肿瘤' => 
  array (
  ),
  '其他部位肿瘤' => 
  array (
  ),
  '耳鼻咽喉科学总论' => 
  array (
  ),
  '耳鼻咽喉外科学' => 
  array (
  ),
  '耳鼻咽喉结核' => 
  array (
  ),
  '耳鼻咽喉梅毒' => 
  array (
  ),
  '耳鼻咽喉肿瘤' => 
  array (
  ),
  '耳鼻咽喉真菌病' => 
  array (
  ),
  '耳科学、耳疾病' => 
  array (
  ),
  '鼻科学、鼻疾病' => 
  array (
  ),
  '咽科学、咽疾病' => 
  array (
  ),
  '喉科学、喉疾病' => 
  array (
  ),
  '气管与食管镜学' => 
  array (
  ),
  '眼科预防学及诊断学、治疗学' => 
  array (
  ),
  '眼的一般性疾病' => 
  array (
  ),
  '眼纤维膜疾病' => 
  array (
  ),
  '眼色素层疾病' => 
  array (
  ),
  '视网膜及视神经疾病' => 
  array (
  ),
  '眼压与青光眼' => 
  array (
  ),
  '晶状体与玻璃体疾病' => 
  array (
  ),
  '眼附属器官疾病' => 
  array (
  ),
  '眼屈光学' => 
  array (
  ),
  '眼的损伤与异物' => 
  array (
  ),
  '视网膜光凝术及激光在眼外科的应用' => 
  array (
  ),
  '眼成形术及义眼' => 
  array (
  ),
  '角膜移植' => 
  array (
  ),
  '白内障摘除术及人工晶体植入' => 
  array (
  ),
  '其他眼外科学' => 
  array (
  ),
  '总论及治疗学' => 
  array (
  ),
  '牙体疾病' => 
  array (
  ),
  '牙髓病及根尖周围病' => 
  array (
  ),
  '牙周病' => 
  array (
  ),
  '口腔粘膜病' => 
  array (
  ),
  '唾液腺疾病' => 
  array (
  ),
  '口腔颔面部肿瘤' => 
  array (
  ),
  '其它口腔疾病' => 
  array (
  ),
  '口腔颌面部外科学' => 
  array (
  ),
  '口腔矫形学' => 
  array (
  ),
  '老年口腔疾病' => 
  array (
  ),
  '儿童口腔疾病' => 
  array (
  ),
  '病毒性皮肤病' => 
  array (
  ),
  '细菌性皮肤病' => 
  array (
  ),
  '真菌性皮肤病' => 
  array (
  ),
  '寄生虫、昆虫性皮肤病' => 
  array (
  ),
  '物理性皮肤病' => 
  array (
  ),
  '变态反应性及中毒性皮肤病' => 
  array (
  ),
  '神经、精神性皮肤病' => 
  array (
  ),
  '代谢障碍性皮肤病' => 
  array (
  ),
  '先天性皮肤病' => 
  array (
  ),
  '皮肤附属器官病' => 
  array (
  ),
  '红斑' => 
  array (
  ),
  '牛皮癣' => 
  array (
  ),
  '红皮病' => 
  array (
  ),
  '性病学' => 
  array (
  ),
  '放射线学' => 
  array (
  ),
  'X线解剖学' => 
  array (
  ),
  '介入放射学' => 
  array (
  ),
  '放射病、放射损伤' => 
  array (
  ),
  '放射同位素在医学上的应用' => 
  array (
  ),
  '头颅及神经系' => 
  array (
  ),
  '心脏血管系' => 
  array (
  ),
  '胸部及呼吸系' => 
  array (
  ),
  '腹部及胃肠' => 
  array (
  ),
  '外科、骨科' => 
  array (
  ),
  '妇产、儿科' => 
  array (
  ),
  '耳鼻咽喉、眼科' => 
  array (
  ),
  '泌尿及男性生殖系' => 
  array (
  ),
  '肿瘤X线诊疗' => 
  array (
  ),
  '军事医学' => 
  array (
  ),
  '航海医学' => 
  array (
  ),
  '潜水医学' => 
  array (
  ),
  '运动医学' => 
  array (
  ),
  '法医学' => 
  array (
  ),
  '总论及基础研究' => 
  array (
  ),
  '急重症治疗技术' => 
  array (
  ),
  '全身炎症反应综合征' => 
  array (
  ),
  '休克' => 
  array (
  ),
  '急性心功能衰竭' => 
  array (
  ),
  '高血压危象' => 
  array (
  ),
  '急性呼吸功能衰竭及急性肺损伤' => 
  array (
  ),
  '内分泌系统急重症' => 
  array (
  ),
  '多器官功能衰竭' => 
  array (
  ),
  '弥漫性血管内凝血' => 
  array (
  ),
  '急性心肌梗塞' => 
  array (
  ),
  '应激性溃疡' => 
  array (
  ),
  '严重心律失常' => 
  array (
  ),
  '阿-斯综合征' => 
  array (
  ),
  '大咯血' => 
  array (
  ),
  '哮喘持续状态' => 
  array (
  ),
  '消化道大出血' => 
  array (
  ),
  '急性脑血管疾病' => 
  array (
  ),
  '创伤' => 
  array (
  ),
  '烧伤及烫伤' => 
  array (
  ),
  '全身化脓性感染' => 
  array (
  ),
  '电击伤' => 
  array (
  ),
  '急性放射病' => 
  array (
  ),
  '化学损伤' => 
  array (
  ),
  '急性药物中毒及其他物质中毒' => 
  array (
  ),
  '急性酒精中毒' => 
  array (
  ),
  '急性气体中毒' => 
  array (
  ),
  '溺水' => 
  array (
  ),
  '中暑' => 
  array (
  ),
  '毒蛇及毒虫咬伤' => 
  array (
  ),
  '军事医学卫生' => 
  array (
  ),
  '药物基础科学' => 
  array (
  ),
  '药典、药方集及药物鉴定' => 
  array (
  ),
  '药剂学' => 
  array (
  ),
  '药事组织' => 
  array (
  ),
  '药理学' => 
  array (
  ),
  '神经系统药物' => 
  array (
  ),
  '心血管系统药物' => 
  array (
  ),
  '血液及造血系统药物' => 
  array (
  ),
  '呼吸系统药物' => 
  array (
  ),
  '消化系统药物' => 
  array (
  ),
  '抗变态反应药物' => 
  array (
  ),
  '影响生长代谢机能药物' => 
  array (
  ),
  '治疗感染性疾病药物' => 
  array (
  ),
  '抗肿瘤药物' => 
  array (
  ),
  '各科药物' => 
  array (
  ),
  '各种药物的不良反应' => 
  array (
  ),
  '毒物学(毒理学)' => 
  array (
  ),
  '基础理论(医用一般科学）' => 
  array (
  ),
  '生物学' => 
  array (
    0 => '生物科学总论',
    1 => '普通生物学',
    2 => '细胞学',
    3 => '遗传学',
    4 => '生理学',
    5 => '生物化学',
    6 => '生物物理学',
    7 => '分子生物学及遗传工程',
    8 => '生物工程学',
    9 => '微生物学理论及其应用',
    10 => '植物学',
    11 => '动物学',
    12 => '昆虫学',
    13 => '人类学',
  ),
  '医用仿生学' => 
  array (
  ),
  '生物材料' => 
  array (
  ),
  '人工脏器与器官' => 
  array (
  ),
  '光、激光生物医学' => 
  array (
  ),
  '电及影像技术在生物医学中的应用' => 
  array (
  ),
  '航空、航天医学工程' => 
  array (
  ),
  '其他科学技术在医学上的应用' => 
  array (
  ),
  '仪器设备' => 
  array (
  ),
  '文学理论综述' => 
  array (
  ),
  '文艺美学' => 
  array (
  ),
  '文学理论的基本问题' => 
  array (
  ),
  '文艺工作者' => 
  array (
  ),
  '文学写作与文学创作方法' => 
  array (
  ),
  '各体文学理论和创作方法' => 
  array (
  ),
  '艺术理论' => 
  array (
  ),
  '世界各国艺术概况' => 
  array (
  ),
  '作品评论和研究' => 
  array (
  ),
  '文学史、文学思想史' => 
  array (
  ),
  '作品集' => 
  array (
  ),
  '各国文学' => 
  array (
  ),
  '方针政策及阐述' => 
  array (
  ),
  '综论及作品比较研究' => 
  array (
  ),
  '古代文学(1840年以前)' => 
  array (
  ),
  '近、现代文学(1840年－1949年)' => 
  array (
  ),
  '建国后文学(1949年以后)' => 
  array (
  ),
  '鲁迅作品及其研究' => 
  array (
  ),
  '古代作品及其评论研究' => 
  array (
  ),
  '近、现、当代作品及评论研究' => 
  array (
  ),
  '戏剧文学' => 
  array (
  ),
  '报告文学' => 
  array (
  ),
  '评论与研究' => 
  array (
  ),
  '作品' => 
  array (
  ),
  '民间文学' => 
  array (
  ),
  '儿童文学' => 
  array (
  ),
  '少数民族文学' => 
  array (
  ),
  '语言学总论' => 
  array (
  ),
  '语音学' => 
  array (
  ),
  '文字学' => 
  array (
  ),
  '语义学、语用学、词汇学、词义学' => 
  array (
  ),
  '语法学' => 
  array (
  ),
  '写作学、修辞学' => 
  array (
  ),
  '翻译学' => 
  array (
  ),
  '词典学、方言学、应用语言学、语文教学' => 
  array (
  ),
  '汉语总论' => 
  array (
  ),
  '语音' => 
  array (
  ),
  '语义、词汇、词义' => 
  array (
  ),
  '语法' => 
  array (
  ),
  '写作、修辞' => 
  array (
  ),
  '字典、词典、古代字书' => 
  array (
  ),
  '方言' => 
  array (
  ),
  '汉语教学' => 
  array (
  ),
  '中国少数民族语言' => 
  array (
  ),
  '英语及发展史' => 
  array (
  ),
  '语音、文字' => 
  array (
  ),
  '语法、构词法' => 
  array (
  ),
  '翻译' => 
  array (
  ),
  '词典、方言' => 
  array (
  ),
  '英语教学方法' => 
  array (
  ),
  '俄语' => 
  array (
  ),
  '日语' => 
  array (
  ),
  '法语、德语' => 
  array (
  ),
  '其它外国语' => 
  array (
  ),
  '音乐理论' => 
  array (
  ),
  '音乐技术理论与方法' => 
  array (
  ),
  '器乐理论与演奏法' => 
  array (
  ),
  '民族器乐理论和演奏法' => 
  array (
  ),
  '中国音乐作品' => 
  array (
  ),
  '各国音乐作品' => 
  array (
  ),
  '音乐事业' => 
  array (
  ),
  '舞蹈' => 
  array (
  ),
  '戏剧艺术理论' => 
  array (
  ),
  '舞台艺术' => 
  array (
  ),
  '中国戏剧艺术、各国戏剧艺术' => 
  array (
  ),
  '戏剧事业' => 
  array (
  ),
  '电影、电视艺术理论' => 
  array (
  ),
  '电影、电视艺术评论欣赏' => 
  array (
  ),
  '电影、电视艺术与技术' => 
  array (
  ),
  '电影、电视事业' => 
  array (
  ),
  '绘画' => 
  array (
  ),
  '书法、篆刻' => 
  array (
  ),
  '雕塑' => 
  array (
  ),
  '摄影艺术' => 
  array (
  ),
  '工艺美术' => 
  array (
  ),
  '地理学概论' => 
  array (
  ),
  '世界及各国地理' => 
  array (
  ),
  '中国地理' => 
  array (
  ),
  '世界各国地图' => 
  array (
  ),
  '文化学理论' => 
  array (
  ),
  '中国文化事业' => 
  array (
  ),
  '世界及各国文化事业' => 
  array (
  ),
  '群众文化' => 
  array (
  ),
  '史学理论总论' => 
  array (
  ),
  '史学的哲学基础' => 
  array (
  ),
  '社会发展理论' => 
  array (
  ),
  '史学专论' => 
  array (
  ),
  '年代学' => 
  array (
  ),
  '史料学' => 
  array (
  ),
  '历史研究' => 
  array (
  ),
  '史学史' => 
  array (
  ),
  '通史' => 
  array (
  ),
  '上古史' => 
  array (
  ),
  '古代史' => 
  array (
  ),
  '中世纪史' => 
  array (
  ),
  '近代史' => 
  array (
  ),
  '现代史' => 
  array (
  ),
  '民族史志' => 
  array (
  ),
  '亚洲史' => 
  array (
  ),
  '非洲史' => 
  array (
  ),
  '欧洲史' => 
  array (
  ),
  '大洋洲史' => 
  array (
  ),
  '美洲史' => 
  array (
  ),
  '革命史' => 
  array (
  ),
  '文化史' => 
  array (
  ),
  '古代史藉' => 
  array (
  ),
  '历史事件' => 
  array (
  ),
  '史料' => 
  array (
  ),
  '研究、考订、评论' => 
  array (
  ),
  '年表' => 
  array (
  ),
  '普及活动' => 
  array (
  ),
  '中国民族史志' => 
  array (
  ),
  '中国地方史志' => 
  array (
  ),
  '原始社会' => 
  array (
  ),
  '三代' => 
  array (
  ),
  '夏' => 
  array (
  ),
  '商' => 
  array (
  ),
  '西周' => 
  array (
  ),
  '春秋' => 
  array (
  ),
  '战国' => 
  array (
  ),
  '秦' => 
  array (
  ),
  '汉' => 
  array (
  ),
  '三国' => 
  array (
  ),
  '晋' => 
  array (
  ),
  '十六国' => 
  array (
  ),
  '南北朝' => 
  array (
  ),
  '隋' => 
  array (
  ),
  '唐' => 
  array (
  ),
  '五代' => 
  array (
  ),
  '宋' => 
  array (
  ),
  '元' => 
  array (
  ),
  '明' => 
  array (
  ),
  '清' => 
  array (
  ),
  '旧民主主义革命时期' => 
  array (
  ),
  '清后期' => 
  array (
  ),
  '第一次鸦片战争及以后' => 
  array (
  ),
  '太平天国革命' => 
  array (
  ),
  '第二次鸦片战争' => 
  array (
  ),
  '第二次鸦片战争以后的时期' => 
  array (
  ),
  '辛亥革命' => 
  array (
  ),
  '中华民国早期' => 
  array (
  ),
  '新民主主义革命时期' => 
  array (
  ),
  '五四运动和中国共产党成立' => 
  array (
  ),
  '第一次国内革命战争时期' => 
  array (
  ),
  '第二次国内革命战争时期' => 
  array (
  ),
  '抗日战争时期' => 
  array (
  ),
  '第三次国内革命战争时期' => 
  array (
  ),
  '中华人民共和国史' => 
  array (
  ),
  '考古学理论与方法' => 
  array (
  ),
  '世界考古' => 
  array (
  ),
  '中国考古' => 
  array (
  ),
  '传记研究与编写' => 
  array (
  ),
  '世界人物传记' => 
  array (
  ),
  '世界各时代人物总传' => 
  array (
  ),
  '世界人物各科总传' => 
  array (
  ),
  '世界人物民族谱系' => 
  array (
  ),
  '中国人物传记总论' => 
  array (
  ),
  '中国人物普通总传' => 
  array (
  ),
  '中国文史哲、军事、财经人物' => 
  array (
  ),
  '中国理工类人物' => 
  array (
  ),
  '中国社会、政治人物' => 
  array (
  ),
  '中国其他人物' => 
  array (
  ),
  '外国人物' => 
  array (
  ),
  '基本理论问题' => 
  array (
  ),
  '辩证唯物主义' => 
  array (
  ),
  '历史唯物主义' => 
  array (
  ),
  '哲学流派及其研究' => 
  array (
  ),
  '世界哲学' => 
  array (
  ),
  '三国－五代哲学' => 
  array (
  ),
  '宋、元、明、清哲学' => 
  array (
  ),
  '近、现代哲学' => 
  array (
  ),
  '马克思主义哲学在中国的传播、发展及其他' => 
  array (
  ),
  '思维科学' => 
  array (
  ),
  '自然辩证法' => 
  array (
  ),
  '逻辑学' => 
  array (
    0 => '逻辑学',
  ),
  '伦理学基本理论' => 
  array (
  ),
  '人生观、人生哲学、国家道德' => 
  array (
  ),
  '职业道德' => 
  array (
  ),
  '综合(家庭、婚姻道德、社会公德、个人修养)' => 
  array (
  ),
  '心理学' => 
  array (
    0 => '心理学',
  ),
  '美学' => 
  array (
    0 => '美学',
  ),
  '综合' => 
  array (
  ),
  '佛教' => 
  array (
  ),
  '道教' => 
  array (
  ),
  '伊斯兰教' => 
  array (
  ),
  '基督教' => 
  array (
  ),
  '马克思、恩格斯著作' => 
  array (
  ),
  '列宁著作' => 
  array (
  ),
  '斯大林著作' => 
  array (
  ),
  '毛泽东著作' => 
  array (
  ),
  '邓小平著作' => 
  array (
  ),
  '马、恩、列、斯、毛、邓著作汇编' => 
  array (
  ),
  '马、恩、列、斯、毛、邓生平与传记' => 
  array (
  ),
  '马克思主义' => 
  array (
    0 => '马克思、恩格斯、列宁、斯大林、毛泽东、邓小平著作',
    1 => '马、恩、列、斯、毛、邓生平与传记',
    2 => '马克思主义、列宁主义、毛泽东思想、邓小平理论的学习和研究',
  ),
  '列宁主义' => 
  array (
  ),
  '斯大林思想' => 
  array (
  ),
  '毛泽东思想' => 
  array (
  ),
  '邓小平理论' => 
  array (
  ),
  '党的执政能力' => 
  array (
  ),
  '“三个代表”理论和党员先进性教育' => 
  array (
  ),
  '科学发展观与和谐社会' => 
  array (
  ),
  '著作汇编的学习和研究' => 
  array (
  ),
  '建党理论、党章' => 
  array (
  ),
  '中央与地方组织、会议及其文献' => 
  array (
  ),
  '会议文献的学习参考资料' => 
  array (
  ),
  '社会主义革命和建设时期' => 
  array (
  ),
  '党的地方组织史料' => 
  array (
  ),
  '党史参考资料' => 
  array (
  ),
  '党的总路线和总政策' => 
  array (
  ),
  '党的领导' => 
  array (
  ),
  '思想建设' => 
  array (
  ),
  '组织建设' => 
  array (
  ),
  '党员' => 
  array (
  ),
  '整风、整党运动' => 
  array (
  ),
  '党的基层工作' => 
  array (
  ),
  '中国共产党与各国共产党的关系' => 
  array (
  ),
  '中国共产主义青年团' => 
  array (
  ),
  '政治理论' => 
  array (
  ),
  '阶级、阶层理论' => 
  array (
  ),
  '革命理论' => 
  array (
  ),
  '国家理论' => 
  array (
  ),
  '无产阶级革命与无产阶级专政理论' => 
  array (
  ),
  '政党理论' => 
  array (
  ),
  '民族殖民地问题理论' => 
  array (
  ),
  '政治流派与思潮、其他政治理论问题' => 
  array (
  ),
  '政治学史、政治思想史' => 
  array (
  ),
  '政策政论、中国革命和建设问题' => 
  array (
  ),
  '政治制度与国家机构' => 
  array (
  ),
  '政治运动、政治事件' => 
  array (
  ),
  '我国社会主义历史时期的阶级和阶级斗争' => 
  array (
  ),
  '阶级、阶层' => 
  array (
  ),
  '中国人民政治协商会议' => 
  array (
  ),
  '民主党派及其活动' => 
  array (
  ),
  '社会调查和社会分析' => 
  array (
  ),
  '社会生活与社会问题' => 
  array (
  ),
  '地方政治' => 
  array (
  ),
  '政治制度史' => 
  array (
  ),
  '世界政治概况' => 
  array (
  ),
  '国际政治矛盾与斗争' => 
  array (
  ),
  '世界政治制度与国家机构' => 
  array (
  ),
  '世界政治事件' => 
  array (
  ),
  '世界社会结构' => 
  array (
  ),
  '社会保障与社会福利' => 
  array (
  ),
  '世界政治制度史' => 
  array (
  ),
  '亚洲' => 
  array (
  ),
  '非洲' => 
  array (
  ),
  '欧洲' => 
  array (
  ),
  '大洋洲及太平洋岛屿' => 
  array (
  ),
  '美洲' => 
  array (
  ),
  '外交、国际关系理论' => 
  array (
  ),
  '国际关系' => 
  array (
  ),
  '中国外交' => 
  array (
  ),
  '各国外交' => 
  array (
  ),
  '思想政治教育和精神文明建设' => 
  array (
  ),
  '革命传统教育' => 
  array (
  ),
  '形势教育、国情教育' => 
  array (
  ),
  '国际主义、爱国主义教育' => 
  array (
  ),
  '道德教育' => 
  array (
  ),
  '家庭、婚姻道德教育' => 
  array (
  ),
  '行政学' => 
  array (
  ),
  '国家机关工作与干部工作' => 
  array (
  ),
  '民政工作' => 
  array (
  ),
  '民族工作' => 
  array (
  ),
  '侨务工作' => 
  array (
  ),
  '宗教事务工作' => 
  array (
  ),
  '群众自治工作' => 
  array (
  ),
  '国际共产主义运动' => 
  array (
  ),
  '民主党派' => 
  array (
  ),
  '民国及民国以前政党' => 
  array (
  ),
  '各国共产党' => 
  array (
  ),
  '其他政党' => 
  array (
  ),
  '中国工人运动与组织' => 
  array (
  ),
  '世界工人运动与组织' => 
  array (
  ),
  '中国农民运动与组织' => 
  array (
  ),
  '世界农民运动与组织' => 
  array (
  ),
  '中国青年、学生运动与组织' => 
  array (
  ),
  '世界青年、学生运动与组织' => 
  array (
  ),
  '中国妇女运动与组织' => 
  array (
  ),
  '世界妇女运动与组织' => 
  array (
  ),
  '军事理论' => 
  array (
  ),
  '中国军史' => 
  array (
  ),
  '世界及各国军史' => 
  array (
  ),
  '军事组织与管理' => 
  array (
  ),
  '战略、战役、战术' => 
  array (
  ),
  '公安工作概论' => 
  array (
  ),
  '公安行政工作' => 
  array (
  ),
  '刑事侦查工作' => 
  array (
  ),
  '保密工作' => 
  array (
  ),
  '治安工作' => 
  array (
  ),
  '交通管理' => 
  array (
  ),
  '消防工作' => 
  array (
  ),
  '看守所、收容所管理' => 
  array (
  ),
  '劳动教养' => 
  array (
  ),
  '犯罪学' => 
  array (
  ),
  '刑事侦查学' => 
  array (
  ),
  '司法鉴定学' => 
  array (
  ),
  '法律理论' => 
  array (
  ),
  '各国法律' => 
  array (
  ),
  '中国法制史' => 
  array (
  ),
  '案例分析' => 
  array (
  ),
  '国家法、宪法' => 
  array (
  ),
  '行政法' => 
  array (
  ),
  '土地法' => 
  array (
  ),
  '农业经济管理法令' => 
  array (
  ),
  '劳动法' => 
  array (
  ),
  '自然资源与环境保护法' => 
  array (
  ),
  '地方法制' => 
  array (
  ),
  '民法' => 
  array (
  ),
  '婚姻家庭法' => 
  array (
  ),
  '商法' => 
  array (
  ),
  '刑法' => 
  array (
    0 => '刑法',
  ),
  '财政法' => 
  array (
  ),
  '金融法' => 
  array (
  ),
  '经济法' => 
  array (
    0 => '经济法',
    1 => '财政法',
    2 => '金融法',
  ),
  '制度与方法' => 
  array (
  ),
  '民事诉讼法' => 
  array (
  ),
  '刑事诉讼法' => 
  array (
  ),
  '行政诉讼法' => 
  array (
  ),
  '仲裁法' => 
  array (
  ),
  '司法制度' => 
  array (
  ),
  '国际法理论' => 
  array (
  ),
  '国际经济法' => 
  array (
  ),
  '国际私法' => 
  array (
  ),
  '社会科学理论与方法论' => 
  array (
  ),
  '社会科学现状及发展' => 
  array (
  ),
  '机关、团体、会议' => 
  array (
  ),
  '社会科学研究方法、工作方法' => 
  array (
  ),
  '社会科学教育、文献及参考工具书' => 
  array (
  ),
  '社会学理论' => 
  array (
  ),
  '社会发展和变迁' => 
  array (
  ),
  '社会结构和社会关系' => 
  array (
  ),
  '社会工作、社会管理、社会规划' => 
  array (
  ),
  '统计学理论与方法' => 
  array (
  ),
  '世界各国统计工作' => 
  array (
  ),
  '世界各国统计资料' => 
  array (
  ),
  '民族学' => 
  array (
    0 => '民族学',
  ),
  '人口学与计划生育' => 
  array (
    0 => '人口学与计划生育',
  ),
  '人才学' => 
  array (
  ),
  '劳动科学' => 
  array (
  ),
  '教育基本理论及教育职能' => 
  array (
  ),
  '全面发展教育' => 
  array (
  ),
  '思想政治教育、德育' => 
  array (
  ),
  '智育、美育、劳动技术教育' => 
  array (
  ),
  '教育与其他科学关系、教育学专论' => 
  array (
  ),
  '教育学派及教育学史、教育思想史' => 
  array (
  ),
  '教学理论' => 
  array (
    0 => '教学法和教学组织',
  ),
  '教学法和教学组织' => 
  array (
  ),
  '电化教育理论' => 
  array (
  ),
  '视听教学' => 
  array (
  ),
  '广播电视教学' => 
  array (
  ),
  '程序教学' => 
  array (
  ),
  '计算机教学' => 
  array (
  ),
  '电化教材' => 
  array (
  ),
  '教育心理学' => 
  array (
  ),
  '教师' => 
  array (
  ),
  '学生' => 
  array (
  ),
  '学校与家庭、学校与社会' => 
  array (
  ),
  '教育行政' => 
  array (
  ),
  '学校管理' => 
  array (
  ),
  '健康教育' => 
  array (
  ),
  '学校建筑和设备' => 
  array (
  ),
  '中国教育事业' => 
  array (
  ),
  '各国教育事业' => 
  array (
  ),
  '自然科学教育与普及' => 
  array (
  ),
  '教育管理学' => 
  array (
  ),
  '幼教理论' => 
  array (
  ),
  '思想品德教育' => 
  array (
  ),
  '幼儿教学' => 
  array (
  ),
  '世界各国幼教概况' => 
  array (
  ),
  '初等教育理论' => 
  array (
  ),
  '政治思想教育' => 
  array (
  ),
  '中国各类型初等教育概况' => 
  array (
  ),
  '世界各国及地区初等教育概况' => 
  array (
  ),
  '教学理论与教学方法' => 
  array (
  ),
  '教师、班主任及师生关系' => 
  array (
  ),
  '教材、课本、辅助教材' => 
  array (
  ),
  '语文' => 
  array (
  ),
  '数学' => 
  array (
    0 => '数学概论',
    1 => '古典数学',
    2 => '初、高等数学',
    3 => '数理逻辑、数学基础',
    4 => '代数、数论、组合理论',
    5 => '数学分析',
    6 => '几何、拓扑',
    7 => '动力系统理论',
    8 => '运筹学',
    9 => '控制论、信息论(数学理论)',
    10 => '计算数学',
    11 => '应用数学',
  ),
  '政治、外语' => 
  array (
  ),
  '自然、常识' => 
  array (
  ),
  '音乐、美术' => 
  array (
  ),
  '体育、游戏' => 
  array (
  ),
  '中等教育理论' => 
  array (
  ),
  '思想政治教育' => 
  array (
    0 => '思想政治教育和精神文明建设',
    1 => '革命传统教育',
    2 => '形势教育、国情教育',
    3 => '国际主义、爱国主义教育',
    4 => '道德教育',
    5 => '家庭、婚姻道德教育',
  ),
  '中国与地区各级、各类教育状况' => 
  array (
  ),
  '世界各国教育状况' => 
  array (
  ),
  '教师、班主任、师生关系' => 
  array (
  ),
  '物理、化学' => 
  array (
  ),
  '历史、地理' => 
  array (
  ),
  '其他各科及教学法' => 
  array (
  ),
  '高等教育理论' => 
  array (
  ),
  '教学理论、教学法' => 
  array (
  ),
  '研究生教育' => 
  array (
  ),
  '科学研究工作' => 
  array (
  ),
  '教师与学生' => 
  array (
    0 => '教师',
  ),
  '各类型高等学校' => 
  array (
  ),
  '中国及地方高等教育' => 
  array (
  ),
  '世界各国教育' => 
  array (
  ),
  '师范教育' => 
  array (
  ),
  '职业技术教育综述' => 
  array (
  ),
  '各类型职业技术学校' => 
  array (
  ),
  '世界各国职业技术教育概况' => 
  array (
  ),
  '成教综述' => 
  array (
  ),
  '初等成人业余教育' => 
  array (
  ),
  '中等成人业余教育' => 
  array (
  ),
  '高等成人业余教育' => 
  array (
  ),
  '农民业余教育' => 
  array (
  ),
  '职工教育' => 
  array (
  ),
  '函授、刊授教育' => 
  array (
  ),
  '广播、电视教育' => 
  array (
  ),
  '世界各国成人业余教育概况' => 
  array (
  ),
  '华侨教育、侨民教育' => 
  array (
  ),
  '少数民族教育' => 
  array (
  ),
  '特殊教育' => 
  array (
  ),
  '社会教育' => 
  array (
  ),
  '家庭教育' => 
  array (
  ),
  '自学' => 
  array (
  ),
  '体育基础科学' => 
  array (
  ),
  '体育锻炼' => 
  array (
  ),
  '体育教育' => 
  array (
  ),
  '运动训练、运动竞赛' => 
  array (
  ),
  '世界体育组织、世界体育竞赛、世界体育科学、教育、体育史' => 
  array (
  ),
  '中国体育组织、中国体育竞赛、中国体育科学、教育、体育史' => 
  array (
  ),
  '各国' => 
  array (
  ),
  '运动场地与设备' => 
  array (
  ),
  '体育运动技术' => 
  array (
  ),
  '径项' => 
  array (
  ),
  '田项' => 
  array (
  ),
  '全能' => 
  array (
  ),
  '基本体操' => 
  array (
  ),
  '竞技体操' => 
  array (
  ),
  '艺术体操及其它' => 
  array (
  ),
  '篮球' => 
  array (
  ),
  '排球' => 
  array (
  ),
  '足球' => 
  array (
  ),
  '手球' => 
  array (
  ),
  '网球' => 
  array (
  ),
  '乒乓球' => 
  array (
  ),
  '羽毛球及其它' => 
  array (
  ),
  '武术及民族形式体育' => 
  array (
  ),
  '水上、冰上与雪上运动' => 
  array (
  ),
  '其它体育运动' => 
  array (
  ),
  '棋类、文体类' => 
  array (
  ),
  '电子工业' => 
  array (
  ),
  '真空电子技术' => 
  array (
  ),
  '半导体材料' => 
  array (
  ),
  '半导体器件制造工艺及设备' => 
  array (
  ),
  '测量、检验、可靠性及例行试验' => 
  array (
  ),
  '半导体二极管' => 
  array (
  ),
  '半导体三极管(晶体管)' => 
  array (
  ),
  '晶闸管(可控硅)' => 
  array (
  ),
  '半导体整流器' => 
  array (
  ),
  '半导体光电器件' => 
  array (
  ),
  '半导体热电器件、热敏电阻' => 
  array (
  ),
  '微电子理论' => 
  array (
  ),
  '微电子设计、分析、计算' => 
  array (
  ),
  '制造工艺及设备' => 
  array (
  ),
  '微模组件' => 
  array (
  ),
  '半导体集成电路(固体电路)' => 
  array (
  ),
  '膜集成电路' => 
  array (
  ),
  '混合集成电路' => 
  array (
  ),
  '中、大、超大规模集成电路' => 
  array (
  ),
  '真空集成电路' => 
  array (
  ),
  '光学集成电路(集成光路)' => 
  array (
  ),
  '功能块(分子电路)' => 
  array (
  ),
  '微电子学、集成电路应用' => 
  array (
  ),
  '微波元件、微波铁氧体元件' => 
  array (
  ),
  '电声器件' => 
  array (
  ),
  '声光器件' => 
  array (
  ),
  '电子电路、网络、变能器、均衡器及衰减器(衰耗器)' => 
  array (
  ),
  '滤波技术、滤波器' => 
  array (
  ),
  '放大技术、放大器' => 
  array (
  ),
  '功率合成器' => 
  array (
  ),
  '频率合成技术、频率合成器' => 
  array (
  ),
  '振荡技术、振荡器' => 
  array (
  ),
  '调制技术与调制器、解调技术与解调器' => 
  array (
  ),
  '倍频器、分频器、变频器' => 
  array (
  ),
  '脉冲技术、脉冲电路' => 
  array (
  ),
  '数字电路' => 
  array (
  ),
  '开关电路' => 
  array (
  ),
  '变能器、均衡器、衰减器(衰耗器)及其他' => 
  array (
  ),
  '馈线设备(传输线和波导)' => 
  array (
  ),
  '天线' => 
  array (
  ),
  '发送设备、发射机' => 
  array (
  ),
  '接收设备、无线电收音机' => 
  array (
  ),
  '电源' => 
  array (
  ),
  '终端设备' => 
  array (
  ),
  '通信理论' => 
  array (
  ),
  '电声技术和语音信号处理' => 
  array (
  ),
  '通信线路工程、通信网' => 
  array (
  ),
  '通信系统(传输系统)' => 
  array (
  ),
  '电话、电报、传真' => 
  array (
  ),
  '保密通信与通信安全' => 
  array (
  ),
  '数据通信' => 
  array (
  ),
  '无线通信' => 
  array (
  ),
  '广播' => 
  array (
  ),
  '电视' => 
  array (
  ),
  '雷达' => 
  array (
  ),
  '无线电导航' => 
  array (
  ),
  '电子对抗(干扰及抗干扰)' => 
  array (
  ),
  '无线电、电信测量技术及仪器' => 
  array (
  ),
  '无线电电子学的应用' => 
  array (
  ),
  '设计与性能分析' => 
  array (
  ),
  '制造、装配、改装' => 
  array (
  ),
  '调整、测试、校验' => 
  array (
  ),
  '机房' => 
  array (
  ),
  '一般计算器和计算机' => 
  array (
  ),
  '基本电路' => 
  array (
  ),
  '运算器和控制器(中央处理机)' => 
  array (
  ),
  '存贮器' => 
  array (
  ),
  '外部设备' => 
  array (
  ),
  '信息转换及其设备' => 
  array (
  ),
  '总线、通道' => 
  array (
  ),
  '仿真器' => 
  array (
  ),
  '各种电子数字计算机' => 
  array (
  ),
  '微机的通讯和应用' => 
  array (
  ),
  '各种微处理机' => 
  array (
  ),
  '微处理机的应用' => 
  array (
  ),
  '单版微型计算机' => 
  array (
  ),
  '个人计算机' => 
  array (
  ),
  '服务器及网络计算机' => 
  array (
  ),
  '其他计算机' => 
  array (
  ),
  '计算机理论与方法' => 
  array (
  ),
  '安全保密' => 
  array (
  ),
  '计算机软件概况' => 
  array (
  ),
  '一般程序设计' => 
  array (
  ),
  '网络程序设计' => 
  array (
  ),
  '软件工程' => 
  array (
  ),
  '软件工具、工具软件' => 
  array (
  ),
  '硬件语言' => 
  array (
  ),
  '程序语言' => 
  array (
  ),
  '网络语言' => 
  array (
  ),
  '编译程序、解释程序' => 
  array (
  ),
  '管理程序、管理系统' => 
  array (
  ),
  '操作系统' => 
  array (
  ),
  '数据库理论及系统' => 
  array (
  ),
  '程序包(应用软件)' => 
  array (
  ),
  '专用应用程序' => 
  array (
  ),
  '模式识别与装置' => 
  array (
  ),
  '机器辅助技术' => 
  array (
  ),
  '计算机仿真' => 
  array (
  ),
  '翻译、检索、诊断、教学及其他' => 
  array (
  ),
  '计算机在文化、科学、教育、体育等领域的应用' => 
  array (
  ),
  '计算机在政、经、法等领域的应用' => 
  array (
  ),
  '计算机在天文学、地球科学等领域的应用' => 
  array (
  ),
  '计算机在农业科学领域的应用' => 
  array (
  ),
  '计算机在数理科学及化学领域的应用' => 
  array (
  ),
  '计算机在交通运输领域的应用' => 
  array (
  ),
  '计算机在航空、航天领域的应用' => 
  array (
  ),
  '计算机在医药、卫生及生物科学领域的应用' => 
  array (
  ),
  '计算机在环境科学及劳动保护科学等领域的应用' => 
  array (
  ),
  '计算机在工业技术领域的应用' => 
  array (
  ),
  '计算机在军事领域的应用' => 
  array (
  ),
  '计算机网络理论' => 
  array (
  ),
  '网络结构与设计' => 
  array (
  ),
  '通信协议' => 
  array (
  ),
  '通信设备与线路' => 
  array (
  ),
  '网络管理与运行' => 
  array (
  ),
  '网络安全' => 
  array (
  ),
  '浏览器与资源' => 
  array (
  ),
  '文件传送程序' => 
  array (
  ),
  '远程登陆、远程控制' => 
  array (
  ),
  '电子邮件及相关问题' => 
  array (
  ),
  '以太网' => 
  array (
  ),
  'ATM局域网' => 
  array (
  ),
  '校园网' => 
  array (
  ),
  '广域网' => 
  array (
  ),
  '互联网' => 
  array (
  ),
  '自动化技术总论' => 
  array (
  ),
  '自动化系统理论' => 
  array (
  ),
  '自动控制理论' => 
  array (
  ),
  '自动信息理论' => 
  array (
  ),
  '自动模拟理论(自动仿真理论)' => 
  array (
  ),
  '开关电路理论' => 
  array (
  ),
  '人工智能理论' => 
  array (
  ),
  '自动化元件、部件' => 
  array (
  ),
  '自动化装置与设备' => 
  array (
  ),
  '机器人技术' => 
  array (
  ),
  '一般自动化系统' => 
  array (
  ),
  '自动调节、自动调节系统' => 
  array (
  ),
  '自动控制、自动控制系统' => 
  array (
  ),
  '数据处理、数据处理系统' => 
  array (
  ),
  '自动随动、自动随动系统' => 
  array (
  ),
  '自动拖动、自动拖动系统' => 
  array (
  ),
  '监视、报警、故障诊断系统' => 
  array (
  ),
  '自动生产作业线' => 
  array (
  ),
  '自动化技术在矿业工程中的应用' => 
  array (
  ),
  '自动化技术在石油、天然气工业中的应用' => 
  array (
  ),
  '自动化技术在冶金工业中的应用' => 
  array (
  ),
  '自动化技术在金属工业中的应用' => 
  array (
  ),
  '自动化技术在机械、仪表工业中的应用' => 
  array (
  ),
  '自动化技术在原子能及动力工业中的应用' => 
  array (
  ),
  '自动化技术在电力系统中的应用' => 
  array (
  ),
  '自动化技术在化学工业中的应用' => 
  array (
  ),
  '自动化技术在轻工业及手工业中的应用' => 
  array (
  ),
  '自动化技术在建筑工业中的应用' => 
  array (
  ),
  '自动化技术在水利工程中的应用' => 
  array (
  ),
  '自动化技术在交通运输中的应用' => 
  array (
  ),
  '自动化技术在航空、航天中的应用' => 
  array (
  ),
  '自动化技术在天文学及地球科学中的应用' => 
  array (
  ),
  '自动化技术在环境科学、劳动保护科学中的应用' => 
  array (
  ),
  '自动化技术在农业中的应用' => 
  array (
  ),
  '自动化技术在军事工业中的应用' => 
  array (
  ),
  '自动化技术在医药、卫生及生物科学中的应用' => 
  array (
  ),
  '射流技术(流控技术)' => 
  array (
  ),
  '远动技术' => 
  array (
  ),
  '信息与传播理论' => 
  array (
  ),
  '新闻学' => 
  array (
  ),
  '新闻采访和报道、编辑工作及新闻摄影' => 
  array (
  ),
  '组织、管理与新闻工作者' => 
  array (
  ),
  '报纸及其出版发行' => 
  array (
  ),
  '世界各国新闻事业' => 
  array (
  ),
  '广播电视' => 
  array (
  ),
  '出版理论' => 
  array (
  ),
  '组织、管理' => 
  array (
  ),
  '编辑工作' => 
  array (
  ),
  '印刷工作' => 
  array (
  ),
  '发行工作' => 
  array (
  ),
  '图书宣传评价' => 
  array (
  ),
  '世界各国出版事业' => 
  array (
  ),
  '中国出版事业' => 
  array (
  ),
  '图书馆学及管理' => 
  array (
  ),
  '数字图书馆' => 
  array (
  ),
  '读者工作及藏书建设' => 
  array (
  ),
  '文献标引与编目' => 
  array (
  ),
  '各种文献工作及文献学' => 
  array (
  ),
  '目录学' => 
  array (
  ),
  '各类型图书馆' => 
  array (
  ),
  '世界各国图书馆事业' => 
  array (
  ),
  '中国图书馆事业' => 
  array (
  ),
  '情报学及情报工作体制、组织' => 
  array (
  ),
  '情报工作' => 
  array (
  ),
  '情报事业' => 
  array (
  ),
  '档案学' => 
  array (
  ),
  '档案管理' => 
  array (
  ),
  '收集和整理、保管和利用、公布、出版' => 
  array (
  ),
  '各类型档案' => 
  array (
  ),
  '建筑和设备' => 
  array (
  ),
  '世界各国档案事业' => 
  array (
  ),
  '中国档案事业' => 
  array (
  ),
  '博物馆学、博物馆事业' => 
  array (
  ),
  '国民经济计划与管理' => 
  array (
  ),
  '经济计算、经济数学方法' => 
  array (
  ),
  '劳动经济' => 
  array (
  ),
  '物资经济' => 
  array (
  ),
  '城市与市政经济' => 
  array (
  ),
  '基本建设经济' => 
  array (
  ),
  '可持续发展' => 
  array (
  ),
  '经济概论' => 
  array (
  ),
  '社会生产方式' => 
  array (
  ),
  '经济学分支科学及各科经济学' => 
  array (
  ),
  '经济思想史' => 
  array (
  ),
  '世界经济' => 
  array (
  ),
  '中国经济方针政策其阐述' => 
  array (
  ),
  '社会经济结构与体制' => 
  array (
  ),
  '经济建设与发展' => 
  array (
  ),
  '对外经济关系' => 
  array (
  ),
  '人民生活状况' => 
  array (
  ),
  '地方经济' => 
  array (
  ),
  '中国经济史' => 
  array (
  ),
  '其他各国经济' => 
  array (
  ),
  '经济统计概述' => 
  array (
  ),
  '经济统计方法' => 
  array (
  ),
  '专门经济统计' => 
  array (
  ),
  '国际经济统计' => 
  array (
  ),
  '经济统计组织与工作' => 
  array (
  ),
  '土地问题理论' => 
  array (
  ),
  '农业计划与管理' => 
  array (
  ),
  '农业建设与发展' => 
  array (
  ),
  '农业生产' => 
  array (
  ),
  '农业企业经营与管理' => 
  array (
  ),
  '农业部门经济' => 
  array (
    0 => '林业',
    1 => '种植业',
    2 => '畜牧业、饲养业',
    3 => '渔业、水产业',
    4 => '农家副业、农产品加工工业',
    5 => '农村生产服务业',
  ),
  '世界农业经济' => 
  array (
  ),
  '方针政策及其阐述' => 
  array (
  ),
  '农业经济结构与体制' => 
  array (
  ),
  '农业发展速度与部门间比例' => 
  array (
  ),
  '农业区域规划与生产布局' => 
  array (
  ),
  '农业资源开发和利用' => 
  array (
  ),
  '农业技术改造、农业技术经济' => 
  array (
  ),
  '集约耕种、多种经营、综合开发' => 
  array (
  ),
  '农业商品生产、农业劳动生产率' => 
  array (
  ),
  '农产品价格与市场' => 
  array (
  ),
  '农业劳动力与农业人口' => 
  array (
  ),
  '农业收入与分配' => 
  array (
  ),
  '农业资金、农业投资' => 
  array (
  ),
  '农业企业组织与管理' => 
  array (
  ),
  '农业生产组织与经营管理' => 
  array (
  ),
  '种植业' => 
  array (
  ),
  '林业' => 
  array (
    0 => '林业基础科学',
    1 => '造林学、林木育种及造林技术',
    2 => '绿化建设',
    3 => '森林经营学、森林计测学、森林经理学',
    4 => '森林保护学',
    5 => '森林工程、林业机械',
    6 => '森林采运与利用',
    7 => '森林树种',
  ),
  '畜牧业、饲养业' => 
  array (
  ),
  '渔业、水产业' => 
  array (
  ),
  '农家副业、农产品加工工业' => 
  array (
  ),
  '农村生产服务业' => 
  array (
  ),
  '地方农业经济及农民生活状况' => 
  array (
  ),
  '中国农业经济史' => 
  array (
  ),
  '工业经济理论' => 
  array (
    0 => '工业经济结构和体制',
    1 => '工业计划与管理体制',
    2 => '工业劳动与工资、劳动生产率',
    3 => '工业品供销与市场',
    4 => '工业企业组织与管理',
  ),
  '工业经济结构和体制' => 
  array (
  ),
  '工业计划与管理体制' => 
  array (
  ),
  '工业建设与发展' => 
  array (
  ),
  '工业劳动与工资、劳动生产率' => 
  array (
  ),
  '工业品供销与市场' => 
  array (
  ),
  '工业企业组织与管理' => 
  array (
  ),
  '工业部门经济' => 
  array (
    0 => '冶金工业',
    1 => '地质、矿业',
    2 => '能源工业、动力工业',
    3 => '金属加工机械工业',
    4 => '航空、航天工业',
    5 => '电气、电子工业',
    6 => '化学工业',
    7 => '轻工业、手工业',
    8 => '建筑、水利工程',
  ),
  '地质、矿业' => 
  array (
  ),
  '能源工业、动力工业' => 
  array (
  ),
  '冶金工业' => 
  array (
    0 => '冶金工艺总论',
    1 => '冶金工业经济',
    2 => '冶金一般性问题',
    3 => '冶金技术',
    4 => '冶金机械、冶金生产自动化',
    5 => '钢铁冶炼(黑色金属冶炼)(总论)',
    6 => '炼铁',
    7 => '铁合金冶炼',
    8 => '炼钢',
    9 => '其他黑色金属冶炼',
    10 => '有色金属冶炼',
  ),
  '金属加工机械工业' => 
  array (
  ),
  '航空、航天工业' => 
  array (
  ),
  '电气、电子工业' => 
  array (
  ),
  '化学工业' => 
  array (
  ),
  '轻工业、手工业' => 
  array (
  ),
  '建筑、水利工程' => 
  array (
  ),
  '各国工业经济' => 
  array (
  ),
  '方针政策' => 
  array (
  ),
  '工业经济结构与体制' => 
  array (
  ),
  '工业计划与管理' => 
  array (
  ),
  '工业企业组织与经营管理' => 
  array (
  ),
  '地方工业经济' => 
  array (
  ),
  '中国工业经济史' => 
  array (
  ),
  '交通运输经济理论及概况' => 
  array (
  ),
  '陆路、公路运输经济' => 
  array (
  ),
  '城市交通运输经济' => 
  array (
  ),
  '企业经济理论和方法' => 
  array (
  ),
  '企业体制' => 
  array (
  ),
  '企业计划与经营决策' => 
  array (
  ),
  '企业生产管理' => 
  array (
  ),
  '企业营销管理' => 
  array (
  ),
  '企业财务管理' => 
  array (
  ),
  '各种企业经济' => 
  array (
  ),
  '世界企业经济' => 
  array (
  ),
  '中国企业经济' => 
  array (
  ),
  '各国企业经济' => 
  array (
  ),
  '旅游经济理论与方法' => 
  array (
  ),
  '中国旅游事业' => 
  array (
  ),
  '世界旅游及各国旅游事业' => 
  array (
  ),
  '中国旅游地理' => 
  array (
  ),
  '世界旅游地理' => 
  array (
  ),
  '旅游文化' => 
  array (
  ),
  '旅游商品' => 
  array (
  ),
  '旅游房产' => 
  array (
  ),
  '旅游展会' => 
  array (
  ),
  '旅游餐饮、饭店' => 
  array (
  ),
  '娱乐业' => 
  array (
  ),
  '旅游标准、旅游投诉' => 
  array (
  ),
  '文化经济学' => 
  array (
  ),
  '世界各国文化产业' => 
  array (
  ),
  '中国文化产业' => 
  array (
  ),
  '新闻出版产业' => 
  array (
  ),
  '广播电视产业' => 
  array (
  ),
  '群众文化产业' => 
  array (
  ),
  '娱乐业、文化服务业' => 
  array (
  ),
  '图书馆档案与博物馆产业' => 
  array (
  ),
  '艺术市场' => 
  array (
  ),
  '收藏品市场' => 
  array (
  ),
  '信息产业经济' => 
  array (
  ),
  '电信' => 
  array (
  ),
  '邮政' => 
  array (
  ),
  '邮电经济理论' => 
  array (
  ),
  '世界各国邮电事业' => 
  array (
  ),
  '服务业经济概论' => 
  array (
  ),
  '旅馆业' => 
  array (
  ),
  '餐饮业' => 
  array (
  ),
  '其它服务业' => 
  array (
  ),
  '贸易经济理论与方法' => 
  array (
  ),
  '贸易经济结构与体制' => 
  array (
  ),
  '贸易计划与管理体制' => 
  array (
  ),
  '商品流通与市场' => 
  array (
  ),
  '商品价格与流通费用' => 
  array (
  ),
  '商业企业组织与管理' => 
  array (
  ),
  '商业技术与设备' => 
  array (
  ),
  '各种商业企业' => 
  array (
  ),
  '商业工作者' => 
  array (
  ),
  '中国国内贸易经济' => 
  array (
  ),
  '世界各国国内贸易经济' => 
  array (
  ),
  '国际贸易' => 
  array (
  ),
  '中国对外贸易' => 
  array (
  ),
  '商品学' => 
  array (
  ),
  '财政理论' => 
  array (
  ),
  '世界财政' => 
  array (
  ),
  '方针政策与财政制度' => 
  array (
  ),
  '预算与决算' => 
  array (
  ),
  '财政收入与税收' => 
  array (
  ),
  '国家内债、外债' => 
  array (
  ),
  '地方财政、农村财政' => 
  array (
  ),
  '财政史' => 
  array (
  ),
  '货币' => 
  array (
  ),
  '金融银行理论' => 
  array (
  ),
  '国际金融' => 
  array (
  ),
  '各国金融' => 
  array (
  ),
  '金融、银行体制' => 
  array (
  ),
  '银行制度与业务' => 
  array (
  ),
  '金融组织、银行' => 
  array (
  ),
  '信贷' => 
  array (
  ),
  '金融市场' => 
  array (
  ),
  '汇兑、对外金融关系' => 
  array (
  ),
  '地方金融事业及金融史、银行史' => 
  array (
  ),
  '金融危机及其风险防范' => 
  array (
  ),
  '证券学理论' => 
  array (
  ),
  '世界证券业' => 
  array (
  ),
  '中国证券业' => 
  array (
  ),
  '各国证券业' => 
  array (
  ),
  '保险学理论' => 
  array (
  ),
  '世界保险业' => 
  array (
  ),
  '中国保险业' => 
  array (
  ),
  '各国保险业' => 
  array (
  ),
  '投资理论与实践' => 
  array (
  ),
  '证券' => 
  array (
    0 => '证券学理论',
    1 => '世界证券业',
    2 => '中国证券业',
    3 => '各国证券业',
  ),
  '房地产' => 
  array (
  ),
  '信托' => 
  array (
  ),
  '期货、期权' => 
  array (
  ),
  '银行信贷' => 
  array (
  ),
  '保险' => 
  array (
    0 => '保险学理论',
    1 => '世界保险业',
    2 => '中国保险业',
    3 => '各国保险业',
  ),
  '区域投资市场' => 
  array (
  ),
  '港、澳、台投资市场' => 
  array (
  ),
  '世界各国投资' => 
  array (
  ),
  '中外合作与外资利用' => 
  array (
  ),
  '投资基金' => 
  array (
  ),
  '有关投资的法律、法规、政策' => 
  array (
  ),
  '会计学' => 
  array (
  ),
  '会计簿记方法' => 
  array (
  ),
  '会计设备' => 
  array (
  ),
  '会计工作组织与制度' => 
  array (
  ),
  '社会会计' => 
  array (
  ),
  '成本会计' => 
  array (
  ),
  '管理会计' => 
  array (
  ),
  '财务会计' => 
  array (
  ),
  '其它(含国际会计)' => 
  array (
  ),
  '各部门会计和簿记' => 
  array (
  ),
  '总论(审计理论)' => 
  array (
  ),
  '审计方法与技术' => 
  array (
  ),
  '审计工作组织与制度' => 
  array (
  ),
  '各类审计' => 
  array (
  ),
  '专业审计' => 
  array (
  ),
  '审计法' => 
  array (
  ),
  '市场理论与研究' => 
  array (
  ),
  '农业产品与市场' => 
  array (
  ),
  '工业产品与市场' => 
  array (
  ),
  '管理学' => 
  array (
    0 => '管理技术与方法',
    1 => '咨询学',
    2 => '管理计划和控制',
    3 => '管理组织学',
    4 => '应用管理学',
  ),
  '管理技术与方法' => 
  array (
  ),
  '咨询学' => 
  array (
  ),
  '管理计划和控制' => 
  array (
  ),
  '管理组织学' => 
  array (
  ),
  '应用管理学' => 
  array (
  ),
  '领导学' => 
  array (
  ),
  '决策学' => 
  array (
  ),
  '科学学' => 
  array (
  ),
  '世界科技事业' => 
  array (
  ),
  '中国科技事业' => 
  array (
  ),
  '自然科学理论与方法' => 
  array (
    0 => '自然科学研究的方针政策',
    1 => '自然科学理论与方法论',
    2 => '自然科学现状及发展',
    3 => '自然科学研究及自然科学史',
  ),
  '自然科学理论与方法论' => 
  array (
    0 => '科学的哲学原理',
    1 => '科学的方法论',
  ),
  '各科教学法、教学参考书、辅导用书' => 
  array (
    0 => '数学',
    1 => '语文',
    2 => '政治、外语',
    3 => '物理、化学',
    4 => '历史、地理',
    5 => '其他各科及教学法',
  ),
  '数学概论' => 
  array (
    0 => '数学范畴',
    1 => '数学理论',
    2 => '计算工具',
  ),
  '古典数学' => 
  array (
    0 => '古典数学总述',
    1 => '中国古典数学',
    2 => '各国古典数学',
  ),
  '初、高等数学' => 
  array (
    0 => '高等数学',
    1 => '初等数学',
  ),
  '初等数学' => 
  array (
    0 => '算术',
    1 => '初等代数',
    2 => '初等几何',
    3 => '三角',
  ),
  '各种会计和簿记' => 
  array (
    0 => '总论',
    1 => '社会会计',
    2 => '成本会计',
    3 => '管理会计',
    4 => '财务会计',
    5 => '其它(含国际会计)',
  ),
  '数理逻辑、数学基础' => 
  array (
    0 => '数理逻辑(符号逻辑)',
    1 => '应用数理逻辑',
    2 => '数学基础',
    3 => '集合论',
  ),
  '代数、数论、组合理论' => 
  array (
    0 => '代数方程论、线性代数',
    1 => '群论',
    2 => '抽象代数(近世代数)',
    3 => '范畴论、同调代数',
    4 => '微分代数、差分代数',
    5 => '数论',
    6 => '组合数学',
    7 => '离散数学',
    8 => '模糊数学',
  ),
  '数学分析' => 
  array (
    0 => '数学分析与应用',
    1 => '分析基础',
    2 => '微积分',
    3 => '无穷级数论(级数论)',
    4 => '函数论',
    5 => '微分方程、积分方程',
    6 => '变分法',
    7 => '泛函分析',
    8 => '不等式及其他',
  ),
  '轻工业手工业' => 
  array (
    0 => '概述',
    1 => '造纸工业',
    2 => '纺织工业、染整工业',
    3 => '食品工业',
    4 => '制盐工业',
    5 => '烟草工业',
    6 => '皮革工业',
    7 => '木材加工工业、家具制造工业',
    8 => '印刷工业',
    9 => '五金制品工业',
    10 => '工艺美术制品工业',
    11 => '服装工业、制鞋工业',
    12 => '其他轻工业、手工业',
    13 => '轻工业废物处理与综合利用',
  ),
  '几何、拓扑' => 
  array (
    0 => '几何基础(几何学原理)',
    1 => '解析几何',
    2 => '向量(矢量)和张量分析',
    3 => '非欧几何、多维空间几何',
    4 => '射影(投影)几何、画法几何',
    5 => '微分几何、积分几何',
    6 => '代数几何',
    7 => '拓扑(形势几何学)',
  ),
  '运筹学' => 
  array (
    0 => '运筹学与应用',
    1 => '规划论',
    2 => '统筹方法',
    3 => '最优化的数学理论',
    4 => '对策论(博弈论)',
    5 => '排队论(随机服务系统)',
    6 => '库存论',
    7 => '更新理论',
    8 => '搜索理论',
  ),
  '控制论、信息论(数学理论)' => 
  array (
    0 => '控制论、信息论及其应用',
    1 => '控制论',
    2 => '最优控制',
    3 => '逻辑网络理论',
    4 => '学习机理论',
    5 => '模式识别理论',
  ),
  '计算数学' => 
  array (
    0 => '计算数学概述',
    1 => '数值计算的理论与方法',
    2 => '数学模拟、近似计算',
    3 => '数值软件',
  ),
  '工程基础科学' => 
  array (
    0 => '工程数学',
    1 => '工程地质学',
    2 => '工程基础科学概论',
    3 => '工程力学',
    4 => '工程化学',
    5 => '工程天文学、工程仿生学、人体工程学',
    6 => '工程物理学',
  ),
  '应用数学' => 
  array (
    0 => '统计学',
    1 => '经济数学方法',
  ),
  '非线性科学与系统科学' => 
  array (
    0 => '非线性科学',
    1 => '系统科学',
  ),
  '系统科学' => 
  array (
    0 => '系统哲学',
    1 => '系统学、现代系统理论',
    2 => '系统工程',
    3 => '系统科学在各方面的应用',
  ),
  '力学' => 
  array (
    0 => '力学概论',
    1 => '理论力学(一般力学)',
    2 => '振动理论',
    3 => '连续介质力学(变形体力学)',
    4 => '固体力学',
    5 => '流变学',
    6 => '爆炸力学',
    7 => '应用力学',
  ),
  '力学概论' => 
  array (
    0 => '牛顿定律、达朗伯原理',
    1 => '力学中的数学方法',
    2 => '量纲分析与相似理论',
  ),
  '理论力学(一般力学)' => 
  array (
    0 => '运动学',
    1 => '静力学',
    2 => '动力学',
    3 => '引力理论',
    4 => '弹道学',
    5 => '分析力学(解析力学)',
    6 => '稳定性理论',
    7 => '陀螺力学(回转仪理论)',
  ),
  '材料科学基础' => 
  array (
    0 => '材料力学',
    1 => '材料一般性问题',
    2 => '材料试验',
  ),
  '固体力学' => 
  array (
    0 => '弹性力学',
    1 => '塑性力学',
    2 => '粘弹塑性介质力学',
    3 => '强度理论',
    4 => '变形固体动力学',
    5 => '实验应力分析',
  ),
  '爆炸力学' => 
  array (
    0 => '爆震理论',
    1 => '爆震波的传播',
    2 => '爆炸波与物体的相互作用',
    3 => '爆炸波的观测技术',
    4 => '穿甲理论',
    5 => '应用爆炸力学',
  ),
  '物理学' => 
  array (
    0 => '物理学总论',
    1 => '物理学现状、概况',
    2 => '物理学实验方法与设备',
    3 => '物理测量',
    4 => '理论物理学',
    5 => '声学',
    6 => '光学',
    7 => '电磁学、电动力学',
    8 => '无线电物理学',
    9 => '真空电子学(电子物理学)',
    10 => '半导体物理学',
    11 => '固体物理学',
    12 => '低温物理学',
    13 => '高压与高温物理学',
    14 => '等离子体物理学',
    15 => '热学与物质分子运动论',
    16 => '分子物理学、原子物理学',
    17 => '原子核物理学、高能物理学',
    18 => '应用物理学',
  ),
  '自动化技术及设备' => 
  array (
    0 => '一般性问题',
    1 => '自动化元件、部件',
    2 => '自动化装置与设备',
    3 => '机器人技术',
    4 => '自动化系统',
    5 => '自动化技术在各方面的应用',
  ),
  '理论物理学' => 
  array (
    0 => '物理学的数学方法',
    1 => '相对论、场论',
    2 => '量子论',
    3 => '热力学与统计物理学',
    4 => '非线性物理学',
  ),
  '光学' => 
  array (
    0 => '光本性理论',
    1 => '光辐射、光度学、色度学',
    2 => '光谱学',
    3 => 'X射线、紫外线、红外线',
    4 => '几何光学',
    5 => '物理光学',
    6 => '波导光学及集成光学',
    7 => '非线性光学(强光与物质的作用)',
    8 => '信息光学',
    9 => '应用光学',
    10 => '激光原理及激光器研究',
    11 => '量子光学',
  ),
  '电磁学、电动力学' => 
  array (
    0 => '电磁学',
    1 => '电动力学',
  ),
  '真空电子学(电子物理学)' => 
  array (
    0 => '气体放电(气体导电)',
    1 => '阴极电子学',
    2 => '带电粒子光学',
  ),
  '半导体物理学' => 
  array (
    0 => '半导体性质',
    1 => '非平衡载流子',
    2 => '杂质和缺陷',
    3 => 'P-N结',
  ),
  '固体物理学' => 
  array (
    0 => '固体理论',
    1 => '固体性质',
    2 => '固体缺陷',
    3 => '薄膜物理学',
  ),
  '化学' => 
  array (
    0 => '晶体学',
    1 => '物理化学(理论化学)、化学物理学',
    2 => '分析化学',
    3 => '应用化学',
  ),
  '低温物理学' => 
  array (
    0 => '超导电性',
    1 => '超流性、低温物性',
    2 => '低温物理实验技术',
    3 => '超低温(小于1K)的获得',
  ),
  '等离子体物理学' => 
  array (
    0 => '综述',
    1 => '约束与加热',
    2 => '湍流',
    3 => '波与不稳定性',
    4 => '激震波(骇波)',
    5 => '辐射与测量(诊断技术)',
    6 => '等离子体物理的应用',
  ),
  '热学与物质分子运动论' => 
  array (
    0 => '热学',
    1 => '物质分子运动论',
  ),
  '分子物理学、原子物理学' => 
  array (
    0 => '分子物理学',
    1 => '原子物理学',
    2 => '介分子与μ分子',
    3 => '介原子与μ原子',
    4 => '电子偶素与μ子素',
  ),
  '原子核物理学、高能物理学' => 
  array (
    0 => '原子核物理学',
    1 => '高能物理学',
    2 => '波谱学、能谱学',
  ),
  '生理学' => 
  array (
    0 => '普通生理学',
    1 => '家畜生理学',
  ),
  '基础医学' => 
  array (
    0 => '人体生理学',
    1 => '医学免疫学',
    2 => '医学微生物学',
    3 => '人体形态学',
    4 => '实验医学',
    5 => '医用一般科学（医用数学、物理学、化学等）',
    6 => '医学生物化学与分子生物学',
    7 => '医学生物物理学',
    8 => '病理学',
    9 => '医学寄生虫学',
    10 => '医学遗传学',
    11 => '医学心理学、病理心理学',
  ),
  '生物化学' => 
  array (
    0 => '蛋白质、核酸',
    1 => '酶',
    2 => '糖、脂类',
    3 => '维生素、激素、生物体其他化学成份',
    4 => '物质代谢和能量代谢',
    5 => '其他生物化学',
  ),
  '生物工程学' => 
  array (
    0 => '仿生学',
    1 => '生物工程学其它方面的研究与应用',
  ),
  '医药卫生科技' => 
  array (
    0 => '生物医学工程',
    1 => '医药卫生方针政策与法律法规研究',
    2 => '医学教育与医学边缘学科',
    3 => '预防医学与卫生学',
    4 => '中医学',
    5 => '中药学',
    6 => '中西医结合',
    7 => '基础医学',
    8 => '临床医学',
    9 => '感染性疾病及传染病',
    10 => '心血管系统疾病',
    11 => '呼吸系统疾病',
    12 => '消化系统疾病',
    13 => '内分泌腺及全身性疾病',
    14 => '外科学',
    15 => '泌尿科学',
    16 => '妇产科学',
    17 => '儿科学',
    18 => '神经病学',
    19 => '精神病学',
    20 => '肿瘤学',
    21 => '眼科与耳鼻咽喉科',
    22 => '口腔科学',
    23 => '皮肤病与性病',
    24 => '特种医学',
    25 => '急救医学',
    26 => '军事医学与卫生',
    27 => '药学',
  ),
  '环境科学' => 
  array (
    0 => '环境生物学',
    1 => '环境保护政策法令、标准、教育',
    2 => '环境数学',
    3 => '环境物理学',
    4 => '环境化学',
    5 => '环境地学',
    6 => '环境气象学、环境空气动力学',
    7 => '环境医学、环境心理学、环境系统学、环境经济学',
  ),
  '地质学' => 
  array (
    0 => '古生物学',
    1 => '地质工作及地质经济',
    2 => '地质灾害及灾害地质学',
    3 => '矿物学',
    4 => '岩石学',
    5 => '历史地质学、地层学',
    6 => '动力地质学',
    7 => '构造地质学',
    8 => '地质力学',
    9 => '区域地质学',
    10 => '矿床学',
    11 => '地球化学',
    12 => '普查勘探地质学',
    13 => '宇宙地质学',
    14 => '海洋地质学',
    15 => '水文地质学与工程地质学',
    16 => '环境地质学',
    17 => '地质勘查仪器及设备',
  ),
  '微生物学理论及其应用' => 
  array (
    0 => '普通微生物学',
    1 => '病毒学',
    2 => '免疫学',
    3 => '家畜微生物学',
    4 => '农业、土壤微生物学、工业微生物学、腐蚀微生物学及其它应用微生物学',
  ),
  '免疫学' => 
  array (
    0 => '家畜免疫学',
  ),
  '植物学' => 
  array (
    0 => '植物学研究、实验与植物演化、发展',
    1 => '植物细胞学与植物遗传学、植物形态学',
    2 => '植物生理学',
    3 => '植物生物化学、植物生物物理学',
    4 => '植物生态学和植物地理学',
    5 => '植物分类学',
    6 => '应用植物学',
  ),
  '动物学' => 
  array (
    0 => '动物学的研究与实验、动物演化与发展',
    1 => '动物细胞学、遗传学及形态学',
    2 => '动物生态学和动物地理学',
    3 => '动物分类学',
    4 => '应用动物学',
  ),
  '昆虫学' => 
  array (
    0 => '昆虫生物学',
    1 => '昆虫分类学',
    2 => '应用昆虫学',
  ),
  '人类学' => 
  array (
    0 => '分子人类学及人类遗传学',
    1 => '体质人类学与人体测量学',
    2 => '社会人类学、环境优生学和人类生态学',
  ),
  '天文学' => 
  array (
    0 => '天文观测设备与观测资料',
    1 => '天体测量学',
    2 => '天体力学(理论天文学)',
    3 => '天体物理学',
    4 => '恒星天文学、星系天文学、宇宙学',
    5 => '射电天文学(无线电天文学)',
    6 => '空间天文学',
    7 => '太阳系',
    8 => '时间、历法',
  ),
  '自然地理学和测绘学' => 
  array (
    0 => '自然地理学',
    1 => '测绘学',
  ),
  '针灸' => 
  array (
    0 => '一般理论与方法',
    1 => '针灸疗法的临床应用',
  ),
  '自然地理学' => 
  array (
    0 => '地貌学',
    1 => '区域自然地理学',
    2 => '应用及分类地理学',
  ),
  '应用及分类地理学' => 
  array (
    0 => '生物地理学',
    1 => '环境地理学',
    2 => '其他应用地理学',
  ),
  '农艺学' => 
  array (
    0 => '土壤学',
    1 => '作物生物学原理和栽培技术与方法',
    2 => '播种、栽植与田间管理',
    3 => '农业化学与肥料学',
    4 => '农产品收获、加工、贮藏及综合利用',
  ),
  '测绘学' => 
  array (
    0 => '普通测量学、地形测量学',
    1 => '大地测量学',
    2 => '摄影测量学与测绘遥感',
    3 => '地籍学',
    4 => '地图学及制图学',
    5 => '测绘仪器及使用',
    6 => '工程测量学、专业测绘',
  ),
  '气象学' => 
  array (
    0 => '气象工作及气象经济',
    1 => '气象基础科学',
    2 => '大气探测(气象观测)',
    3 => '气象要素及大气现象',
    4 => '动力气象学',
    5 => '天气学',
    6 => '天气预报',
    7 => '气候学',
    8 => '气象灾害学',
    9 => '应用气象学',
    10 => '气象设备仪器制造、使用',
    11 => '人工影响天气',
  ),
  '地球物理学' => 
  array (
    0 => '海洋地球物理学',
    1 => '一般理论',
    2 => '地球起源及演化',
    3 => '地球形状学及地球结构',
    4 => '地球重力学',
    5 => '大地构造物理学、岩组学(构造岩石学)',
    6 => '地热学、火山学',
    7 => '地磁学',
    8 => '地电学',
    9 => '水文学',
    10 => '空间物理',
    11 => '地震地球物理学',
    12 => '勘查地球物理学',
    13 => '工程及水文地球物理勘探',
    14 => '地球物理勘测仪器',
  ),
  '地质工作及地质经济' => 
  array (
    0 => '总论及地质管理学',
    1 => '地质经济学',
  ),
  '地质灾害及灾害地质学' => 
  array (
    0 => '岩溶地质学',
    1 => '地震灾害及地震地质学',
    2 => '动力地质灾害及灾害地质学',
    3 => '火山学',
    4 => '冻土学',
    5 => '海洋地质灾害',
  ),
  '矿物学' => 
  array (
    0 => '矿物分类',
    1 => '宝石学',
  ),
  '岩石学' => 
  array (
    0 => '岩浆岩(火成岩)',
    1 => '沉积岩',
    2 => '变质岩',
  ),
  '历史地质学、地层学' => 
  array (
    0 => '古地理学及古气候学',
    1 => '各时代地史及地层学',
  ),
  '矿床学' => 
  array (
    0 => '金属矿床',
    1 => '非金属矿床',
    2 => '煤田地质学',
    3 => '油气地质学',
  ),
  '普查勘探地质学' => 
  array (
    0 => '遥感勘探',
    1 => '地质普查与地质测量',
    2 => '地球物理勘探',
    3 => '地球化学勘探',
    4 => '地质勘探',
    5 => '数学勘探',
    6 => '同位素勘探',
  ),
  '矿山测量与勘测工程学' => 
  array (
    0 => '勘探工程学',
    1 => '勘探技术方法',
    2 => '矿山测量与制图',
    3 => '矿山测量勘探设备与仪器',
  ),
  '水文地质学与工程地质学' => 
  array (
    0 => '水文地质学(地下水水文学)',
  ),
  '地质勘查仪器及设备' => 
  array (
    0 => '地质勘探仪器',
    1 => '钻探设备',
  ),
  '水文学' => 
  array (
    0 => '水文调查、观测、实验分析',
    1 => '水文物理与化学',
    2 => '水文预报',
    3 => '陆地水文学、水文地理学',
    4 => '冰雪水文学',
    5 => '河流水文学及湖泊学',
    6 => '水力学及河流动力学',
    7 => '应用水文学',
    8 => '水文观测仪器设备',
  ),
  '资源科学' => 
  array (
    0 => '资源管理与利用',
    1 => '各种资源的开发与利用',
  ),
  '资源管理与利用' => 
  array (
    0 => '资源经济学',
    1 => '资源地理学',
    2 => '资源法',
    3 => '资源合理利用、管理与保护技术',
  ),
  '各种资源的开发与利用' => 
  array (
    0 => '土地资源',
    1 => '水资源',
    2 => '农业资源',
    3 => '生物资源',
    4 => '矿产资源',
    5 => '能源资源',
    6 => '海洋资源',
    7 => '森林资源',
  ),
  '旅游' => 
  array (
    0 => '旅游资源',
    1 => '旅游经济理论与方法',
    2 => '旅游事业',
    3 => '旅游文化',
    4 => '旅游商品',
    5 => '旅游房产',
    6 => '旅游与商业',
    7 => '旅游标准、旅游投诉',
  ),
  '工程科技Ⅰ辑' => 
  array (
    0 => '化学',
    1 => '无机化工',
    2 => '有机化工',
    3 => '燃料化工',
    4 => '一般化学工业',
    5 => '石油天然气工业',
    6 => '材料科学',
    7 => '矿业工程',
    8 => '金属学及金属工艺',
    9 => '轻工业手工业',
    10 => '一般服务业',
    11 => '安全科学与灾害防治',
    12 => '环境科学与资源利用',
  ),
  '无机化工' => 
  array (
    0 => '无机化学',
    1 => '基本无机化学工业',
    2 => '非金属元素及其无机化合物化学工业',
    3 => '金属元素的无机化合物化学工业',
    4 => '电化学工业',
    5 => '电热工业、高温制品工业',
    6 => '硅酸盐工业',
  ),
  '有机化学、高分子化学' => 
  array (
    0 => '有机化学',
    1 => '高分子化学(高聚物)',
  ),
  '物理化学(理论化学)、化学物理学' => 
  array (
    0 => '结构化学',
    1 => '化学热力学、热化学、热力学平衡',
    2 => '化学动力学、催化作用',
    3 => '光化学、辐射化学、超声波作用的化学过程',
    4 => '溶液',
    5 => '电化学、电解、磁化学',
    6 => '表面现象的物理化学',
    7 => '胶体化学(分散体系的物理化学)',
    8 => '半导体化学',
  ),
  '分析化学' => 
  array (
    0 => '分析化学基础理论',
    1 => '分析作业方法与技术',
    2 => '无机分析',
    3 => '有机分析',
    4 => '仪器分析法总论及电化学仪器分析法',
    5 => '磁化学分析法',
    6 => '光化学分析法(光谱分析法)',
    7 => '放射化学分析法、活化分析',
    8 => '超声波分析法',
    9 => '质谱分析',
    10 => '色谱分析',
    11 => '其他物理及物理化学分析法',
    12 => '元素及化合物的分离方法',
    13 => '气体分析、液体分析、水分析',
  ),
  '有机化工' => 
  array (
    0 => '化学工业一般性问题',
    1 => '有机化学、高分子化学',
    2 => '基本有机化学工业',
    3 => '高分子化合物工业(高聚物工业)',
    4 => '溶剂、增塑剂、试剂与纯化学品的生产',
    5 => '胶粘剂工业',
    6 => '化学肥料工业、农药工业',
    7 => '制药化学工业',
  ),
  '放射医学' => 
  array (
    0 => '基础理论',
    1 => 'X线诊断学',
    2 => '各种及各科疾病的X线诊断与治疗',
    3 => '放射性同位素检查与治疗',
    4 => '放射线学',
    5 => 'X线解剖学',
    6 => '介入放射学',
    7 => '放射病、放射损伤',
    8 => '放射同位素在医学上的应用',
  ),
  '化学工业一般性问题' => 
  array (
    0 => '化学反应过程',
    1 => '化工原料、辅助物料',
    2 => '化工机械与仪器、设备',
    3 => '化工生产过程、化工产品与副产品',
    4 => '化工厂',
    5 => '无机化学工业废物处理与综合利用',
    6 => '化学工业经济',
    7 => '化工过程(物理过程及物理化学过程)',
    8 => '化工原料辅助物料',
    9 => '有机化学工业废物的处理与综合利用',
  ),
  '硅酸盐工业' => 
  array (
    0 => '玻璃工业',
    1 => '水泥工业',
    2 => '搪瓷、石棉工业',
    3 => '陶瓷工业',
    4 => '耐火材料工业',
    5 => '人造石及其他胶凝材料',
  ),
  '基本有机化学工业' => 
  array (
    0 => '脂肪族化合物(无环化合物)的生产',
    1 => '碳环化合物、脂环族化合物的生产',
    2 => '芳香族化合物的生产',
    3 => '杂环化合物的生产',
    4 => '其它有机化合物的生产',
  ),
  '高分子化合物工业(高聚物工业)' => 
  array (
    0 => '总述',
    1 => '合成树脂与塑料工业',
    2 => '橡胶工业',
    3 => '化学纤维工业',
    4 => '纤维素质的化学加工工业',
  ),
  '总述' => 
  array (
    0 => '原料与辅助物料',
    1 => '机械与设备',
    2 => '生产过程',
    3 => '高分子化合物产品',
    4 => '高分子化合物工厂',
  ),
  '实验医学' => 
  array (
    0 => '一般问题',
    1 => '实验方法与设备',
    2 => '医用实验动物学',
  ),
  '合成树脂与塑料工业' => 
  array (
    0 => '天然高分子树脂与塑料',
    1 => '合成树脂及塑料',
    2 => '缩聚类树脂及塑料',
    3 => '特种塑料',
    4 => '聚合类树脂与塑料',
    5 => '增强塑料、填充塑料',
    6 => '泡沫塑料',
  ),
  '橡胶工业' => 
  array (
    0 => '胶乳',
    1 => '天然橡胶',
    2 => '合成橡胶',
    3 => '热塑弹性体',
    4 => '再生橡胶',
    5 => '橡胶制品',
    6 => '胶乳制品及其他制品',
  ),
  '化学纤维工业' => 
  array (
    0 => '再生纤维',
    1 => '合成纤维',
    2 => '无机纤维',
  ),
  '纤维素质的化学加工工业' => 
  array (
    0 => '木材化学加工工业',
    1 => '纤维素化学加工工业',
    2 => '植物纤维水解工业',
  ),
  '溶剂、增塑剂、试剂与纯化学品的生产' => 
  array (
    0 => '溶剂与增塑剂的生产',
    1 => '试剂与纯化学品的生产',
  ),
  '试剂与纯化学品的生产' => 
  array (
    0 => '一般性问题与试剂及光化学物质',
    1 => '表面活性剂',
    2 => '吸附剂',
    3 => '离子交换剂',
    4 => '催化剂(触媒)',
    5 => '胶体与半胶体物质',
  ),
  '化学肥料工业、农药工业' => 
  array (
    0 => '化学肥料工业',
  ),
  '农药防治(化学防治)' => 
  array (
    0 => '农药工业',
    1 => '植物化学保护理论',
    2 => '杀菌剂',
    3 => '杀虫剂',
    4 => '除草剂',
    5 => '其他化学农药',
  ),
  '制药化学工业' => 
  array (
    0 => '中草药制剂的生产',
    1 => '无机化合物药物及生物制品药物的生产',
  ),
  '燃料化工' => 
  array (
    0 => '燃料化学工业',
    1 => '炼焦化学工业',
    2 => '煤化学及煤的加工利用',
    3 => '煤炭气化工业',
    4 => '燃料照明工业',
    5 => '爆炸物工业、火柴工业',
    6 => '石油、天然气化学工业',
  ),
  '煤化学及煤的加工利用' => 
  array (
    0 => '煤化学基础理论',
    1 => '煤的性质与测定',
    2 => '煤的燃烧',
    3 => '煤的加工利用',
  ),
  '爆炸物工业、火柴工业' => 
  array (
    0 => '爆炸物工业',
    1 => '航天用燃料',
  ),
  '油气加工工程' => 
  array (
    0 => '石油炼制',
    1 => '天然气加工',
    2 => '石油化学工业',
    3 => '人造石油',
    4 => '油气加工厂',
    5 => '油气加工厂机械设备',
  ),
  '一般化学工业' => 
  array (
    0 => '染料及颜料工业',
    1 => '涂料工业',
    2 => '油脂和蜡的化学加工工业、肥皂工业',
    3 => '香料及化妆品工业',
    4 => '感光材料工业',
    5 => '磁性记录材料工业',
  ),
  '染料及颜料工业' => 
  array (
    0 => '染料及中间体工业',
    1 => '颜料工业',
  ),
  '涂料工业' => 
  array (
    0 => '各种涂料',
    1 => '涂料的施工',
  ),
  '油脂和蜡的化学加工工业、肥皂工业' => 
  array (
    0 => '油脂和蜡工业',
    1 => '肥皂工业',
    2 => '合成洗涤剂工业',
  ),
  '食品工业' => 
  array (
    0 => '食用油脂加工工业',
    1 => '粮食加工工业',
    2 => '淀粉工业',
    3 => '制糖工业',
    4 => '屠宰及肉类加工工业',
    5 => '乳品加工工业',
    6 => '蛋品加工工业',
    7 => '水产加工工业',
    8 => '水果、蔬菜、坚果加工工业',
    9 => '酿造工业',
    10 => '饮料冷食制造工业',
    11 => '罐头工业',
    12 => '保健食品',
  ),
  '感光材料工业' => 
  array (
    0 => '感光理论',
    1 => '原料及辅助物料、机械与设备',
    2 => '生产工艺',
    3 => '感光材料',
  ),
  '石油天然气工业' => 
  array (
    0 => '石油勘探与开采工程',
    1 => '油气加工工程',
    2 => '油气储运工程',
    3 => '油气工程环境保护与综合利用',
    4 => '油气机械设备的腐蚀与防护',
  ),
  '石油勘探与开采工程' => 
  array (
    0 => '油气勘探',
    1 => '油气钻井工程',
    2 => '油气开采工程',
    3 => '油页岩、地下煤气开采工程',
    4 => '油气勘探开采机械、仪器与设备',
  ),
  '油气储运工程' => 
  array (
    0 => '矿场油气集输与处理',
    1 => '油气输送与运输',
    2 => '油气储存工程',
    3 => '油气储运安全技术',
    4 => '油气储运机械设备制造及应用',
  ),
  '材料科学' => 
  array (
    0 => '材料科学基础',
    1 => '复合材料',
    2 => '功能材料',
    3 => '耐高温材料、耐低温材料',
    4 => '耐腐蚀材料',
    5 => '智能材料',
    6 => '特种结构材料',
    7 => '仿生材料',
    8 => '超导材料',
    9 => '其他材料',
  ),
  '建筑材料' => 
  array (
    0 => '金属材料',
    1 => '非金属材料',
    2 => '建筑材料一般性问题',
    3 => '有机材料、建筑化工材料',
    4 => '耐高温材料(耐火材料)、防火材料',
    5 => '隔热、隔(吸)声材料',
    6 => '建筑涂料、装饰材料',
    7 => '防水、防潮材料，嵌缝、密封材料',
    8 => '粘结料',
    9 => '其他特种材料',
  ),
  '特种结构材料' => 
  array (
    0 => '纳米材料',
    1 => '薄膜材料',
    2 => '粉体材料',
    3 => '其他特种结构材料',
  ),
  '矿业工程' => 
  array (
    0 => '矿山测量与勘测工程学',
    1 => '矿山开采工程学',
    2 => '矿山运输与设备',
    3 => '矿山安全与劳动保护',
    4 => '矿山电工',
    5 => '选矿',
    6 => '矿业工程三废处理及矿产综合利用',
  ),
  '矿山开采工程学' => 
  array (
    0 => '矿山设计与地面建设',
    1 => '凿岩爆破工程',
    2 => '井巷工程',
    3 => '支护工程与设备',
    4 => '各类矿产开采工程学',
    5 => '采掘机械',
  ),
  '各类矿产开采工程学' => 
  array (
    0 => '煤矿及油页岩开采',
    1 => '煤及油页岩地下气化',
    2 => '金属矿产开采',
    3 => '非金属矿产开采',
  ),
  '矿山安全与劳动保护' => 
  array (
    0 => '矿山安全与卫生保护',
    1 => '通风工程',
    2 => '矿井大气',
    3 => '防火、排水工程',
  ),
  '矿山电工' => 
  array (
    0 => '矿山供电及自动化工程',
    1 => '矿山通讯及照明工程',
  ),
  '选矿' => 
  array (
    0 => '选矿理论',
    1 => '选矿流程及方法',
    2 => '各类矿产选矿工艺学',
    3 => '选矿厂',
    4 => '选矿机械设备及器材',
  ),
  '各类矿产选矿工艺学' => 
  array (
    0 => '选煤',
    1 => '金属矿选矿',
    2 => '非金属矿选矿',
  ),
  '矿业工程三废处理及矿产综合利用' => 
  array (
    0 => '矿产资源综合利用',
    1 => '矿业工程三废处理',
  ),
  '金属学及金属工艺' => 
  array (
    0 => '金属学总论',
    1 => '合金学与各种性质合金',
    2 => '热处理',
    3 => '金属腐蚀与保护、金属表面处理',
    4 => '铸造',
    5 => '金属压力加工',
    6 => '焊接、金属切割及金属粘接',
    7 => '金属切削加工及机床',
    8 => '刀具、磨料、磨具、夹具、模具、手工具',
    9 => '公差与技术测量及机械量仪',
    10 => '钳工工艺与装配工艺',
  ),
  '金属学总论' => 
  array (
    0 => '金属学（物理冶金）一般问题',
    1 => '金属物理学',
    2 => '金属的组织与性能',
    3 => '金属的分析试验',
  ),
  '铸造' => 
  array (
    0 => '铸造理论',
    1 => '铸造原材料及配制',
    2 => '铸造机械设备',
    3 => '铸造工艺',
    4 => '特种铸造',
    5 => '铸铁件铸造',
    6 => '钢件铸造',
    7 => '合金铸造',
    8 => '铸造车间(厂)',
    9 => '有色金属铸造',
  ),
  '金属压力加工' => 
  array (
    0 => '锻造、锻压与锻工',
    1 => '轧制',
    2 => '拉制、拉拔',
    3 => '挤压',
    4 => '冷冲床(钣金加工)',
    5 => '高能成型',
  ),
  '焊接、金属切割及金属粘接' => 
  array (
    0 => '焊接一般性问题',
    1 => '焊接材料',
    2 => '焊接设备',
    3 => '焊接工艺',
    4 => '焊接的应用',
    5 => '金属切割及设备',
    6 => '粘接、胶接',
  ),
  '金属切削加工及机床' => 
  array (
    0 => '车削加工及车床(旋床)',
    1 => '钻削加工及钻床',
    2 => '镗削加工及镗床',
    3 => '铣削加工及铣床',
    4 => '刨削加工、刨床与插床(立刨)',
    5 => '锯削加工与锯床、锉床',
    6 => '拉削加工与拉床',
    7 => '磨削加工与磨床',
    8 => '齿轮加工及齿轮机床',
    9 => '螺纹加工及螺纹加工机床',
    10 => '刻线加工及刻线机',
    11 => '仪表加工及仪表机床',
    12 => '组合机床及其加工',
    13 => '程序控制机床、数控机床及其加工',
    14 => '特种加工机床及其加工',
    15 => '机床加工生产自动化',
  ),
  '刀具、磨料、磨具、夹具、模具、手工具' => 
  array (
    0 => '刀具',
    1 => '磨料',
    2 => '磨具、研具',
    3 => '夹具',
    4 => '模具',
    5 => '手工具',
  ),
  '公差与技术测量及机械量仪' => 
  array (
    0 => '长度测量及其量仪',
    1 => '角度测量及其量仪',
    2 => '形位偏差测量及其量仪',
    3 => '表面光洁度(表面粗糙度)的测量及其量仪',
    4 => '螺纹测量与其量仪',
    5 => '齿轮测量及其量仪',
    6 => '自动量仪',
  ),
  '冶金一般性问题' => 
  array (
    0 => '冶金原理',
    1 => '冶炼计算',
    2 => '冶炼试验与分析',
    3 => '冶炼原料及矿石预处理',
    4 => '冶金燃料与燃烧',
    5 => '冶金炉',
    6 => '冶金工厂',
    7 => '冶金工业废物处理与综合利用',
  ),
  '冶金技术' => 
  array (
    0 => '提炼冶金',
    1 => '粉末冶金',
    2 => '真空冶金',
    3 => '电渣重熔',
    4 => '原子能冶金',
    5 => '纤维冶金',
    6 => '卤素冶金',
    7 => '微生物冶金',
    8 => '其他冶金技术',
  ),
  '冶金机械、冶金生产自动化' => 
  array (
    0 => '钢铁冶炼机械与生产自动化',
    1 => '炼铁机械与生产自动化',
    2 => '铁合金冶炼机械与自动化',
    3 => '炼钢机械与生产自动化',
    4 => '有色冶金机械与生产自动化',
    5 => '粉末冶金机械与生产自动化',
  ),
  '炼铁' => 
  array (
    0 => '理论与计算',
    1 => '原材料',
    2 => '高炉熔冶过程',
    3 => '高炉操作',
    4 => '铁矿石直接还原',
    5 => '其他炼铁法',
    6 => '炼铁炉(高炉)',
    7 => '炼铁厂',
    8 => '炼铁产品',
  ),
  '炼钢' => 
  array (
    0 => '转炉炼钢',
    1 => '氧气转炉炼钢',
    2 => '平炉炼钢',
    3 => '电炉炼钢',
    4 => '混合炼钢',
    5 => '其他炼钢法',
    6 => '早期炼钢法',
    7 => '炼钢炉',
    8 => '炼钢厂',
    9 => '各种钢的冶炼',
    10 => '钢液二次精炼和炉外处理',
    11 => '铸锭',
  ),
  '有色金属冶炼' => 
  array (
    0 => '重金属冶炼',
    1 => '轻金属冶炼',
    2 => '贵金属及铂族金属冶炼',
    3 => '稀有金属冶炼',
  ),
  '纺织工业、染整工业' => 
  array (
    0 => '棉纺织',
    1 => '麻纺织',
    2 => '毛纺织',
    3 => '丝纺织',
    4 => '化学纤维纺织',
    5 => '非织造布',
    6 => '针织',
    7 => '染整工业',
  ),
  '一般服务业' => 
  array (
    0 => '美食学',
    1 => '烹饪法、食谱、菜谱',
    2 => '饮食设备及管理',
    3 => '洗染、缝补',
    4 => '美容、沐浴、清洁',
    5 => '居住管理',
    6 => '家庭管理、家庭生活、家庭服务',
  ),
  '安全科学与灾害防治' => 
  array (
    0 => '劳动保护基础理论',
    1 => '劳动保护管理',
    2 => '安全工程',
    3 => '劳动卫生工程',
    4 => '灾害及其防治',
  ),
  '安全工程' => 
  array (
    0 => '总论工业安全',
    1 => '爆炸安全与防火防爆',
    2 => '锅炉、压力容器安全',
    3 => '电气安全',
    4 => '地质勘探安全',
    5 => '矿山安全',
    6 => '石油、化学工业安全',
    7 => '冶金工业安全',
    8 => '机械、金属工艺安全',
    9 => '焊接工艺安全',
    10 => '起重及搬运安全',
    11 => '武器工业安全',
    12 => '动力工业安全',
    13 => '核工业安全',
    14 => '建筑施工安全',
    15 => '轻工业、手工业安全',
    16 => '航空、航天安全',
    17 => '交通运输安全',
    18 => '农、林、渔业安全',
    19 => '生活安全及其它',
  ),
  '劳动卫生工程' => 
  array (
    0 => '作业环境卫生',
    1 => '工业通风',
    2 => '工业照明',
    3 => '工业防尘',
    4 => '工业防毒',
    5 => '噪声与振动控制',
    6 => '异常气压防护',
    7 => '高低温防护',
  ),
  '灾害及其防治' => 
  array (
    0 => '自然灾害及其防治',
    1 => '人为灾害及其防治',
  ),
  '环境科学与资源利用' => 
  array (
    0 => '环境科学',
    1 => '社会与环境',
    2 => '环境保护管理',
    3 => '环境污染及其防治',
    4 => '废物处理与综合利用',
    5 => '环境质量评价与环境监测',
  ),
  '社会与环境' => 
  array (
    0 => '环境与环境系统',
    1 => '人类、资源、能源与环境的关系',
    2 => '环境容量与环境自净',
    3 => '环境与发展',
  ),
  '环境保护管理' => 
  array (
    0 => '环境规划与环境管理',
    1 => '环境卫生与卫生工程',
    2 => '放射卫生与辐射防护',
    3 => '环境与清洁生产',
  ),
  '环境污染及其防治' => 
  array (
    0 => '大气污染及其防治',
    1 => '土壤污染及其防治',
    2 => '其他环境污染及其防治',
  ),
  '农田水利及水污染防治' => 
  array (
    0 => '水体污染及其防治',
    1 => '农田水文学',
    2 => '水源',
    3 => '灌溉制度与管理',
    4 => '灌溉技术',
    5 => '排水',
    6 => '排灌工程',
    7 => '水利改良土壤措施',
    8 => '各国农田水利',
  ),
  '环境质量评价与环境监测' => 
  array (
    0 => '环境质量分析与评价',
    1 => '环境监测',
    2 => '环境监测网、站，监测系统，监测仪器设备及环境遥感',
  ),
  '工程科技Ⅱ辑' => 
  array (
    0 => '工业通用技术及设备',
    1 => '机械工业',
    2 => '仪器仪表工业',
    3 => '航空航天科学与工程',
    4 => '武器工业与军事技术',
    5 => '铁路运输',
    6 => '公路与水路运输',
    7 => '汽车工业',
    8 => '船舶工业',
    9 => '水利水电工程',
    10 => '建筑科学与工程',
    11 => '动力工程',
    12 => '核科学技术',
    13 => '新能源',
    14 => '电力工业',
  ),
  '工业通用技术及设备' => 
  array (
    0 => '工程基础科学',
    1 => '工程设计与测绘',
    2 => '工业通用技术与设备',
    3 => '声学工程',
    4 => '制冷工程',
    5 => '真空技术',
    6 => '摄影技术',
    7 => '计量学',
    8 => '工业技术概论',
  ),
  '工程设计与测绘' => 
  array (
    0 => '工程设计',
    1 => '工程测量、制图、模拟',
  ),
  '工业通用技术与设备' => 
  array (
    0 => '爆破技术',
    1 => '薄膜技术',
    2 => '粉末技术',
    3 => '工业设计',
    4 => '干燥技术',
    5 => '包装工程',
    6 => '防伪技术',
    7 => '密封技术',
    8 => '工厂、车间',
    9 => '清洗技术',
  ),
  '自动化技术' => 
  array (
    0 => '遥感技术',
    1 => '自动化技术总论',
    2 => '自动化基础理论',
    3 => '自动化技术及设备',
    4 => '射流技术(流控技术)',
    5 => '远动技术',
  ),
  '机械零件及传动装置' => 
  array (
    0 => '液压传动',
    1 => '联接及联接零件',
    2 => '机械传动机构',
    3 => '转动机件',
    4 => '控制机件',
    5 => '弹簧',
    6 => '其他机械元件',
    7 => '气压传动',
    8 => '其他传动',
  ),
  '声学工程' => 
  array (
    0 => '总论、声学仪器及声学测量',
    1 => '振动、噪声及其控制',
    2 => '电声、光声、水声、超声工程',
  ),
  '制冷工程' => 
  array (
    0 => '制冷理论',
    1 => '制冷材料、制冷机械和设备及应用',
  ),
  '机械工业' => 
  array (
    0 => '机械工业总论',
    1 => '机械工业经济',
    2 => '机械学',
    3 => '机械设计、计算与制图',
    4 => '机械零件及传动装置',
    5 => '机械制造用材料',
    6 => '机械制造工艺',
    7 => '机械运行与维修',
    8 => '机械工厂(车间)',
    9 => '起重机械与运输机械',
    10 => '泵',
    11 => '气体压缩与输送机械',
    12 => '专用机械与设备',
  ),
  '机械学' => 
  array (
    0 => '机械原理',
    1 => '机构学',
    2 => '机械动力学',
    3 => '机械强度',
    4 => '机械精确度',
    5 => '机械摩擦、磨损与润滑',
  ),
  '机械设计、计算与制图' => 
  array (
    0 => '机械设计概论',
    1 => '标准、规格',
    2 => '机械设计',
    3 => '机械计算',
    4 => '机械制图',
    5 => '机械模型',
  ),
  '机械制造工艺' => 
  array (
    0 => '机械制造工艺概论',
    1 => '机械加工精度理论',
    2 => '工艺设计',
    3 => '成组工艺',
    4 => '计算机辅助机械制造',
    5 => '柔性制造系统及柔性制造单元',
    6 => '计算机集成制造',
  ),
  '起重机械与运输机械' => 
  array (
    0 => '起重机械',
    1 => '运输机械',
    2 => '装卸机械',
  ),
  '气体压缩与输送机械' => 
  array (
    0 => '压缩空气工程',
    1 => '通风机',
    2 => '鼓风机',
    3 => '压缩机、压气机',
    4 => '其他气动工具',
    5 => '各种用途气体压缩输送机械',
    6 => '压力容器',
  ),
  '仪器仪表工业' => 
  array (
    0 => '仪器、仪表概论',
    1 => '计量仪器',
    2 => '坐标器、计算机具、计数器',
    3 => '物理学与力学一般仪器',
    4 => '光学仪器',
    5 => '天文仪器',
    6 => '地球科学仪器',
    7 => '医药卫生器械',
    8 => '生物科学与农林科学仪器',
    9 => '热工量的测量仪表',
    10 => '力学量测量仪表',
    11 => '成分分析仪器',
    12 => '质谱仪',
    13 => '显示仪表',
    14 => '工业自动化仪表',
    15 => '材料试验机与试验仪器',
    16 => '其他仪器仪表',
  ),
  '航空航天科学与工程' => 
  array (
    0 => '航空、航天技术的研究与探索',
    1 => '航空',
    2 => '航天',
  ),
  '航空、航天技术的研究与探索' => 
  array (
    0 => '航空、航天的发展与空间探索',
    1 => '航空、航天的应用',
  ),
  '交通运输经济' => 
  array (
    0 => '航空运输经济',
    1 => '铁路运输经济',
    2 => '水路运输经济',
    3 => '交通运输经济理论及概况',
    4 => '陆路、公路运输经济',
    5 => '城市交通运输经济',
  ),
  '航天' => 
  array (
    0 => '基础理论及试验',
    1 => '火箭、航天器构造',
    2 => '航天推进系统',
    3 => '航天仪表、设备、制导与控制',
    4 => '航天制造工艺',
    5 => '航天器及其运载工具',
    6 => '航天用燃料(推进剂)及润滑剂',
    7 => '航天术',
    8 => '地面设备、试验场、发射场、航天基地',
    9 => '航天系统工程',
  ),
  '航空' => 
  array (
    0 => '飞机构造与设计',
    1 => '航空发动机',
    2 => '航空仪表、设备、控制与导航',
    3 => '航空(天)用材料、制品及各类航空器、航空用燃料及润滑剂',
    4 => '航空飞行术、航空港(站)、机场及技术管理及航空系统工程',
  ),
  '热力工程、热机' => 
  array (
    0 => '热力工程理论',
    1 => '热能',
    2 => '气体透平(涡轮机)',
    3 => '燃料与燃烧',
    4 => '工业用热工设备',
  ),
  '航空发动机' => 
  array (
    0 => '航空发动机(推进系统)',
    1 => '燃烧',
  ),
  '航空仪表、设备、控制与导航' => 
  array (
    0 => '航空仪表、设备',
    1 => '飞行控制系统与导航',
  ),
  '航空(天)用材料、制品及各类航空器、航空用燃料及润滑剂' => 
  array (
    0 => '航空(天)用材料',
    1 => '航空制造工艺',
    2 => '各类型航空器',
    3 => '航空用燃料及润滑剂',
  ),
  '航空飞行术、航空港(站)、机场及技术管理及航空系统工程' => 
  array (
    0 => '航空飞行术',
    1 => '航空港(站)、机场及技术管理',
    2 => '航空系统工程',
  ),
  '军事医学与卫生' => 
  array (
    0 => '航空、航天医学',
    1 => '航海医学',
    2 => '潜水医学',
    3 => '军事医学卫生',
  ),
  '武器工业与军事技术' => 
  array (
    0 => '基础科学',
    1 => '武器军用器材',
    2 => '军事通讯',
    3 => '军事工程',
    4 => '军事地形学、军事地理学',
  ),
  '武器军用器材' => 
  array (
    0 => '总论武器军用器材',
    1 => '枪、炮',
    2 => '弹药、引信、火工品',
    3 => '爆破器材、烟火器材、火炸药',
    4 => '水中兵器',
    5 => '火箭、导弹',
    6 => '军用飞机与航天器',
    7 => '军舰',
    8 => '战车',
    9 => '特种武器及其他军用器材',
  ),
  '铁路运输' => 
  array (
    0 => '铁路线路工程',
    1 => '电气化铁路',
    2 => '特种铁路',
    3 => '机车工程',
    4 => '车辆工程',
    5 => '铁路通信、信号',
    6 => '铁路运输管理工程',
  ),
  '公路与水路运输' => 
  array (
    0 => '综合运输',
    1 => '公路运输',
    2 => '水路运输',
  ),
  '综合运输' => 
  array (
    0 => '综合运输体制与结构',
    1 => '城乡交通运输',
    2 => '工商业运输',
    3 => '管道运输、索道运输',
  ),
  '公路运输' => 
  array (
    0 => '公路运输经济',
    1 => '道路工程',
    2 => '桥涵工程',
    3 => '隧道工程',
    4 => '交通工程与公路运输技术管理',
  ),
  '水路运输' => 
  array (
    0 => '航道工程',
    1 => '通航建筑物与助航设备',
    2 => '港口工程',
    3 => '水路运输技术管理',
  ),
  '汽车工业' => 
  array (
    0 => '汽车工业经济',
    1 => '汽车理论',
    2 => '整车设计与计算',
    3 => '汽车结构部件',
    4 => '汽车发动机',
    5 => '汽车材料',
    6 => '汽车制造工艺',
    7 => '汽车试验',
    8 => '汽车制造厂',
    9 => '各种汽车',
    10 => '汽车驾驶与使用',
    11 => '汽车保养与修理',
    12 => '汽车用燃料、润滑料',
    13 => '其它道路运输工具',
  ),
  '汽车结构部件' => 
  array (
    0 => '汽车底盘',
    1 => '传动系统',
    2 => '行走系统',
    3 => '转向系统',
    4 => '制动系统',
    5 => '电气设备及附件',
    6 => '仪表',
    7 => '驾驶室及车身',
    8 => '汽车附属装置',
  ),
  '船舶工业' => 
  array (
    0 => '船舶工业经济',
    1 => '船舶原理',
    2 => '船舶设计',
    3 => '船舶结构',
    4 => '船舶机械',
    5 => '船舶电气设备、观通设备',
    6 => '导航设备、水声设备',
    7 => '船舶舾装设备',
    8 => '造船材料',
    9 => '船舶建造工艺',
    10 => '船舶保养、修理和拆船工艺',
    11 => '造船厂、修船厂',
    12 => '各种船舶',
    13 => '船舶驾驶、航海学',
    14 => '航海技术管理与救助打捞',
    15 => '船舶用燃料及润滑剂',
  ),
  '船舶机械' => 
  array (
    0 => '船舶动力装置',
    1 => '船舶轴系、传动装置、并车装置',
    2 => '船舶推进装置',
    3 => '甲板机械',
    4 => '船舶辅机及设备',
    5 => '其他特种机械',
    6 => '船舶防摇装置',
    7 => '船舶系统',
    8 => '船舶防污设备',
  ),
  '水利水电工程' => 
  array (
    0 => '水利经济',
    1 => '水利工程基础学',
    2 => '水资源调查与水利规划、水工勘测设计',
    3 => '水工材料',
    4 => '水利工程施工',
    5 => '水利枢纽、水工建筑物',
    6 => '水能利用、水电站工程',
    7 => '治河工程与防洪工程',
    8 => '运渠(运河、渠道)工程、港湾工程、农田水利工程',
  ),
  '水利工程基础学' => 
  array (
    0 => '工程水文学',
    1 => '水力学',
    2 => '泥沙动力学、河流动力学',
    3 => '土力学',
  ),
  '水资源调查与水利规划、水工勘测设计' => 
  array (
    0 => '水资源调查与水利规划',
    1 => '水工勘测、水工设计',
  ),
  '水利枢纽、水工建筑物' => 
  array (
    0 => '水利枢纽工程、水库工程',
    1 => '挡水坝',
    2 => '泄水建筑物、水闸',
    3 => '取水、引水、调水工程',
  ),
  '水能利用、水电站工程' => 
  array (
    0 => '水能勘测与设计',
    1 => '水电站建筑与设备',
    2 => '各种水电站',
    3 => '世界各国水力发电工程及中小河道水能利用',
  ),
  '建筑科学与工程' => 
  array (
    0 => '建筑基础科学',
    1 => '建筑工程',
    2 => '区域规划、城乡规划',
  ),
  '建筑基础科学' => 
  array (
    0 => '建筑一般理论',
    1 => '建筑经济学',
    2 => '建筑艺术学',
    3 => '建筑物理学',
    4 => '建筑数学',
    5 => '其他科学技术在建筑中的应用',
    6 => '建筑史',
  ),
  '建筑工程' => 
  array (
    0 => '建筑勘测工程',
    1 => '建筑设计',
    2 => '建筑结构',
    3 => '建筑材料',
    4 => '房屋建筑设备',
    5 => '建筑施工',
    6 => '建筑施工机械和设备',
    7 => '市政工程',
    8 => '土力学、地基基础工程',
  ),
  '建筑设计' => 
  array (
    0 => '建筑设计一般性问题',
    1 => '房屋细部构造设计',
    2 => '民用建筑',
    3 => '工业建筑',
    4 => '地下建筑',
    5 => '水下建筑',
    6 => '高层建筑',
    7 => '其他建筑',
  ),
  '农业工程' => 
  array (
    0 => '农业建筑',
    1 => '农业工程总论',
    2 => '农业动力、农村能源',
    3 => '农业机械及农具',
    4 => '农业机械化',
    5 => '农业电气化与自动化、农业航空',
    6 => '农田水利及水污染防治',
    7 => '农田基本建设、农垦',
    8 => '农业工程勘测、土地测量、土地管理、规划及利用',
  ),
  '建筑结构' => 
  array (
    0 => '结构理论、计算',
    1 => '杆件系统结构',
    2 => '薄壳结构',
    3 => '实体结构',
    4 => '特殊形式结构',
    5 => '土、砖、石、竹、木结构',
    6 => '混凝土结构、钢筋混凝土结构',
    7 => '非金属结构',
    8 => '金属结构',
  ),
  '房屋建筑设备' => 
  array (
    0 => '房屋建筑设备一般性问题',
    1 => '管道设备',
    2 => '房屋卫生技术设备',
    3 => '空气调节、采暖、通风及其设备',
    4 => '机电设备',
    5 => '降温与保温(隔热)设备',
    6 => '消声、隔声设备',
    7 => '安全设备',
    8 => '地下建筑设备',
    9 => '高层建筑设备',
    10 => '控照器材、人工光源',
  ),
  '市政工程' => 
  array (
    0 => '管线工程',
    1 => '给水工程(上水道工程)',
    2 => '排水工程(沟渠工程、下水道工程)',
    3 => '公共卫生工程',
    4 => '城市供电和通信',
    5 => '城市集中供热',
    6 => '城市燃气供应',
    7 => '其他市政工程及公用设备',
  ),
  '动力工程' => 
  array (
    0 => '动力工业经济',
    1 => '热力工程、热机',
    2 => '蒸汽动力工程',
    3 => '热工量测和热工自动控制',
    4 => '内燃机',
    5 => '水能、水力机械',
  ),
  '蒸汽动力工程' => 
  array (
    0 => '蒸汽理论',
    1 => '蒸汽锅炉',
    2 => '蒸汽机',
    3 => '蒸汽轮机(蒸汽透平、汽轮机)',
    4 => '蒸汽动力工厂(车间)',
  ),
  '蒸汽锅炉' => 
  array (
    0 => '理论',
    1 => '设计、计算',
    2 => '锅炉构造',
    3 => '炉内过程与锅内过程',
    4 => '材料及元件强度',
    5 => '制造工艺、安装',
    6 => '运行',
    7 => '各种类型锅炉',
  ),
  '热工量测和热工自动控制' => 
  array (
    0 => '量测技术及仪表',
    1 => '热工自动控制、检修维护及应用',
  ),
  '内燃机' => 
  array (
    0 => '汽油机',
    1 => '柴油机',
    2 => '其他燃料的内燃机',
    3 => '复合式发动机',
    4 => '燃气轮机',
    5 => '喷气推进器、火箭发动机',
  ),
  '核科学技术' => 
  array (
    0 => '原子能技术经济',
    1 => '原子能技术及基础理论',
    2 => '核燃料及其生产',
    3 => '核反应堆工程、核电厂',
    4 => '加速器',
    5 => '核爆炸、放射性物质',
    6 => '受控热核反应',
    7 => '辐射防护',
    8 => '粒子探测技术、辐射探测技术与核仪器仪表',
  ),
  '新能源' => 
  array (
    0 => '太阳能',
    1 => '风能',
    2 => '生物质能',
    3 => '地热能',
    4 => '海洋能',
    5 => '化学能',
    6 => '天然气水合物',
    7 => '原子能',
  ),
  '电力工业' => 
  array (
    0 => '电力工业概况',
    1 => '电工基础理论',
    2 => '电工材料',
    3 => '电机',
    4 => '变压器、变流器及其它电力变换器',
    5 => '电器',
    6 => '发电、发电厂',
    7 => '输配电工程、电力网及电力系统',
    8 => '高电压技术',
    9 => '电源技术',
    10 => '电气测量技术及仪器',
  ),
  '电力工业概况' => 
  array (
    0 => '概况',
    1 => '电工技术经济',
  ),
  '电工基础理论' => 
  array (
    0 => '电工单位、电工计算',
    1 => '电学、磁学',
    2 => '电路理论',
    3 => '磁路',
    4 => '电磁场理论的应用',
  ),
  '电工材料' => 
  array (
    0 => '强电介质和压电介质',
    1 => '导电材料及其制品',
    2 => '微波吸收材料',
    3 => '超导体、超导材料',
    4 => '磁性材料、铁氧体',
    5 => '电工陶瓷材料',
  ),
  '电机' => 
  array (
    0 => '电动机(总论)',
    1 => '各种电机',
  ),
  '发电、发电厂' => 
  array (
    0 => '电能学、发电',
    1 => '发电厂',
    2 => '变电所',
    3 => '配电设备和电气接线',
  ),
  '发电厂' => 
  array (
    0 => '移动式发电站',
    1 => '火力发电厂、热电站',
    2 => '发电厂建筑',
    3 => '水力发电厂、水电站',
    4 => '核电厂',
    5 => '动力工业废物处理与综合利用',
  ),
  '输配电工程、电力网及电力系统' => 
  array (
    0 => '电力系统概况',
    1 => '理论与分析',
    2 => '输配电技术',
    3 => '电力系统的调度、管理、通信',
    4 => '电力系统的模拟与计算',
    5 => '线路及杆塔',
    6 => '电力系统的自动化',
    7 => '电力系统的继电保护',
  ),
  '电源技术' => 
  array (
    0 => '独立电源技术(直接发电)',
    1 => '非独立电源技术',
  ),
  '电气测量技术及仪器' => 
  array (
    0 => '电数量的测量及仪表',
    1 => '集中参数、分布参数的测量及仪表',
    2 => '频率、波形参数的测量及仪表',
    3 => '磁数量测量及仪器',
    4 => '电磁场强度(信号强度)测量及仪表',
    5 => '复用、较量、记录和模拟测试装置',
    6 => '微波测量及仪表',
  ),
  '农业科技' => 
  array (
    0 => '农业基础科学',
    1 => '农业工程',
    2 => '农艺学',
    3 => '植物保护',
    4 => '农作物',
    5 => '园艺',
    6 => '畜牧与动物医学',
    7 => '蚕蜂与野生动物保护',
    8 => '水产和渔业',
  ),
  '农业基础科学' => 
  array (
    0 => '农业基本问题',
    1 => '农业方针政策及其阐述',
    2 => '农业数学',
    3 => '农业物理学',
    4 => '肥料学',
    5 => '农业气象学',
    6 => '农业生物学',
    7 => '农业资源及环境保护',
  ),
  '农业方针政策及其阐述' => 
  array (
    0 => '农业发展与建设方针',
    1 => '农业现代化道路、模式',
    2 => '农业可持续发展',
    3 => '农村经济改革',
  ),
  '肥料学' => 
  array (
    0 => '肥料基础科学',
    1 => '农家肥、绿肥、细菌肥料及其他',
    2 => '化学肥料制造',
    3 => '施肥',
    4 => '施肥机械与设备',
  ),
  '农业化学与肥料学' => 
  array (
    0 => '化学肥料',
    1 => '农业化学',
    2 => '农家肥料',
    3 => '绿肥',
    4 => '细菌肥料',
    5 => '肥料剂型',
    6 => '肥料的选择与管理',
    7 => '积肥、调制与施肥',
  ),
  '林业基础科学' => 
  array (
    0 => '森林土壤学',
    1 => '林业经济及概述',
    2 => '森林数学',
    3 => '森林物理学',
    4 => '森林化学',
    5 => '森林水文学',
    6 => '森林气象学',
    7 => '森林地理学、森林分布',
    8 => '森林生物学',
    9 => '森林与环境保护',
  ),
  '农业生物学' => 
  array (
    0 => '农业生态学',
    1 => '农业微生物学、农业植物学',
    2 => '农业动物学',
    3 => '农业昆虫学、蜱螨学',
    4 => '农业生物工程',
  ),
  '农业动力、农村能源' => 
  array (
    0 => '农业能源及其利用',
    1 => '拖拉机',
  ),
  '农业机械及农具' => 
  array (
    0 => '手工农具、改良农具',
    1 => '耕耘机具',
    2 => '种植机械',
    3 => '田间管理机械',
    4 => '收获机具',
    5 => '农产品初步加工机具',
    6 => '农业运输、装卸机具、贮藏设备',
  ),
  '农业机械化' => 
  array (
    0 => '农业机械化区划与系统',
    1 => '农业机械与拖拉机运用学',
    2 => '农业生产作业机械化工艺组织',
    3 => '农用仪器、仪表及设备',
    4 => '林业机械化',
  ),
  '作物学基础' => 
  array (
    0 => '作物品种与种质资源',
    1 => '作物遗传育种与良种繁育',
    2 => '耕作学与有机农业',
    3 => '作物生物学原理、栽培技术与方法',
    4 => '播种、栽植及田间管理',
  ),
  '植物保护' => 
  array (
    0 => '植物保护总论',
    1 => '动植物检疫',
    2 => '植物检疫',
    3 => '气象灾害、森林火灾及其预防',
    4 => '作物病虫害及其防治',
    5 => '园艺作物病虫害及其防治',
    6 => '鸟兽害及其它灾害防治',
    7 => '有害植物及其清除',
    8 => '各种防治方法',
    9 => '农药防治(化学防治)',
    10 => '植物保护机械',
  ),
  '气象灾害、森林火灾及其预防' => 
  array (
    0 => '气象灾害及其预防',
    1 => '森林火灾及其预防',
  ),
  '作物病虫害及其防治' => 
  array (
    0 => '植物病虫害及其预测、预报',
    1 => '禾谷类作物病虫害及其防治',
    2 => '豆类、薯类作物病虫害及其防治',
    3 => '饲料作物、牧草及绿肥作物病虫害及其防治',
    4 => '经济作物病虫害及其防治',
  ),
  '园艺作物病虫害及其防治' => 
  array (
    0 => '蔬菜、瓜果病虫害及其防治',
    1 => '观赏园艺病虫害及其防治',
  ),
  '病虫害及其防治' => 
  array (
    0 => '果树病虫害及其防治',
    1 => '蔬菜病虫害及其防治',
    2 => '瓜果病虫害及其防治',
    3 => '观赏园艺类病虫害及其防治',
  ),
  '森林保护学' => 
  array (
    0 => '森林病虫害及其防治',
    1 => '气象灾害及其防治',
    2 => '林火',
    3 => '动物为害及其防治',
    4 => '有害草木及其清除',
    5 => '人为损害及其防治',
    6 => '防治药品及其使用',
    7 => '其他防治方法',
  ),
  '农作物' => 
  array (
    0 => '作物学基础',
    1 => '禾谷类作物',
    2 => '豆类作物',
    3 => '薯类作物',
    4 => '饲料作物、牧草',
    5 => '绿肥作物',
    6 => '经济作物',
    7 => '野生植物、热带、亚热带作物及其它',
  ),
  '禾谷类作物' => 
  array (
    0 => '稻',
    1 => '麦',
    2 => '玉米',
    3 => '高梁',
    4 => '其它禾谷类',
  ),
  '稻' => 
  array (
    0 => '水稻',
    1 => '籼稻、粳稻、糯稻',
    2 => '早稻、中稻、晚稻',
    3 => '单季稻、双季稻、三季稻',
    4 => '深水稻',
    5 => '陆稻',
    6 => '野生稻',
  ),
  '麦' => 
  array (
    0 => '小麦',
    1 => '大麦及其它',
  ),
  '薯类作物' => 
  array (
    0 => '甘薯',
    1 => '马铃薯',
    2 => '木薯及其它',
  ),
  '经济作物' => 
  array (
    0 => '纤维作物',
    1 => '油料作物',
    2 => '糖料作物',
    3 => '药用作物',
    4 => '饮料作物',
    5 => '烟草',
    6 => '香料作物',
  ),
  '纤维作物' => 
  array (
    0 => '棉',
    1 => '麻类作物',
    2 => '编织用纤维作物',
  ),
  '油料作物' => 
  array (
    0 => '大豆',
    1 => '花生',
    2 => '油菜子',
    3 => '其他油料作物',
  ),
  '糖料作物' => 
  array (
    0 => '甘蔗',
    1 => '甜菜',
    2 => '其他糖料作物',
  ),
  '药用作物' => 
  array (
    0 => '木本',
    1 => '草本',
    2 => '菌类',
    3 => '其它药用作物',
  ),
  '饮料作物' => 
  array (
    0 => '茶',
    1 => '咖啡及其它饮料作物',
  ),
  '园艺' => 
  array (
    0 => '设施园艺',
    1 => '蔬菜园艺',
    2 => '瓜果园艺',
    3 => '果树园艺',
    4 => '观赏园艺(花卉和观赏树木)',
    5 => '病虫害及其防治',
  ),
  '设施园艺' => 
  array (
    0 => '温室构造及其管理、作业、栽培',
    1 => '无土栽培',
    2 => '蔬菜设施园艺',
    3 => '瓜果设施园艺',
    4 => '果树设施园艺',
    5 => '花卉设施园艺',
  ),
  '蔬菜园艺' => 
  array (
    0 => '直根类',
    1 => '块茎类',
    2 => '葱蒜类',
    3 => '白菜类、芥菜类',
    4 => '甘蓝类',
    5 => '绿叶菜类',
    6 => '茄果类',
    7 => '瓜类',
    8 => '豆荚类',
    9 => '多年生菜类',
    10 => '水生菜类',
    11 => '菌类(食用菌)',
    12 => '野生菜及其它',
  ),
  '瓜果园艺' => 
  array (
    0 => '西瓜',
    1 => '甜瓜',
  ),
  '果树园艺' => 
  array (
    0 => '仁果类',
    1 => '核果类',
    2 => '浆果类',
    3 => '坚果类',
    4 => '杂果类',
    5 => '柑桔类',
    6 => '热带及亚热带果类',
    7 => '多年生草本果类',
  ),
  '观赏园艺(花卉和观赏树木)' => 
  array (
    0 => '一、二年生花卉类',
    1 => '多年生花卉类',
    2 => '观花树木类',
    3 => '观叶、观果树木类',
    4 => '园林植物栽培及应用技术',
  ),
  '造林学、林木育种及造林技术' => 
  array (
    0 => '造林计划与实施',
    1 => '树木育种及良种繁育',
    2 => '苗圃学',
    3 => '宜林地',
    4 => '造林技术',
    5 => '各林种造林',
    6 => '特殊地区造林',
  ),
  '绿化建设' => 
  array (
    0 => '大地园林',
    1 => '中国绿化建设',
    2 => '各国绿化建设',
    3 => '绿化建设规划',
  ),
  '森林经营学、森林计测学、森林经理学' => 
  array (
    0 => '森林作业法',
    1 => '森林主伐',
    2 => '森林间伐及抚育',
    3 => '森林更新',
    4 => '封山育林',
    5 => '林分改造',
    6 => '森林经理学',
    7 => '森林计测学',
    8 => '各林种及林副产品经营',
  ),
  '森林工程、林业机械' => 
  array (
    0 => '森林测量、林业测绘',
    1 => '森林建筑工程',
    2 => '森林运输工程',
    3 => '森林水土保持工程',
    4 => '防沙工程',
    5 => '林业机械',
    6 => '林业航空、林业电器通讯设备',
  ),
  '森林采运与利用' => 
  array (
    0 => '木材学',
    1 => '木材采运学',
    2 => '森林副产品采集',
    3 => '森林环境资源的利用',
    4 => '森林副产品的综合利用',
  ),
  '森林树种' => 
  array (
    0 => '针叶树类',
    1 => '阔叶乔木',
    2 => '阔叶灌木',
    3 => '特用阔叶树类',
    4 => '竹',
    5 => '热带树种',
  ),
  '畜牧与动物医学' => 
  array (
    0 => '普通畜牧学',
    1 => '家畜',
    2 => '家禽',
    3 => '兽医学',
  ),
  '普通畜牧学' => 
  array (
    0 => '畜牧经济学',
    1 => '畜牧基础科学',
    2 => '草原学',
    3 => '遗传、选种、育种',
    4 => '繁殖',
    5 => '饲料',
    6 => '畜牧机械',
    7 => '畜牧电气化和自动化',
  ),
  '养蜂、益虫饲养' => 
  array (
    0 => '饲养管理',
    1 => '蜂群生物学',
    2 => '繁育',
    3 => '品种',
    4 => '病虫害防治',
    5 => '蜂产品加工及利用',
    6 => '蜜源植物',
    7 => '蜂场的经营及管理',
    8 => '益虫饲养',
  ),
  '家畜' => 
  array (
    0 => '马',
    1 => '驴、骡',
    2 => '牛',
    3 => '骆驼',
    4 => '鹿',
    5 => '羊',
    6 => '山羊',
    7 => '猪',
    8 => '兔',
    9 => '其它家畜',
  ),
  '家禽' => 
  array (
    0 => '鸡',
    1 => '鸭',
    2 => '鹅',
    3 => '鸽',
  ),
  '市场研究与信息' => 
  array (
    0 => '其它',
    1 => '市场理论与研究',
    2 => '农业产品与市场',
    3 => '工业产品与市场',
  ),
  '兽医学' => 
  array (
    0 => '兽医预防科学',
    1 => '兽医基础科学',
    2 => '兽医临床医学',
    3 => '兽医传染病学',
    4 => '兽医各科',
    5 => '中国兽医学',
    6 => '兽医药物学',
    7 => '猪病',
    8 => '鸡病',
    9 => '其它各种畜、禽病',
  ),
  '其它各种畜、禽病' => 
  array (
    0 => '马病',
    1 => '驴、骡病',
    2 => '牛病',
    3 => '骆驼病',
    4 => '鹿病',
    5 => '羊病',
    6 => '其它家畜病',
    7 => '鸭病',
    8 => '其它家禽病及野生动物疾病',
  ),
  '蚕蜂与野生动物保护' => 
  array (
    0 => '狩猎、野生动物驯养',
    1 => '畜禽产品的综合利用',
    2 => '蚕桑、养蜂、益虫饲养',
  ),
  '蚕桑、养蜂、益虫饲养' => 
  array (
    0 => '蚕桑',
    1 => '养蜂、益虫饲养',
  ),
  '蚕桑' => 
  array (
    0 => '蚕基础科学',
    1 => '蚕的育种与良种繁育',
    2 => '蚕的饲育法',
    3 => '蚕的病虫害及其防治',
    4 => '其他蚕类',
    5 => '蚕茧',
    6 => '养蚕建筑、养蚕机具',
    7 => '桑',
    8 => '蚕的其他饲料',
  ),
  '水产和渔业' => 
  array (
    0 => '水产经济',
    1 => '水产基础科学',
    2 => '水产地区分布、水产志与资源',
    3 => '水产保护学',
    4 => '水产工程',
    5 => '水产养殖技术',
    6 => '渔捞',
    7 => '水产物运输、保鲜贮藏、加工、包装',
  ),
  '水产地区分布、水产志与资源' => 
  array (
    0 => '水产资源学、地区分布',
    1 => '水产资源调查',
  ),
  '水产保护学' => 
  array (
    0 => '鱼病学',
    1 => '鱼病防治方法',
    2 => '各种鱼病防治',
    3 => '贝类病害、敌害及其防治',
    4 => '甲壳类病虫害及其防治',
    5 => '其它水产病虫害及其防治',
    6 => '水产药物学、药理学',
    7 => '水产的水质污染及其防治',
  ),
  '水产养殖技术' => 
  array (
    0 => '鱼类繁殖和越冬技术',
    1 => '鱼苗、鱼种',
    2 => '水产动物饵料及其营养',
    3 => '淡水、海水养殖方式',
    4 => '各种鱼类养殖',
    5 => '其他淡水养殖',
    6 => '各种海产动植物养殖',
    7 => '水产养殖设备',
  ),
  '医药卫生方针政策与法律法规研究' => 
  array (
    0 => '卫生事业总论',
    1 => '医药、卫生政策法规',
    2 => '医疗保险',
    3 => '医务人员及卫生宣传教育',
    4 => '卫生标准与检查、医药管理',
    5 => '卫生调查统计',
    6 => '医疗服务、制度及改革',
    7 => '医疗与法',
    8 => '医疗卫生机构及管理',
    9 => '医疗器械',
  ),
  '医学教育与医学边缘学科' => 
  array (
    0 => '一般理论、现状与发展',
    1 => '循证医学',
    2 => '医学教育',
    3 => '医学与其他学科的关系',
    4 => '医学史',
    5 => '医学图书情报及相关机构、团体、会议',
  ),
  '预防医学与卫生学' => 
  array (
    0 => '卫生基础科学',
    1 => '环境卫生',
    2 => '劳动卫生',
    3 => '放射卫生',
    4 => '营养卫生食品卫生',
    5 => '个人卫生与保健',
    6 => '计划生育与妇幼保健',
    7 => '流行病学与防疫',
  ),
  '劳动卫生' => 
  array (
    0 => '劳动生理卫生及生产环境卫生',
    1 => '职业性疾病预防',
    2 => '劳动保护措施',
    3 => '农业劳动卫生',
  ),
  '营养卫生食品卫生' => 
  array (
    0 => '营养学',
    1 => '饮食卫生与食品检验',
  ),
  '个人卫生与保健' => 
  array (
    0 => '一般保健知识、身体清洁卫生、性卫生',
    1 => '生活制度与卫生',
    2 => '个人卫生防护用品使用',
  ),
  '计划生育与妇幼保健' => 
  array (
    0 => '计划生育与卫生',
    1 => '妇幼卫生与保健',
  ),
  '流行病学与防疫' => 
  array (
    0 => '总论及疫情调查、分析与报告',
    1 => '流行病学理论及应用',
    2 => '传染病预防和管理',
    3 => '防疫接种、注射与服药',
    4 => '消毒',
    5 => '医学地理学',
  ),
  '中医学' => 
  array (
    0 => '中国医学',
    1 => '中医基础理论',
    2 => '中医临床学',
    3 => '中医内科',
    4 => '中医外科',
    5 => '中医骨伤科',
    6 => '中医妇产科',
    7 => '中医肿瘤科',
    8 => '中医皮科',
    9 => '中医五官科',
    10 => '中医泌尿学',
    11 => '中医神经病学与精神病学',
    12 => '中医急症学',
    13 => '中国少数民族医学',
    14 => '外国民族医学',
  ),
  '中国医学' => 
  array (
    0 => '中医现代化研究',
    1 => '中医学史',
    2 => '中医全书和论文集',
    3 => '中医预防与卫生、气功',
    4 => '养生',
  ),
  '中医基础理论' => 
  array (
    0 => '中医基础理论总论',
    1 => '内经',
    2 => '伤寒金匮（伤寒杂病论）',
    3 => '中医生理',
    4 => '经络、孔穴',
    5 => '中医阴阳五行运气学说',
    6 => '中医病理',
  ),
  '药品' => 
  array (
    0 => '其他',
    1 => '神经系统药物',
    2 => '心血管系统药物',
    3 => '血液及造血系统药物',
    4 => '呼吸系统药物',
    5 => '消化系统药物',
    6 => '抗变态反应药物',
    7 => '影响生长代谢机能药物',
    8 => '治疗感染性疾病药物',
    9 => '抗肿瘤药物',
    10 => '各科药物',
    11 => '各种药物的不良反应',
  ),
  '中医临床学' => 
  array (
    0 => '中医临床学总论',
    1 => '中医诊断学',
    2 => '中医治疗学',
    3 => '针灸',
    4 => '中医护理学',
    5 => '医案、医话（临床经验）',
  ),
  '中医治疗学' => 
  array (
    0 => '中医治疗学总论',
    1 => '八法论治',
    2 => '外治法',
    3 => '食养食疗',
    4 => '气功',
    5 => '其他文献',
  ),
  '中医内科' => 
  array (
    0 => '中医内科总论',
    1 => '外感病证',
    2 => '一般病证',
    3 => '脏腑病证',
    4 => '现代医学内科疾病',
  ),
  '儿科学' => 
  array (
    0 => '中医儿科',
    1 => '小儿外科学',
    2 => '新生儿、早产儿疾病',
    3 => '儿童的营养障碍及保健与卫生',
    4 => '小儿内科学',
    5 => '小儿泌尿科学',
    6 => '儿童神经、精神病',
    7 => '小儿其他疾病',
  ),
  '中药学' => 
  array (
    0 => '本草',
    1 => '中药材',
    2 => '中药炮制、制剂',
    3 => '中药化学',
    4 => '中药药理学',
    5 => '中药品',
    6 => '各科用药',
    7 => '中药药事组织',
    8 => '方剂学',
    9 => '其他各国生药学',
  ),
  '中西医结合' => 
  array (
    0 => '中西医结合基础',
    1 => '中西医结合临床',
  ),
  '中西医结合基础' => 
  array (
    0 => '证候与诊法',
    1 => '治则与方药',
    2 => '针灸与针麻',
  ),
  '中西医结合临床' => 
  array (
    0 => '内科',
    1 => '外科',
    2 => '骨伤科',
    3 => '妇产科',
    4 => '儿科',
    5 => '泌尿学',
    6 => '神经病学与精神病学',
    7 => '眼科',
    8 => '耳鼻喉科',
    9 => '皮肤性病科',
    10 => '老年病',
    11 => '肿瘤科',
  ),
  '病理学' => 
  array (
    0 => '病理学总论',
    1 => '病理解剖学与组织学',
    2 => '病理生理学、病理过程',
  ),
  '医学心理学、病理心理学' => 
  array (
    0 => '医学、病理心理学',
    1 => '变态心理学',
    2 => '心理治疗学',
  ),
  '临床医学' => 
  array (
    0 => '临床医学总论',
    1 => '诊断与治疗技术',
    2 => '护理学',
    3 => '吸毒与戒毒',
    4 => '疼痛医学',
    5 => '睡眠医学',
    6 => '康复医学',
    7 => '临终关怀学',
    8 => '其他诊疗技术',
  ),
  '诊断与治疗技术' => 
  array (
    0 => '诊断学总论',
    1 => '症状诊断学',
    2 => '物理诊断学(体检诊断)',
    3 => '电诊断',
    4 => '影像医学',
    5 => '实验室诊断',
    6 => '鉴别诊断学',
    7 => '机能诊断学',
    8 => '预后及劳动鉴定',
    9 => '治疗学总论',
    10 => '药物疗法、化学疗法',
    11 => '物理疗法、自然疗法',
    12 => '体育疗法',
    13 => '生物疗法',
    14 => '血液疗法',
    15 => '氧疗、透析及其它疗法等',
    16 => '基因诊断与治疗',
    17 => '介入诊疗',
  ),
  '影像医学' => 
  array (
    0 => '影像医学总论',
    1 => '超声波',
    2 => '核磁共振成像',
    3 => '热成像',
  ),
  '特种医学' => 
  array (
    0 => '放射医学',
    1 => '军事医学',
    2 => '运动医学',
  ),
  '实验室诊断' => 
  array (
    0 => '实验室诊断总论',
    1 => '生物化学检验、临床检验',
    2 => '微生物学检验',
    3 => '免疫学检验',
    4 => '组织学检验',
  ),
  '护理学' => 
  array (
    0 => '护理总论',
    1 => '护理一般技术',
    2 => '专科护理学',
  ),
  '专科护理学' => 
  array (
    0 => '内科护理学',
    1 => '外科护理学',
    2 => '妇产、儿科护理学',
    3 => '神经病、精神病护理学',
    4 => '皮肤病、性病护理学',
    5 => '耳鼻咽喉、眼、口腔科护理学',
    6 => '肿瘤科护理学',
  ),
  '感染性疾病及传染病' => 
  array (
    0 => '感染性疾病的预防',
    1 => '感染性疾病总论',
    2 => '病毒传染病',
    3 => '立克次体传染病',
    4 => '螺旋体传染病',
    5 => '细菌感染性疾病',
    6 => '衣原体、支原体属疾病',
    7 => '真菌、放线菌传染病',
    8 => '结核病',
    9 => '寄生虫病',
    10 => '其他感染性疾病',
  ),
  '病毒传染病' => 
  array (
    0 => '各论',
  ),
  '各论' => 
  array (
    0 => '脑炎、脑脊髓膜炎及脊髓灰质炎',
    1 => '病毒性出血热',
    2 => '获得性免疫缺陷综合征',
    3 => '其他病毒病',
    4 => '严重呼吸综合症',
  ),
  '肝及胆疾病' => 
  array (
    0 => '肝炎',
    1 => '肝硬变',
    2 => '肝脓肿',
    3 => '肝代谢障碍',
    4 => '肝囊肿',
    5 => '胆囊及胆管疾病',
    6 => '肝胆结核',
  ),
  '肺疾病' => 
  array (
    0 => '肺结核',
    1 => '肺炎',
    2 => '肺脓肿',
    3 => '肺气肿',
    4 => '肺不张',
    5 => '肺栓塞',
    6 => '肺出血',
    7 => '肺含铁血黄素沉着病',
    8 => '呼吸衰竭',
  ),
  '结核病' => 
  array (
    0 => '淋巴系结核',
    1 => '气管及食管结核',
    2 => '胃肠结核',
    3 => '肝、脾、胰结核',
    4 => '腹膜结核',
    5 => '泌尿生殖系结核',
    6 => '运动系结核',
    7 => '神经系统结核',
    8 => '耳鼻咽喉、眼、口腔结核',
  ),
  '寄生虫病' => 
  array (
    0 => '原虫病',
    1 => '蠕虫病',
    2 => '皮肤寄生虫病',
    3 => '其他寄生虫病',
  ),
  '心血管系统疾病' => 
  array (
    0 => '诊断学',
    1 => '心脏疾病',
    2 => '血管疾病',
    3 => '血压异常',
    4 => '血液及淋巴系疾病',
  ),
  '心脏疾病' => 
  array (
    0 => '心脏疾病各论',
    1 => '心包疾病',
    2 => '心肌疾病',
    3 => '克山病',
    4 => '心内膜疾病',
    5 => '心瓣膜疾病',
  ),
  '皮肤病学' => 
  array (
    0 => '基础与临床',
    1 => '皮肤肿瘤',
    2 => '病毒性皮肤病',
    3 => '细菌性皮肤病',
    4 => '真菌性皮肤病',
    5 => '寄生虫、昆虫性皮肤病',
    6 => '物理性皮肤病',
    7 => '变态反应性及中毒性皮肤病',
    8 => '神经、精神性皮肤病',
    9 => '代谢障碍性皮肤病',
    10 => '先天性皮肤病',
    11 => '皮肤附属器官病',
    12 => '其他皮肤疾病',
  ),
  '心脏疾病各论' => 
  array (
    0 => '先天性心脏病',
    1 => '风湿性心脏病',
    2 => '高血压性心脏病',
    3 => '冠心病、心绞痛',
    4 => '肺源性心脏病',
    5 => '血循环衰竭',
    6 => '心律失常',
    7 => '其他病因性心脏病',
  ),
  '呼吸系统疾病' => 
  array (
    0 => '胸膜及胸腔疾病',
    1 => '气管与支气管疾病',
    2 => '肺疾病',
    3 => '纵隔疾病',
    4 => '膈疾病',
  ),
  '消化系统疾病' => 
  array (
    0 => '食管疾病',
    1 => '腹部疾病',
    2 => '胃疾病',
    3 => '肠疾病',
    4 => '肝及胆疾病',
    5 => '胰腺疾病',
  ),
  '胃疾病' => 
  array (
    0 => '溃疡病',
    1 => '上消化道出血',
    2 => '胃炎',
  ),
  '急重症各论' => 
  array (
    0 => '肝功能衰竭',
    1 => '急腹症',
    2 => '全身炎症反应综合征',
    3 => '休克',
    4 => '急性心功能衰竭',
    5 => '高血压危象',
    6 => '急性呼吸功能衰竭及急性肺损伤',
    7 => '内分泌系统急重症',
    8 => '多器官功能衰竭',
    9 => '弥漫性血管内凝血',
    10 => '急性心肌梗塞',
    11 => '应激性溃疡',
    12 => '严重心律失常',
    13 => '阿-斯综合征',
    14 => '大咯血',
    15 => '哮喘持续状态',
    16 => '消化道大出血',
    17 => '急性脑血管疾病',
    18 => '创伤',
    19 => '烧伤及烫伤',
    20 => '全身化脓性感染',
    21 => '电击伤',
    22 => '急性放射病',
    23 => '化学损伤',
    24 => '急性药物中毒及其他物质中毒',
    25 => '急性酒精中毒',
    26 => '急性气体中毒',
    27 => '溺水',
    28 => '中暑',
    29 => '毒蛇及毒虫咬伤',
  ),
  '内分泌腺及全身性疾病' => 
  array (
    0 => '内分泌腺疾病及代谢病',
    1 => '全身性疾病',
  ),
  '内分泌腺疾病及代谢病' => 
  array (
    0 => '甲状腺疾病',
    1 => '甲状旁腺疾病',
    2 => '胸腺疾病',
    3 => '垂体及间脑－垂体系统疾病',
    4 => '松果体疾病及性早熟',
    5 => '肾上腺疾病',
    6 => '胰岛疾病',
    7 => '性腺疾病',
    8 => '骨质疏松',
    9 => '代谢病',
  ),
  '全身性疾病' => 
  array (
    0 => '营养缺乏症',
    1 => '老年病学总论',
    2 => '免疫性疾病',
    3 => '物理性损害',
    4 => '中毒及化学性损害',
    5 => '遗传性疾病',
    6 => '原因未明的疾病',
    7 => '职业性疾病',
    8 => '地方病学',
  ),
  '外科学' => 
  array (
    0 => '外科学总论',
    1 => '外科学基础',
    2 => '外科手术学',
    3 => '外科感染',
    4 => '创伤外科学',
    5 => '外科学各论',
    6 => '骨科学',
    7 => '整形外科学',
  ),
  '外科学基础' => 
  array (
    0 => '外科病理学、解剖学',
    1 => '外科诊断学',
    2 => '外科治疗学',
  ),
  '外科手术学' => 
  array (
    0 => '手术室及其设备',
    1 => '抗菌术、无菌技术(消毒法)',
    2 => '麻醉学',
    3 => '手术基本操作技术',
    4 => '特种外科手术学',
    5 => '器官移植术',
    6 => '手术前后的处理及外科并发症',
  ),
  '外科感染' => 
  array (
    0 => '全身性化脓性感染',
    1 => '皮及皮下感染',
    2 => '特异性感染',
  ),
  '外科学各论' => 
  array (
    0 => '头部及神经外科学',
    1 => '颈部外科学',
    2 => '心脏血管及淋巴系外科学',
    3 => '胸部外科学',
    4 => '乳腺外科学',
    5 => '腹部外科学',
    6 => '四肢外科学',
  ),
  '腹部外科学' => 
  array (
    0 => '胃肠',
    1 => '直肠和肛门',
    2 => '肝及肝管',
    3 => '胆囊胆管',
    4 => '胰腺',
    5 => '脾脏',
    6 => '腹部疝',
  ),
  '骨科学' => 
  array (
    0 => '骨骼疾病',
    1 => '骨畸形',
    2 => '骨折、骨的损伤',
    3 => '关节疾病及损伤',
    4 => '肌肉疾病及损伤',
    5 => '筋腱、韧带、滑囊疾病及损伤',
    6 => '周围神经损伤及功能障碍',
    7 => '骨科手术及矫形',
    8 => '儿童骨科学',
    9 => '运动系统结核',
    10 => '运动系统肿瘤',
  ),
  '骨骼疾病' => 
  array (
    0 => '骨及骨膜的感染',
    1 => '脊柱疾病',
    2 => '四肢骨疾病',
    3 => '其他骨骼疾病',
  ),
  '泌尿科学' => 
  array (
    0 => '一般疾病',
    1 => '肾疾病',
    2 => '输尿管疾病',
    3 => '膀胱疾病',
    4 => '尿的成分异常',
    5 => '尿道疾病',
    6 => '男性生殖器疾病',
    7 => '男子性功能障碍',
    8 => '泌尿及男性生殖系外科学',
  ),
  '肾疾病' => 
  array (
    0 => '肾畸形',
    1 => '肾炎与肾病综合征',
    2 => '肾结石',
    3 => '肾功能不全',
    4 => '肾小管、肾小球疾病',
  ),
  '泌尿器肿瘤' => 
  array (
    0 => '肾、肾盂肿瘤',
    1 => '输尿管肿瘤',
    2 => '膀胱肿瘤',
    3 => '尿道肿瘤',
  ),
  '妇产科学' => 
  array (
    0 => '妇科学',
    1 => '产科学',
    2 => '计划生育',
    3 => '临床优生学',
    4 => '辅助生殖技术',
  ),
  '妇科学' => 
  array (
    0 => '妇科疾病',
    1 => '妇科手术',
  ),
  '妇科疾病' => 
  array (
    0 => '女性生殖器官发育异常',
    1 => '女性生殖器官位置异常',
    2 => '女性生殖系统炎症',
    3 => '女性生殖系统损伤',
    4 => '女性生殖器功能性疾病',
    5 => '不孕症',
    6 => '女性生殖器其他疾病',
  ),
  '泌尿生殖器肿瘤' => 
  array (
    0 => '女性生殖器肿瘤',
    1 => '泌尿器肿瘤',
    2 => '男性生殖器肿瘤',
  ),
  '产科学' => 
  array (
    0 => '生理妊娠',
    1 => '病理妊娠',
    2 => '生理分娩',
    3 => '病理分娩',
    4 => '胎儿',
    5 => '助产学',
    6 => '分娩监护',
    7 => '产褥期',
    8 => '围产医学',
    9 => '产科手术',
  ),
  '新生儿、早产儿疾病' => 
  array (
    0 => '新生儿疾病',
    1 => '早产儿疾病',
  ),
  '小儿内科学' => 
  array (
    0 => '小儿内科学总论',
    1 => '儿科急症及处理',
    2 => '小儿传染病和寄生虫病',
    3 => '小儿心脏、血管疾病',
    4 => '小儿血液及淋巴系疾病',
    5 => '小儿呼吸系疾病',
    6 => '小儿消化系疾病',
    7 => '小儿内分泌腺疾病及代谢病',
    8 => '小儿全身性疾病',
  ),
  '神经病学' => 
  array (
    0 => '脑部疾病',
    1 => '脑血管疾病',
    2 => '脊髓疾病',
    3 => '周围神经及神经节疾病',
    4 => '神经肌肉疾病',
    5 => '植物性神经系疾病、血管舒缩及营养神经系疾病',
    6 => '并发神经病',
    7 => '儿童神经病',
  ),
  '脑部疾病' => 
  array (
    0 => '癫痫',
    1 => '大脑性瘫痪',
    2 => '肝豆状核变性',
    3 => '震颤麻痹综合征',
    4 => '脑积水、脑脓肿',
    5 => '脑部感染性疾病',
  ),
  '肿瘤学' => 
  array (
    0 => '神经系肿瘤',
    1 => '肿瘤学基础',
    2 => '心血管肿瘤',
    3 => '造血器及淋巴系肿瘤',
    4 => '呼吸系肿瘤',
    5 => '消化系肿瘤',
    6 => '内分泌腺肿瘤',
    7 => '泌尿生殖器肿瘤',
    8 => '乳腺肿瘤',
    9 => '运动系肿瘤',
    10 => '五官肿瘤',
    11 => '其他部位肿瘤',
  ),
  '精神病学' => 
  array (
    0 => '器质性疾病伴发的精神障碍',
    1 => '精神分裂症',
    2 => '情感性精神障碍',
    3 => '反应性及中毒所致精神障碍',
    4 => '神经官能症',
  ),
  '肿瘤学基础' => 
  array (
    0 => '肿瘤学实验研究',
    1 => '肿瘤学调查与统计',
    2 => '肿瘤的预防与控制',
    3 => '肿瘤病理学、病因学',
    4 => '肿瘤免疫学与血清学',
    5 => '肿瘤诊断学',
    6 => '肿瘤治疗学',
  ),
  '心血管肿瘤' => 
  array (
    0 => '心脏肿瘤',
    1 => '血管肿瘤',
  ),
  '造血器及淋巴系肿瘤' => 
  array (
    0 => '网状内皮系统肿瘤',
    1 => '脾脏肿瘤',
    2 => '骨髓肿瘤',
    3 => '淋巴结肿瘤',
    4 => '白血病',
  ),
  '消化系肿瘤' => 
  array (
    0 => '食管肿瘤',
    1 => '胃肿瘤',
    2 => '肠肿瘤',
    3 => '肠系膜及腹膜后肿瘤',
    4 => '腹膜及膜壁肿瘤',
    5 => '肝肿瘤',
    6 => '胆囊、胆道肿瘤',
    7 => '胰腺肿瘤',
    8 => '壶腹癌',
  ),
  '五官肿瘤' => 
  array (
    0 => '耳鼻、咽喉肿瘤',
    1 => '眼肿瘤',
    2 => '口腔颌面部肿瘤',
  ),
  '眼科与耳鼻咽喉科' => 
  array (
    0 => '耳科学、耳疾病',
    1 => '鼻科学、鼻疾病',
    2 => '咽科学、咽疾病',
    3 => '喉科学、喉疾病',
    4 => '气管与食管镜学',
    5 => '眼科学',
  ),
  '眼科学' => 
  array (
    0 => '眼科预防学及诊断学、治疗学',
    1 => '眼部各种疾病',
    2 => '眼屈光学',
    3 => '眼的损伤与异物',
    4 => '眼外科学',
  ),
  '眼部各种疾病' => 
  array (
    0 => '眼的一般性疾病',
    1 => '眼纤维膜疾病',
    2 => '眼色素层疾病',
    3 => '视网膜及视神经疾病',
    4 => '眼压与青光眼',
    5 => '晶状体与玻璃体疾病',
    6 => '眼附属器官疾病',
  ),
  '眼外科学' => 
  array (
    0 => '视网膜光凝术及激光在眼外科的应用',
    1 => '眼成形术及义眼',
    2 => '角膜移植',
    3 => '白内障摘除术及人工晶体植入',
    4 => '其他眼外科学',
  ),
  '口腔科学' => 
  array (
    0 => '口腔内科学',
    1 => '口腔颌面部外科学',
    2 => '口腔矫形学',
    3 => '老年口腔疾病',
    4 => '儿童口腔疾病',
  ),
  '口腔内科学' => 
  array (
    0 => '总论及治疗学',
    1 => '牙体疾病',
    2 => '牙髓病及根尖周围病',
    3 => '牙周病',
    4 => '口腔粘膜病',
    5 => '唾液腺疾病',
    6 => '口腔颔面部肿瘤',
    7 => '其它口腔疾病',
  ),
  '皮肤病与性病' => 
  array (
    0 => '皮肤病学',
    1 => '性病学',
  ),
  '其他皮肤疾病' => 
  array (
    0 => '红斑',
    1 => '牛皮癣',
    2 => '红皮病',
  ),
  '公安' => 
  array (
    0 => '法医学',
    1 => '公安工作概论',
    2 => '公安行政工作',
    3 => '刑事侦查工作',
    4 => '保密工作',
    5 => '治安工作',
    6 => '交通管理',
    7 => '消防工作',
    8 => '看守所、收容所管理',
    9 => '劳动教养',
    10 => '犯罪学',
    11 => '刑事侦查学',
    12 => '司法鉴定学',
  ),
  '急救医学' => 
  array (
    0 => '总论及基础研究',
    1 => '急重症治疗技术',
    2 => '急重症各论',
  ),
  '药学' => 
  array (
    0 => '药物基础科学',
    1 => '药典、药方集及药物鉴定',
    2 => '药剂学',
    3 => '药事组织',
    4 => '药理学',
    5 => '药品',
    6 => '毒物学(毒理学)',
  ),
  '生物材料及人工器官' => 
  array (
    0 => '生物材料',
    1 => '人工脏器与器官',
  ),
  '哲学与人文科学' => 
  array (
    0 => '文艺理论',
    1 => '世界文学',
    2 => '中国文学',
    3 => '中国语言文字',
    4 => '外国语言文字',
    5 => '音乐舞蹈',
    6 => '戏剧电影与电视艺术',
    7 => '美术书法雕塑与摄影',
    8 => '地理',
    9 => '文化',
    10 => '史学理论',
    11 => '世界历史',
    12 => '中国通史',
    13 => '中国民族与地方史志',
    14 => '中国古代史',
    15 => '中国近现代史',
    16 => '考古',
    17 => '人物传记',
    18 => '哲学',
    19 => '伦理学',
    20 => '宗教',
  ),
  '文艺理论' => 
  array (
    0 => '文学理论综述',
    1 => '文艺美学',
    2 => '文学理论的基本问题',
    3 => '文艺工作者',
    4 => '文学写作与文学创作方法',
    5 => '各体文学理论和创作方法',
    6 => '艺术理论',
    7 => '世界各国艺术概况',
  ),
  '世界文学' => 
  array (
    0 => '作品评论和研究',
    1 => '作品集',
    2 => '各国文学',
  ),
  '中国文学' => 
  array (
    0 => '文学史、文学思想史',
    1 => '方针政策及阐述',
    2 => '文学评论和研究',
    3 => '鲁迅作品及其研究',
    4 => '诗歌、韵文',
    5 => '戏剧文学',
    6 => '小说',
    7 => '报告文学',
    8 => '散文',
    9 => '民间文学',
    10 => '儿童文学',
    11 => '少数民族文学',
  ),
  '小说' => 
  array (
    0 => '综论及作品比较研究',
    1 => '古代作品及其评论研究',
    2 => '近、现、当代作品及评论研究',
  ),
  '文学评论和研究' => 
  array (
    0 => '古代文学(1840年以前)',
    1 => '近、现代文学(1840年－1949年)',
    2 => '建国后文学(1949年以后)',
  ),
  '散文' => 
  array (
    0 => '评论与研究',
    1 => '作品',
  ),
  '中国语言文字' => 
  array (
    0 => '语言学',
    1 => '汉语',
    2 => '中国少数民族语言',
  ),
  '语言学' => 
  array (
    0 => '语言学总论',
    1 => '语音学',
    2 => '语义学、语用学、词汇学、词义学',
    3 => '语法学',
    4 => '写作学与修辞学',
    5 => '词典学、方言学、应用语言学、语文教学',
  ),
  '汉语' => 
  array (
    0 => '文字学',
    1 => '汉语总论',
    2 => '语音',
    3 => '语法',
    4 => '字典、词典、古代字书',
    5 => '方言',
    6 => '汉语教学',
  ),
  '写作学与修辞学' => 
  array (
    0 => '写作学、修辞学',
    1 => '翻译学',
  ),
  '英语' => 
  array (
    0 => '语义、词汇、词义',
    1 => '英语及发展史',
    2 => '语音、文字',
    3 => '语法、构词法',
    4 => '英语写作、修辞及翻译',
    5 => '词典、方言',
    6 => '英语教学方法',
  ),
  '英语写作、修辞及翻译' => 
  array (
    0 => '写作、修辞',
    1 => '翻译',
  ),
  '外国语言文字' => 
  array (
    0 => '英语',
    1 => '俄语',
    2 => '日语',
    3 => '法语、德语',
    4 => '其它外国语',
  ),
  '音乐舞蹈' => 
  array (
    0 => '音乐',
    1 => '舞蹈',
  ),
  '音乐' => 
  array (
    0 => '音乐理论',
    1 => '音乐技术理论与方法',
    2 => '器乐理论与演奏法',
    3 => '民族器乐理论和演奏法',
    4 => '中国音乐作品',
    5 => '各国音乐作品',
    6 => '音乐事业',
  ),
  '戏剧电影与电视艺术' => 
  array (
    0 => '戏剧艺术',
    1 => '电影、电视艺术',
  ),
  '戏剧艺术' => 
  array (
    0 => '戏剧艺术理论',
    1 => '舞台艺术',
    2 => '中国戏剧艺术、各国戏剧艺术',
    3 => '戏剧事业',
  ),
  '电影、电视艺术' => 
  array (
    0 => '电影、电视艺术理论',
    1 => '电影、电视艺术评论欣赏',
    2 => '电影、电视艺术与技术',
    3 => '电影、电视事业',
  ),
  '美术书法雕塑与摄影' => 
  array (
    0 => '绘画',
    1 => '书法、篆刻',
    2 => '雕塑',
    3 => '摄影艺术',
    4 => '工艺美术',
  ),
  '地理' => 
  array (
    0 => '地理学概论',
    1 => '世界及各国地理',
    2 => '中国地理',
    3 => '世界各国地图',
  ),
  '文化' => 
  array (
    0 => '文化学理论',
    1 => '中国文化事业',
    2 => '世界及各国文化事业',
    3 => '群众文化',
  ),
  '史学理论' => 
  array (
    0 => '史学理论总论',
    1 => '史学的哲学基础',
    2 => '社会发展理论',
    3 => '史学专论',
    4 => '年代学',
    5 => '史料学',
    6 => '历史研究',
    7 => '史学史',
  ),
  '世界历史' => 
  array (
    0 => '世界史',
    1 => '亚洲史',
    2 => '非洲史',
    3 => '欧洲史',
    4 => '大洋洲史',
    5 => '美洲史',
  ),
  '世界史' => 
  array (
    0 => '通史',
    1 => '上古史',
    2 => '古代史',
    3 => '中世纪史',
    4 => '近代史',
    5 => '现代史',
    6 => '民族史志',
  ),
  '中国通史' => 
  array (
    0 => '革命史',
    1 => '文化史',
    2 => '古代史藉',
    3 => '历史事件',
    4 => '史料',
    5 => '研究、考订、评论',
    6 => '年表',
    7 => '普及活动',
  ),
  '中国民族与地方史志' => 
  array (
    0 => '中国民族史志',
    1 => '中国地方史志',
  ),
  '中国古代史' => 
  array (
    0 => '原始社会',
    1 => '奴隶社会',
    2 => '封建社会',
  ),
  '奴隶社会' => 
  array (
    0 => '三代',
    1 => '夏',
    2 => '商',
    3 => '西周',
    4 => '春秋',
  ),
  '封建社会' => 
  array (
    0 => '战国',
    1 => '秦',
    2 => '汉',
    3 => '三国',
    4 => '晋',
    5 => '十六国',
    6 => '南北朝',
    7 => '隋',
    8 => '唐',
    9 => '五代',
    10 => '宋',
    11 => '元',
    12 => '明',
    13 => '清',
  ),
  '中国近现代史' => 
  array (
    0 => '半封建半殖民地社会',
    1 => '中华人民共和国史',
  ),
  '半封建半殖民地社会' => 
  array (
    0 => '旧民主主义革命时期',
    1 => '清后期',
    2 => '第一次鸦片战争及以后',
    3 => '太平天国革命',
    4 => '第二次鸦片战争',
    5 => '第二次鸦片战争以后的时期',
    6 => '辛亥革命',
    7 => '中华民国早期',
    8 => '五四运动和中国共产党成立',
    9 => '第一次国内革命战争时期',
    10 => '第二次国内革命战争时期',
    11 => '抗日战争时期',
    12 => '第三次国内革命战争时期',
  ),
  '党史' => 
  array (
    0 => '新民主主义革命时期',
    1 => '社会主义革命和建设时期',
    2 => '党的地方组织史料',
    3 => '党史参考资料',
  ),
  '考古' => 
  array (
    0 => '考古学理论与方法',
    1 => '世界考古',
    2 => '中国考古',
  ),
  '人物传记' => 
  array (
    0 => '传记研究与编写',
    1 => '世界人物',
    2 => '中国人物',
    3 => '外国人物',
  ),
  '世界人物' => 
  array (
    0 => '世界人物传记',
    1 => '世界各时代人物总传',
    2 => '世界人物各科总传',
    3 => '世界人物民族谱系',
  ),
  '中国人物' => 
  array (
    0 => '中国人物传记总论',
    1 => '中国人物普通总传',
    2 => '中国各科人物传记',
  ),
  '中国各科人物传记' => 
  array (
    0 => '中国文史哲、军事、财经人物',
    1 => '中国理工类人物',
    2 => '中国社会、政治人物',
    3 => '中国其他人物',
  ),
  '哲学' => 
  array (
    0 => '哲学理论',
    1 => '世界哲学',
    2 => '中国哲学',
    3 => '思维科学',
    4 => '自然辩证法',
  ),
  '哲学理论' => 
  array (
    0 => '基本理论问题',
    1 => '辩证唯物主义',
    2 => '历史唯物主义',
    3 => '哲学流派及其研究',
  ),
  '中国哲学' => 
  array (
    0 => '三国－五代哲学',
    1 => '宋、元、明、清哲学',
    2 => '近、现代哲学',
    3 => '马克思主义哲学在中国的传播、发展及其他',
  ),
  '伦理学' => 
  array (
    0 => '伦理学基本理论',
    1 => '人生观、人生哲学、国家道德',
    2 => '职业道德',
    3 => '综合(家庭、婚姻道德、社会公德、个人修养)',
  ),
  '宗教' => 
  array (
    0 => '综合',
    1 => '佛教',
    2 => '道教',
    3 => '伊斯兰教',
    4 => '基督教',
  ),
  '社会科学Ⅰ辑' => 
  array (
    0 => '马克思主义',
    1 => '中国共产党',
    2 => '政治学',
    3 => '中国政治与国际政治',
    4 => '行政学及国家行政管理',
    5 => '政党及群众组织',
    6 => '军事',
    7 => '公安',
    8 => '法理、法史',
    9 => '宪法',
    10 => '行政法及地方法制',
    11 => '民商法',
    12 => '诉讼法与司法制度',
    13 => '国际法',
  ),
  '马克思、恩格斯、列宁、斯大林、毛泽东、邓小平著作' => 
  array (
    0 => '马克思、恩格斯著作',
    1 => '列宁著作',
    2 => '斯大林著作',
    3 => '毛泽东著作',
    4 => '邓小平著作',
    5 => '马、恩、列、斯、毛、邓著作汇编',
  ),
  '马克思主义、列宁主义、毛泽东思想、邓小平理论的学习和研究' => 
  array (
    0 => '列宁主义',
    1 => '斯大林思想',
    2 => '毛泽东思想',
    3 => '邓小平理论及其发展',
    4 => '著作汇编的学习和研究',
  ),
  '邓小平理论及其发展' => 
  array (
    0 => '邓小平理论',
    1 => '党的执政能力',
    2 => '“三个代表”理论和党员先进性教育',
    3 => '科学发展观与和谐社会',
  ),
  '中国共产党' => 
  array (
    0 => '建党理论、党章',
    1 => '党的组织、会议及其文献',
    2 => '党史',
    3 => '党的总路线和总政策',
    4 => '党的领导',
    5 => '党的建设',
    6 => '中国共产党与各国共产党的关系',
    7 => '中国共产主义青年团',
  ),
  '党的组织、会议及其文献' => 
  array (
    0 => '中央与地方组织、会议及其文献',
    1 => '会议文献的学习参考资料',
  ),
  '党的建设' => 
  array (
    0 => '思想建设',
    1 => '组织建设',
    2 => '党员',
    3 => '整风、整党运动',
    4 => '党的基层工作',
  ),
  '政治学' => 
  array (
    0 => '政治理论',
    1 => '阶级、阶层理论',
    2 => '革命理论',
    3 => '国家理论',
    4 => '无产阶级革命与无产阶级专政理论',
    5 => '民族殖民地问题理论',
    6 => '政治流派与思潮、其他政治理论问题',
    7 => '政治学史、政治思想史',
  ),
  '政党及群众组织' => 
  array (
    0 => '政党理论',
    1 => '国际共产主义运动',
    2 => '中国其他政党',
    3 => '各国政党',
    4 => '群众组织运动',
  ),
  '中国政治与国际政治' => 
  array (
    0 => '中国政治',
    1 => '世界政治',
    2 => '各国政治',
    3 => '外交理论与各国外交',
  ),
  '中国政治' => 
  array (
    0 => '政策政论、中国革命和建设问题',
    1 => '政治制度与国家机构',
    2 => '政治运动、政治事件',
    3 => '阶级结构与社会结构',
    4 => '地方政治',
    5 => '政治制度史',
  ),
  '阶级结构与社会结构' => 
  array (
    0 => '我国社会主义历史时期的阶级和阶级斗争',
    1 => '阶级、阶层',
    2 => '中国人民政治协商会议',
    3 => '民主党派及其活动',
  ),
  '社会学及统计学' => 
  array (
    0 => '社会调查和社会分析',
    1 => '社会生活与社会问题',
    2 => '社会学理论',
    3 => '社会发展和变迁',
    4 => '社会结构和社会关系',
    5 => '社会工作、社会管理、社会规划',
    6 => '统计学理论与方法',
    7 => '世界各国统计工作',
    8 => '世界各国统计资料',
  ),
  '世界政治' => 
  array (
    0 => '世界政治概况',
    1 => '国际政治矛盾与斗争',
    2 => '世界政治制度与国家机构',
    3 => '世界政治事件',
    4 => '世界社会结构',
    5 => '社会保障与社会福利',
    6 => '世界政治制度史',
  ),
  '各国政治' => 
  array (
    0 => '亚洲',
    1 => '非洲',
    2 => '欧洲',
    3 => '大洋洲及太平洋岛屿',
    4 => '美洲',
  ),
  '外交理论与各国外交' => 
  array (
    0 => '外交、国际关系理论',
    1 => '国际关系',
    2 => '中国外交',
    3 => '各国外交',
  ),
  '职业教育' => 
  array (
    0 => '思想政治教育',
    1 => '教师与学生',
    2 => '学校管理',
    3 => '教学理论、教学法',
    4 => '职业技术教育综述',
    5 => '各类型职业技术学校',
    6 => '世界各国职业技术教育概况',
  ),
  '行政学及国家行政管理' => 
  array (
    0 => '行政学',
    1 => '国家机关工作与干部工作',
    2 => '民政工作',
    3 => '民族工作',
    4 => '侨务工作',
    5 => '宗教事务工作',
    6 => '群众自治工作',
  ),
  '中国其他政党' => 
  array (
    0 => '民主党派',
    1 => '民国及民国以前政党',
  ),
  '各国政党' => 
  array (
    0 => '各国共产党',
    1 => '其他政党',
  ),
  '群众组织运动' => 
  array (
    0 => '工人运动与组织',
    1 => '农民运动与组织',
    2 => '青年、学生运动与组织',
    3 => '妇女运动与组织',
  ),
  '工人运动与组织' => 
  array (
    0 => '中国工人运动与组织',
    1 => '世界工人运动与组织',
  ),
  '农民运动与组织' => 
  array (
    0 => '中国农民运动与组织',
    1 => '世界农民运动与组织',
  ),
  '青年、学生运动与组织' => 
  array (
    0 => '中国青年、学生运动与组织',
    1 => '世界青年、学生运动与组织',
  ),
  '妇女运动与组织' => 
  array (
    0 => '中国妇女运动与组织',
    1 => '世界妇女运动与组织',
  ),
  '军事' => 
  array (
    0 => '军事理论与军史',
    1 => '军事组织与管理',
    2 => '战略、战役、战术',
  ),
  '军事理论与军史' => 
  array (
    0 => '军事理论',
    1 => '中国军史',
    2 => '世界及各国军史',
  ),
  '法理、法史' => 
  array (
    0 => '法律理论',
    1 => '各国法律',
    2 => '中国法制史',
    3 => '案例分析',
  ),
  '宪法' => 
  array (
    0 => '国家法、宪法',
  ),
  '行政法及地方法制' => 
  array (
    0 => '行政法',
    1 => '土地法',
    2 => '农业经济管理法令',
    3 => '劳动法',
    4 => '自然资源与环境保护法',
    5 => '地方法制',
  ),
  '民商法' => 
  array (
    0 => '民法',
    1 => '婚姻家庭法',
    2 => '商法',
  ),
  '诉讼法与司法制度' => 
  array (
    0 => '诉讼法',
    1 => '司法制度',
  ),
  '诉讼法' => 
  array (
    0 => '制度与方法',
    1 => '民事诉讼法',
    2 => '刑事诉讼法',
    3 => '行政诉讼法',
    4 => '仲裁法',
  ),
  '国际法' => 
  array (
    0 => '国际法理论',
    1 => '国际经济法',
    2 => '国际私法',
  ),
  '社会科学Ⅱ辑' => 
  array (
    0 => '社会科学理论与方法',
    1 => '社会学及统计学',
    2 => '人才学与劳动科学',
    3 => '教育理论与教育管理',
    4 => '学前教育',
    5 => '初等教育',
    6 => '中等教育',
    7 => '高等教育',
    8 => '职业教育',
    9 => '成人教育与特殊教育',
    10 => '体育',
  ),
  '社会科学理论与方法' => 
  array (
    0 => '社会科学理论与方法论',
    1 => '社会科学现状及发展',
    2 => '机关、团体、会议',
    3 => '社会科学研究方法、工作方法',
    4 => '社会科学教育、文献及参考工具书',
  ),
  '人才学与劳动科学' => 
  array (
    0 => '人才学',
    1 => '劳动科学',
  ),
  '教育理论与教育管理' => 
  array (
    0 => '教育理论',
    1 => '电化教育',
    2 => '教育心理学',
    3 => '教育行政、学校管理',
    4 => '学校建筑和设备',
    5 => '世界各国教育事业',
    6 => '自然科学教育与普及',
    7 => '教育管理学',
  ),
  '教育理论' => 
  array (
    0 => '教育基本理论及教育职能',
    1 => '全面发展教育',
    2 => '智育、美育、劳动技术教育',
    3 => '教育与其他科学关系、教育学专论',
    4 => '教育学派及教育学史、教育思想史',
  ),
  '高等教育' => 
  array (
    0 => '思想政治教育、德育',
    1 => '高等教育理论',
    2 => '研究生教育',
    3 => '各类型高等学校',
    4 => '中国及地方高等教育',
    5 => '世界各国教育',
    6 => '师范教育',
  ),
  '中等教育' => 
  array (
    0 => '教学理论',
    1 => '教师与学生、学校与家庭和社会',
    2 => '中等教育理论、思想教育、学校管理及各国概况',
    3 => '各科教学法、教学参考书、辅导用书',
  ),
  '电化教育' => 
  array (
    0 => '电化教育理论',
    1 => '视听教学',
    2 => '广播电视教学',
    3 => '程序教学',
    4 => '计算机教学',
    5 => '电化教材',
  ),
  '教师与学生、学校与家庭和社会' => 
  array (
    0 => '学生',
    1 => '学校与家庭、学校与社会',
    2 => '教师、班主任及师生关系',
    3 => '教师、班主任、师生关系',
  ),
  '教育行政、学校管理' => 
  array (
    0 => '教育行政',
    1 => '健康教育',
  ),
  '世界各国教育事业' => 
  array (
    0 => '中国教育事业',
    1 => '各国教育事业',
  ),
  '学前教育' => 
  array (
    0 => '幼教理论',
    1 => '思想品德教育',
    2 => '幼儿教学',
    3 => '世界各国幼教概况',
  ),
  '初等教育' => 
  array (
    0 => '初等教育理论、思想教育、学校管理及各国概况',
    1 => '教学理论与教学方法',
    2 => '教材、课本、辅助教材',
    3 => '各科教学法、教学参考书',
  ),
  '初等教育理论、思想教育、学校管理及各国概况' => 
  array (
    0 => '初等教育理论',
    1 => '政治思想教育',
    2 => '中国各类型初等教育概况',
    3 => '世界各国及地区初等教育概况',
  ),
  '各科教学法、教学参考书' => 
  array (
    0 => '自然、常识',
    1 => '音乐、美术',
    2 => '体育、游戏',
  ),
  '中等教育理论、思想教育、学校管理及各国概况' => 
  array (
    0 => '中等教育理论',
    1 => '中国与地区各级、各类教育状况',
    2 => '世界各国教育状况',
  ),
  '科学研究管理' => 
  array (
    0 => '科学研究工作',
    1 => '科学学',
    2 => '世界科技事业',
    3 => '中国科技事业',
  ),
  '成人教育与特殊教育' => 
  array (
    0 => '成人教育、业余教育',
    1 => '华侨教育、侨民教育',
    2 => '少数民族教育',
    3 => '特殊教育',
    4 => '社会教育',
    5 => '家庭教育',
    6 => '自学',
  ),
  '成人教育、业余教育' => 
  array (
    0 => '成教综述',
    1 => '初等成人业余教育',
    2 => '中等成人业余教育',
    3 => '高等成人业余教育',
    4 => '农民业余教育',
    5 => '职工教育',
    6 => '函授、刊授教育',
    7 => '广播、电视教育',
    8 => '世界各国成人业余教育概况',
  ),
  '体育' => 
  array (
    0 => '体育理论',
    1 => '世界体育',
    2 => '田径运动',
    3 => '体操运动',
    4 => '球类运动',
    5 => '武术及民族形式体育',
    6 => '水上、冰上与雪上运动',
    7 => '其它体育运动',
    8 => '文体活动',
  ),
  '体育理论' => 
  array (
    0 => '体育基础科学',
    1 => '体育锻炼',
    2 => '体育教育',
    3 => '运动训练、运动竞赛',
  ),
  '世界体育' => 
  array (
    0 => '世界体育组织、世界体育竞赛、世界体育科学、教育、体育史',
    1 => '中国体育组织、中国体育竞赛、中国体育科学、教育、体育史',
    2 => '各国',
    3 => '运动场地与设备',
    4 => '体育运动技术',
  ),
  '田径运动' => 
  array (
    0 => '径项',
    1 => '田项',
    2 => '全能',
  ),
  '体操运动' => 
  array (
    0 => '基本体操',
    1 => '竞技体操',
    2 => '艺术体操及其它',
  ),
  '球类运动' => 
  array (
    0 => '篮球',
    1 => '排球',
    2 => '足球',
    3 => '手球',
    4 => '网球',
    5 => '乒乓球',
    6 => '羽毛球及其它',
  ),
  '文体活动' => 
  array (
    0 => '棋类、文体类',
  ),
  '信息科技' => 
  array (
    0 => '无线电电子学',
    1 => '电信技术',
    2 => '计算机硬件技术',
    3 => '计算机软件及计算机应用',
    4 => '互联网技术',
    5 => '自动化技术',
    6 => '新闻与传媒',
    7 => '出版',
    8 => '图书情报与数字图书馆',
    9 => '档案及博物馆',
  ),
  '无线电电子学' => 
  array (
    0 => '电子工业',
    1 => '真空电子技术',
    2 => '半导体技术',
    3 => '微电子学、集成电路(IC)',
    4 => '电子元件、组件',
    5 => '基本电子电路',
  ),
  '半导体技术' => 
  array (
    0 => '半导体二极管',
    1 => '半导体三极管(晶体管)',
    2 => '晶闸管(可控硅)',
    3 => '半导体整流器',
    4 => '半导体光电器件',
    5 => '半导体热电器件、热敏电阻',
  ),
  '微电子学、集成电路(IC)' => 
  array (
    0 => '微模组件',
    1 => '半导体集成电路(固体电路)',
    2 => '膜集成电路',
    3 => '混合集成电路',
    4 => '中、大、超大规模集成电路',
    5 => '真空集成电路',
    6 => '光学集成电路(集成光路)',
    7 => '功能块(分子电路)',
    8 => '微电子学、集成电路应用',
  ),
  '电子元件、组件' => 
  array (
    0 => '微波元件、微波铁氧体元件',
    1 => '电声器件',
    2 => '声光器件',
  ),
  '基本电子电路' => 
  array (
    0 => '电子电路、网络、变能器、均衡器及衰减器(衰耗器)',
    1 => '滤波技术、滤波器',
    2 => '放大技术、放大器',
    3 => '功率合成器',
    4 => '频率合成技术、频率合成器',
    5 => '振荡技术、振荡器',
    6 => '调制技术与调制器、解调技术与解调器',
    7 => '倍频器、分频器、变频器',
    8 => '脉冲技术、脉冲电路',
    9 => '数字电路',
    10 => '开关电路',
    11 => '变能器、均衡器、衰减器(衰耗器)及其他',
  ),
  '电信技术' => 
  array (
    0 => '馈线设备(传输线和波导)',
    1 => '天线',
    2 => '发送设备、发射机',
    3 => '接收设备、无线电收音机',
    4 => '电源',
    5 => '终端设备',
    6 => '通信',
    7 => '无线通信',
    8 => '广播',
    9 => '电视',
    10 => '雷达',
    11 => '无线电导航',
    12 => '电子对抗(干扰及抗干扰)',
    13 => '无线电、电信测量技术及仪器',
    14 => '无线电电子学的应用',
  ),
  '通信' => 
  array (
    0 => '通信理论',
    1 => '电声技术和语音信号处理',
    2 => '通信线路工程、通信网',
    3 => '通信系统(传输系统)',
    4 => '电话、电报、传真',
    5 => '保密通信与通信安全',
    6 => '数据通信',
  ),
  '计算机硬件技术' => 
  array (
    0 => '一般计算器和计算机',
    1 => '电子计算机',
    2 => '微型计算机',
    3 => '其他计算机',
  ),
  '电子计算机' => 
  array (
    0 => '基本电路',
    1 => '运算器和控制器(中央处理机)',
    2 => '存贮器',
    3 => '外部设备',
    4 => '信息转换及其设备',
    5 => '总线、通道',
    6 => '仿真器',
    7 => '各种电子数字计算机',
  ),
  '微型计算机' => 
  array (
    0 => '微机的通讯和应用',
    1 => '嵌入式系统',
    2 => '单版微型计算机',
    3 => '个人计算机',
    4 => '服务器及网络计算机',
  ),
  '嵌入式系统' => 
  array (
    0 => '各种微处理机',
    1 => '微处理机的应用',
  ),
  '计算机软件及计算机应用' => 
  array (
    0 => '计算机理论与方法',
    1 => '安全保密',
    2 => '计算机软件概况',
    3 => '程序设计、软件工程',
    4 => '程序语言、算法语言',
    5 => '编译程序、解释程序',
    6 => '管理程序、管理系统',
    7 => '操作系统',
    8 => '数据库理论及系统',
    9 => '程序包(应用软件)',
    10 => '专用应用程序',
    11 => '计算机的应用',
  ),
  '程序设计、软件工程' => 
  array (
    0 => '一般程序设计',
    1 => '网络程序设计',
    2 => '软件工程',
    3 => '软件工具、工具软件',
  ),
  '程序语言、算法语言' => 
  array (
    0 => '硬件语言',
    1 => '程序语言',
    2 => '网络语言',
  ),
  '计算机的应用' => 
  array (
    0 => '信息处理(信息加工)',
    1 => '计算机在其他方面的应用',
  ),
  '信息处理(信息加工)' => 
  array (
    0 => '模式识别与装置',
    1 => '机器辅助技术',
    2 => '计算机仿真',
    3 => '翻译、检索、诊断、教学及其他',
  ),
  '计算机在其他方面的应用' => 
  array (
    0 => '计算机在文化、科学、教育、体育等领域的应用',
    1 => '计算机在政、经、法等领域的应用',
    2 => '计算机在天文学、地球科学等领域的应用',
    3 => '计算机在农业科学领域的应用',
    4 => '计算机在数理科学及化学领域的应用',
    5 => '计算机在交通运输领域的应用',
    6 => '计算机在航空、航天领域的应用',
    7 => '计算机在医药、卫生及生物科学领域的应用',
    8 => '计算机在环境科学及劳动保护科学等领域的应用',
    9 => '计算机在工业技术领域的应用',
    10 => '计算机在军事领域的应用',
  ),
  '互联网技术' => 
  array (
    0 => '计算机网络理论',
    1 => '网络结构与设计',
    2 => '通信协议',
    3 => '通信设备与线路',
    4 => '网络管理与运行',
    5 => '网络安全',
    6 => '网络应用程序',
    7 => '各种网络',
  ),
  '网络应用程序' => 
  array (
    0 => '浏览器与资源',
    1 => '文件传送程序',
    2 => '远程登陆、远程控制',
    3 => '电子邮件及相关问题',
  ),
  '各种网络' => 
  array (
    0 => '局域网',
    1 => '广域网',
    2 => '互联网',
  ),
  '局域网' => 
  array (
    0 => '以太网',
    1 => 'ATM局域网',
    2 => '校园网',
  ),
  '自动化基础理论' => 
  array (
    0 => '自动化系统理论',
    1 => '自动控制理论',
    2 => '自动信息理论',
    3 => '自动模拟理论(自动仿真理论)',
    4 => '开关电路理论',
    5 => '人工智能理论',
  ),
  '自动化系统' => 
  array (
    0 => '一般自动化系统',
    1 => '自动调节、自动调节系统',
    2 => '自动控制、自动控制系统',
    3 => '数据处理、数据处理系统',
    4 => '自动随动、自动随动系统',
    5 => '自动拖动、自动拖动系统',
    6 => '监视、报警、故障诊断系统',
    7 => '自动生产作业线',
  ),
  '自动化技术在各方面的应用' => 
  array (
    0 => '自动化技术在矿业工程中的应用',
    1 => '自动化技术在石油、天然气工业中的应用',
    2 => '自动化技术在冶金工业中的应用',
    3 => '自动化技术在金属工业中的应用',
    4 => '自动化技术在机械、仪表工业中的应用',
    5 => '自动化技术在原子能及动力工业中的应用',
    6 => '自动化技术在电力系统中的应用',
    7 => '自动化技术在化学工业中的应用',
    8 => '自动化技术在轻工业及手工业中的应用',
    9 => '自动化技术在建筑工业中的应用',
    10 => '自动化技术在水利工程中的应用',
    11 => '自动化技术在交通运输中的应用',
    12 => '自动化技术在航空、航天中的应用',
    13 => '自动化技术在天文学及地球科学中的应用',
    14 => '自动化技术在环境科学、劳动保护科学中的应用',
    15 => '自动化技术在农业中的应用',
    16 => '自动化技术在军事工业中的应用',
    17 => '自动化技术在医药、卫生及生物科学中的应用',
  ),
  '新闻与传媒' => 
  array (
    0 => '信息与传播理论',
    1 => '新闻学、新闻事业',
    2 => '广播电视',
  ),
  '新闻学、新闻事业' => 
  array (
    0 => '世界各国新闻事业',
  ),
  '出版' => 
  array (
    0 => '出版理论',
    1 => '组织、管理',
    2 => '编辑工作',
    3 => '印刷工作',
    4 => '发行工作',
    5 => '图书宣传评价',
    6 => '世界各国出版事业',
    7 => '中国出版事业',
  ),
  '图书情报与数字图书馆' => 
  array (
    0 => '图书馆学、图书馆事业',
    1 => '情报学、情报工作',
  ),
  '图书馆学、图书馆事业' => 
  array (
    0 => '图书馆学及管理',
    1 => '数字图书馆',
    2 => '读者工作及藏书建设',
    3 => '文献标引与编目',
    4 => '各种文献工作及文献学',
    5 => '目录学',
    6 => '各类型图书馆',
    7 => '世界各国图书馆事业',
    8 => '中国图书馆事业',
  ),
  '情报学、情报工作' => 
  array (
    0 => '情报学及情报工作体制、组织',
    1 => '情报工作',
    2 => '情报事业',
  ),
  '档案及博物馆' => 
  array (
    0 => '档案学、档案事业',
    1 => '博物馆学、博物馆事业',
  ),
  '档案学、档案事业' => 
  array (
    0 => '档案学',
    1 => '档案管理',
    2 => '收集和整理、保管和利用、公布、出版',
    3 => '各类型档案',
    4 => '建筑和设备',
    5 => '世界各国档案事业',
    6 => '中国档案事业',
  ),
  '经济与管理科学' => 
  array (
    0 => '宏观经济管理与可持续发展',
    1 => '经济理论及经济思想史',
    2 => '经济体制改革',
    3 => '经济统计',
    4 => '农业经济',
    5 => '工业经济',
    6 => '交通运输经济',
    7 => '企业经济',
    8 => '旅游',
    9 => '文化经济',
    10 => '信息经济与邮政经济',
    11 => '服务业经济',
    12 => '贸易经济',
    13 => '财政与税收',
    14 => '金融',
    15 => '投资',
    16 => '会计',
    17 => '审计',
    18 => '市场研究与信息',
    19 => '管理学',
    20 => '领导学与决策学',
    21 => '科学研究管理',
  ),
  '宏观经济管理与可持续发展' => 
  array (
    0 => '宏观经济管理',
    1 => '可持续发展',
  ),
  '宏观经济管理' => 
  array (
    0 => '国民经济计划与管理',
    1 => '经济计算、经济数学方法',
    2 => '劳动经济',
    3 => '物资经济',
    4 => '城市与市政经济',
    5 => '基本建设经济',
  ),
  '经济理论及经济思想史' => 
  array (
    0 => '经济概论',
    1 => '社会生产方式',
    2 => '经济学分支科学及各科经济学',
    3 => '经济思想史',
  ),
  '经济体制改革' => 
  array (
    0 => '世界经济',
    1 => '中国经济',
    2 => '其他各国经济',
  ),
  '中国经济' => 
  array (
    0 => '中国经济方针政策其阐述',
    1 => '社会经济结构与体制',
    2 => '经济建设与发展',
    3 => '对外经济关系',
    4 => '人民生活状况',
    5 => '地方经济',
    6 => '中国经济史',
  ),
  '经济统计' => 
  array (
    0 => '经济统计概述',
    1 => '经济统计方法',
    2 => '专门经济统计',
    3 => '国际经济统计',
    4 => '经济统计组织与工作',
  ),
  '农业经济' => 
  array (
    0 => '农业经济理论',
    1 => '世界农业经济',
    2 => '中国农业经济',
  ),
  '农业经济理论' => 
  array (
    0 => '土地问题理论',
    1 => '农业建设与发展',
    2 => '农业生产',
    3 => '农业企业经营与管理',
  ),
  '中国农业经济' => 
  array (
    0 => '农业计划与管理',
    1 => '农业部门经济',
    2 => '方针政策及其阐述',
    3 => '农业经济结构与体制',
    4 => '农业经济建设与发展',
    5 => '农业企业组织与管理',
    6 => '农业生产组织与经营管理',
    7 => '地方农业经济及农民生活状况',
    8 => '中国农业经济史',
  ),
  '农业经济建设与发展' => 
  array (
    0 => '农业发展速度与部门间比例',
    1 => '农业区域规划与生产布局',
    2 => '农业资源开发和利用',
    3 => '农业技术改造、农业技术经济',
    4 => '集约耕种、多种经营、综合开发',
    5 => '农业商品生产、农业劳动生产率',
    6 => '农产品价格与市场',
    7 => '农业劳动力与农业人口',
    8 => '农业收入与分配',
    9 => '农业资金、农业投资',
  ),
  '工业经济' => 
  array (
    0 => '工业经济理论',
    1 => '世界工业经济',
    2 => '中国工业经济',
  ),
  '中国工业经济' => 
  array (
    0 => '工业建设与发展',
    1 => '工业部门经济',
    2 => '工业经济结构与体制',
    3 => '工业计划与管理',
    4 => '工业企业组织与经营管理',
    5 => '地方工业经济',
    6 => '中国工业经济史',
  ),
  '世界工业经济' => 
  array (
    0 => '各工业部门经济',
    1 => '各国工业经济',
  ),
  '中国金融' => 
  array (
    0 => '方针政策',
    1 => '金融、银行体制',
    2 => '银行制度与业务',
    3 => '金融组织、银行',
    4 => '信贷',
    5 => '金融市场',
    6 => '汇兑、对外金融关系',
    7 => '地方金融事业及金融史、银行史',
  ),
  '企业经济' => 
  array (
    0 => '企业经济理论和方法',
    1 => '企业体制',
    2 => '企业计划与经营决策',
    3 => '企业生产管理',
    4 => '企业营销管理',
    5 => '企业财务管理',
    6 => '各种企业经济',
    7 => '世界各国企业经济',
  ),
  '世界各国企业经济' => 
  array (
    0 => '世界企业经济',
    1 => '中国企业经济',
    2 => '各国企业经济',
  ),
  '旅游事业' => 
  array (
    0 => '中国旅游事业',
    1 => '世界旅游及各国旅游事业',
  ),
  '旅游与商业' => 
  array (
    0 => '旅游展会',
    1 => '旅游餐饮、饭店',
  ),
  '服务业经济' => 
  array (
    0 => '娱乐业',
    1 => '服务业经济概论',
    2 => '旅馆业',
    3 => '餐饮业',
    4 => '其它服务业',
  ),
  '文化经济' => 
  array (
    0 => '文化经济学',
    1 => '世界各国文化产业',
    2 => '中国文化产业',
    3 => '新闻出版产业',
    4 => '广播电视产业',
    5 => '群众文化产业',
    6 => '娱乐业、文化服务业',
    7 => '图书馆档案与博物馆产业',
    8 => '艺术市场',
    9 => '收藏品市场',
  ),
  '信息经济与邮政经济' => 
  array (
    0 => '信息产业经济',
    1 => '电信',
    2 => '邮政',
    3 => '邮电经济理论',
    4 => '世界各国邮电事业',
  ),
  '贸易经济' => 
  array (
    0 => '国内贸易经济',
    1 => '中国国内贸易经济',
    2 => '世界各国国内贸易经济',
    3 => '国际贸易',
    4 => '中国对外贸易',
    5 => '商品学',
  ),
  '国内贸易经济' => 
  array (
    0 => '贸易经济理论与方法',
    1 => '贸易经济结构与体制',
    2 => '贸易计划与管理体制',
    3 => '商品流通与市场',
    4 => '商品价格与流通费用',
    5 => '商业企业组织与管理',
    6 => '商业技术与设备',
    7 => '各种商业企业',
    8 => '商业工作者',
  ),
  '财政与税收' => 
  array (
    0 => '财政理论',
    1 => '世界财政',
    2 => '中国财政',
  ),
  '中国财政' => 
  array (
    0 => '方针政策与财政制度',
    1 => '预算与决算',
    2 => '财政收入与税收',
    3 => '国家内债、外债',
    4 => '地方财政、农村财政',
    5 => '财政史',
  ),
  '金融' => 
  array (
    0 => '货币',
    1 => '金融、银行',
  ),
  '金融、银行' => 
  array (
    0 => '金融银行理论',
    1 => '国际金融',
    2 => '各国金融',
    3 => '中国金融',
    4 => '金融危机及其风险防范',
  ),
  '投资市场理论与实践' => 
  array (
    0 => '证券',
    1 => '保险',
    2 => '房地产',
    3 => '信托',
    4 => '期货、期权',
    5 => '银行信贷',
    6 => '区域投资市场',
    7 => '港、澳、台投资市场',
  ),
  '投资' => 
  array (
    0 => '投资理论与实践',
    1 => '投资市场理论与实践',
    2 => '国际投资',
    3 => '投资基金',
    4 => '有关投资的法律、法规、政策',
  ),
  '国际投资' => 
  array (
    0 => '世界各国投资',
    1 => '中外合作与外资利用',
  ),
  '会计' => 
  array (
    0 => '会计学',
    1 => '会计簿记方法',
    2 => '会计设备',
    3 => '会计工作组织与制度',
    4 => '各种会计和簿记',
    5 => '各部门会计和簿记',
  ),
  '审计' => 
  array (
    0 => '总论(审计理论)',
    1 => '审计方法与技术',
    2 => '审计工作组织与制度',
    3 => '各类审计',
    4 => '专业审计',
    5 => '审计法',
  ),
  '领导学与决策学' => 
  array (
    0 => '领导学',
    1 => '决策学',
  ),
);
?>